Script started on 2020-02-06 14:47:06-05:00 [TERM="xterm-256color" TTY="/dev/pts/1" COLUMNS="94" LINES="49"]
bash: /home/umrigar/cs220/bin/student.rc: No such file or directory
tman1@g7-16:~/i240b/submit/lab2$ ls
exercises  lab2  lab2.html  lab2.log  lab2.pdf	lab2.umt
tman1@g7-16:~/i240b/submit/lab2$ cd exercises/
tman1@g7-16:~/i240b/submit/lab2/exercises$ ls
1-hello  2-hello  3-overload  Makefile
tman1@g7-16:~/i240b/submit/lab2/exercises$ cd 1-hello/
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ls
hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ cd [K[K[Kcat README [K[K[K[K[K[K[K[Kr[K r[KE[KREADME 
Print out a line saying hello to each command-line argument.
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ emacs hello.c.[Kc
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ./hello 
usage: ./hello NAME...
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ./hello bart lis
hello bart
hello lis
hello tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ a[K./hello bart lisa
hello bart
hello lisa
hello tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ cat hello.cc
#include <iostream>
#include <cstdlib>

static void
sayHello(const char *name)
{
  std::cout << "hello " << name << std::endl;
}

int 
main(int argc, const char *argv[])
{
  if (argc == 1) {
    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
    std::exit(1);
  }
  else {
    for (int i = 1; i <= argc; i++) {
      sayHello(argv[i]);
    }
  }
}
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ gdb b[Khello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) un[K[Krun
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello 
usage: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello NAME...
[Inferior 1 (process 195073) exited with code 01]
(gdb) ru [Kn  li[Kis
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello lis
ahello lis
hello [Inferior 1 (process 195089) exited normally]
(gdb) a[Krun isa
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello isa
hello isa
hello [Inferior 1 (process 195098) exited normally]
(gdb) hello  is
Undefined command: "hello".  Try "help".
(gdb) hello  is[K[K[K[K[K[K[K[K[Krun  isa
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello isa
hello isa
hello [Inferior 1 (process 195151) exited normally]
(gdb) run hello
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello hello
hello hello
hello [Inferior 1 (process 195160) exited normally]
(gdb) statt[K[Krt bart lias[K[Ksa
Temporary breakpoint 1 at 0x5555555551cd: file hello.cc, line 13.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:13
13	  if (argc == 1) {
(gdb) info break
No breakpoints or watchpoints.
(gdb) list
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) ls
Undefined command: "ls".  Try "help".
(gdb) l
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l-[K[Kl1
Undefined command: "l1".  Try "help".
(gdb) l 1
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) l 0
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) l -1
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
(gdb) l 1
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) l 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
(gdb) l 0
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) l
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
(gdb) l
21	  }
22	}
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb) si
0x00005555555551d1	13	  if (argc == 1) {
(gdb) ni
18	    for (int i = 1; i <= argc; i++) {
(gdb) si
0x0000555555555230	18	    for (int i = 1; i <= argc; i++) {
(gdb) i
"info" must be followed by the name of an info command.
List of info subcommands:

info address -- Describe where symbol SYM is stored
info all-registers -- List of all registers and their contents
info args -- Argument variables of current stack frame
info auto-load -- Print current status of auto-loaded files
info auxv -- Display the inferior's auxiliary vector
info bookmarks -- Status of user-settable bookmarks
info breakpoints -- Status of specified breakpoints (all user-settable breakpoints if no argument)
info checkpoints -- IDs of currently known checkpoints
info classes -- All Objective-C classes
info common -- Print out the values contained in a Fortran COMMON block
info copying -- Conditions for redistributing copies of GDB
info dcache -- Print information on the dcache performance
info display -- Expressions to display when program stops
info exceptions -- List all Ada exception names
info extensions -- All filename extensions associated with a source language
info files -- Names of targets and files being debugged
info float -- Print the status of the floating point unit
info frame -- All about selected stack frame
info frame-filter -- List all registered Python frame-filters
info functions -- All function names
info guile -- Prefix command for Guile info displays
info handle -- What debugger does when program gets various signals
info inferiors -- Print a list of inferiors being managed
info line -- Core addresses of the code for a source line
info locals -- Local variables of current stack frame
info macro -- Show the definition of MACRO
info macros -- Show the definitions of all macros at LINESPEC
info mem -- Memory region attributes
info os -- Show OS data ARG
info pretty-printer -- GDB command to list all registered pretty-printers
info probes -- Show available static probes
info proc -- Show /proc process information about any running process
info program -- Execution status of the program
info record -- Info record options
info registers -- List of integer registers and their contents
info scope -- List the variables local to a scope
info selectors -- All Objective-C selectors
info set -- Show all GDB settings
info sharedlibrary -- Status of loaded shared object libraries
info signals -- What debugger does when program gets various signals
info skip -- Display the status of skips
info source -- Information about the current source file
info sources -- Source files in the program
info stack -- Backtrace of the stack
info static-tracepoint-markers -- List target static tracepoints markers
--Type <RET> for more, q to quit, c to continue without paging--q[Kq
Quit
(gdb) ls[K
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) b
Breakpoint 2 at 0x555555555230: file hello.cc, line 18.
(gdb) delete 2
(gdb) i b
No breakpoints or watchpoints.
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb)  
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l 5
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) b sayHello
Breakpoint 3 at 0x555555555181: file hello.cc, line 7.
(gdb) delete 2
No breakpoint number 2.
(gdb) i b
Num     Type           Disp Enb Address            What
3       breakpoint     keep y   0x0000555555555181 in sayHello(char const*) at hello.cc:7
(gdb) say[K[K[Ksa[K[Kb sayHello(char const*) [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kb sa
sa_len.c               same_address           save_for_wbackup       sayHello(char const*)
safe-fatal.h           save_for_backup        save_for_wbackup.isra  
(gdb) b sa
sa_len.c               same_address           save_for_wbackup       sayHello(char const*)
safe-fatal.h           save_for_backup        save_for_wbackup.isra  
(gdb) b sayHello(char const*) [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[KsayH[K[K[K[Kb
backtrace    bookmark     break        break-range  bt           
(gdb) b
backtrace    bookmark     break        break-range  bt           
(gdb) b
backtrace    bookmark     break        break-range  bt           
(gdb) breakp[K[K[K[K[K[Ki
if                 inferior           init-if-undefined  interrupt
ignore             info               interpreter-exec   
(gdb) i[Kq
A debugging session is active.

	Inferior 1 [process 195173] will be killed.

Quit anyway? (y or n) n
Not confirmed.
(gdb) kill
Kill the program being debugged? (y or n) y
[Inferior 1 (process 195173) killed]
(gdb) start he[K[Kbart lisa
Temporary breakpoint 4 at 0x5555555551cd: file hello.cc, line 13.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello bart lisa

Temporary breakpoint 4, main (argc=3, argv=0x7fffffffe768) at hello.cc:13
13	  if (argc == 1) {
(gdb) q
A debugging session is active.

	Inferior 1 [process 196489] will be killed.

Quit anyway? (y or n) y
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bast[K[K[Kart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:13
13	  if (argc == 1) {
(gdb) 
Display all 190 possibilities? (y or n)
(gdb) arg[K[K[K
Display all 190 possibilities? (y or n)
!                                mem
+                                monitor
-                                new-ui
<                                next
>                                nexti
actions                          ni
add-auto-load-safe-path          nosharedlibrary
add-auto-load-scripts-directory  output
add-inferior                     overlay
add-symbol-file                  passcount
add-symbol-file-from-memory      path
advance                          print
agent-printf                     print-object
alias                            printf
append                           ptype
apropos                          pwd
attach                           python
awatch                           python-interactive
backtrace                        queue-signal
bookmark                         quit
break                            rbreak
break-range                      rc
bt                               record
call                             refresh
catch                            remote
cd                               remove-inferiors
checkpoint                       remove-symbol-file
clear                            restart
clone-inferior                   restore
collect                          return
commands                         reverse-continue
compare-sections                 reverse-finish
compile                          reverse-next
complete                         reverse-nexti
condition                        reverse-search
continue                         reverse-step
core-file                        reverse-stepi
define                           rni
delete                           rsi
demangle                         run
detach                           rwatch
directory                        save
disable                          search
disassemble                      section
disconnect                       select-frame
display                          set
document                         sharedlibrary
dont-repeat                      shell
--More--[Kdown                             show
--More--[Kdown-silently                    si
--More--[Kdprintf                          signal
--More--[Kdump                             skip
--More--[Kecho                             source
--More--[Kedit                             start
--More--[Kenable                           starti
--More--[Kend                              step
--More--[Keval                             stepi
--More--[Kexec-file                        stepping
--More--[Kexplore                          stop
--More--[Kexpression                       strace
--More--[Kfile                             symbol-file
--More--[Kfind                             tabset
--More--[Kfinish                           target
--More--[Kflash-erase                      task
--More--[Kflushregs                        tbreak
--More--[Kfocus                            tcatch
--More--[Kforward-search                   tdump
--More--[Kframe                            teval
--More--[Kfs                               tfind
--More--[Kftrace                           thbreak
--More--[Kfunction                         thread
--More--[Kgenerate-core-file               tp
--More--[Kgoto-bookmark                    trace
--More--[Kguile                            tsave
--More--[K(gdb) arg[K[K[Kp argc[K
arg                        argp_default_parser        argz-append.c
arg.isra                   argp_doc                   argz-count.c
arg_bool                   argp_err_exit_status       argz-create.c
arg_trimdomain_list        argp_error                 argz-ctsep.c
argc                       argp_failure               argz-delete.c
argp                       argp_fmtstream             argz-extract.c
argp-ba.c                  argp_fmtstream_t           argz-insert.c
argp-eexst.c               argp_help                  argz-next.c
argp-fmtstream.c           argp_hol                   argz-replace.c
argp-fmtstream.h           argp_option                argz-stringify.c
argp-fs-xinl.c             argp_parse                 argz.h
argp-help.c                argp_parser_t              argz_add
argp-parse.c               argp_program_bug_address   argz_add_sep
argp-pv.c                  argp_program_version       argz_append
argp-pvh.c                 argp_program_version_hook  argz_count
argp-xinl.c                argp_state                 argz_create
argp.h                     argp_state_help            argz_create_sep
argp_args_levels           argp_usage                 argz_delete
argp_args_levels.isra      argp_version_argp          argz_extract
argp_args_usage            argp_version_options       argz_insert
argp_child                 argp_version_parser        argz_next
argp_default_argp          argv                       argz_replace
argp_default_options       argz-addsep.c              argz_stringify
(gdb) p arg
arg                        argp_default_parser        argz-append.c
arg.isra                   argp_doc                   argz-count.c
arg_bool                   argp_err_exit_status       argz-create.c
arg_trimdomain_list        argp_error                 argz-ctsep.c
argc                       argp_failure               argz-delete.c
argp                       argp_fmtstream             argz-extract.c
argp-ba.c                  argp_fmtstream_t           argz-insert.c
argp-eexst.c               argp_help                  argz-next.c
argp-fmtstream.c           argp_hol                   argz-replace.c
argp-fmtstream.h           argp_option                argz-stringify.c
argp-fs-xinl.c             argp_parse                 argz.h
argp-help.c                argp_parser_t              argz_add
argp-parse.c               argp_program_bug_address   argz_add_sep
argp-pv.c                  argp_program_version       argz_append
argp-pvh.c                 argp_program_version_hook  argz_count
argp-xinl.c                argp_state                 argz_create
argp.h                     argp_state_help            argz_create_sep
argp_args_levels           argp_usage                 argz_delete
argp_args_levels.isra      argp_version_argp          argz_extract
argp_args_usage            argp_version_options       argz_insert
argp_child                 argp_version_parser        argz_next
argp_default_argp          argv                       argz_replace
argp_default_options       argz-addsep.c              argz_stringify
(gdb) p argc 
Display all 200 possibilities? (y or n)
(gdb) p argc 
$1 = 3
(gdb) arg[K[K[Kp argv
$2 = (const char **) 0x7fffffffe768
(gdb) p argc[Kv[0], p ar
arch_kind_amd              argp_args_usage            argp_state_help
arch_kind_intel            argp_child                 argp_usage
arch_kind_other            argp_default_argp          argp_version_argp
arch_kind_unknown          argp_default_options       argp_version_options
arch_prctl                 argp_default_parser        argp_version_parser
archfname                  argp_doc                   argv
archive_stat               argp_err_exit_status       argz_add
archloaded                 argp_error                 argz_add_sep
archmapped                 argp_failure               argz_append
arena_get2                 argp_fmtstream             argz_count
arena_get2.part            argp_fmtstream_t           argz_create
arena_get_retry            argp_help                  argz_create_sep
arg                        argp_hol                   argz_delete
arg.isra                   argp_option                argz_extract
arg_bool                   argp_parse                 argz_insert
arg_trimdomain_list        argp_parser_t              argz_next
argc                       argp_program_bug_address   argz_replace
argp                       argp_program_version       argz_stringify
argp_args_levels           argp_program_version_hook  
argp_args_levels.isra      argp_state                 
(gdb) p argv[0], p ar
arch_kind_amd              argp_args_usage            argp_state_help
arch_kind_intel            argp_child                 argp_usage
arch_kind_other            argp_default_argp          argp_version_argp
arch_kind_unknown          argp_default_options       argp_version_options
arch_prctl                 argp_default_parser        argp_version_parser
archfname                  argp_doc                   argv
archive_stat               argp_err_exit_status       argz_add
archloaded                 argp_error                 argz_add_sep
archmapped                 argp_failure               argz_append
arena_get2                 argp_fmtstream             argz_count
arena_get2.part            argp_fmtstream_t           argz_create
arena_get_retry            argp_help                  argz_create_sep
arg                        argp_hol                   argz_delete
arg.isra                   argp_option                argz_extract
arg_bool                   argp_parse                 argz_insert
arg_trimdomain_list        argp_parser_t              argz_next
argc                       argp_program_bug_address   argz_replace
argp                       argp_program_version       argz_stringify
argp_args_levels           argp_program_version_hook  
argp_args_levels.isra      argp_state                 
(gdb) p argv[0], p argv[1]
No symbol "p" in current context.
(gdb) p argv[0], p argv[1][C[K[K[K[K[K[K[K[K[K[K[K\
p argv[1]
A syntax error in expression, near `p argv[1]'.
(gdb) p argv[0]p argv[1][C[C[1@;[1@ 
Invalid character ';' in expression.
(gdb) p argv[0]; p argv[1][C[K[K[K[K[K[K[K[K[K[K[K/p argv
No symbol "p" in current context.
(gdb) p argv[0]
$3 = 0x7fffffffea53 "/import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello"
(gdb) p argv
$4 = (const char **) 0x7fffffffe768
(gdb) p argv[1]
$5 = 0x7fffffffeaa0 "bart"
(gdb) p argv[2]
$6 = 0x7fffffffeaa5 "lisa"
(gdb) p argv[3]
$7 = 0x0
(gdb) p argv[4]
$8 = 0x7fffffffeaaa "SHELL=/bin/bash"
(gdb) p argv[4][1P]5]
$9 = 0x7fffffffeaba "SESSION_MANAGER=local/g7-16:@/tmp/.ICE-unix/192740,unix/g7-16:/tmp/.ICE-unix/192740"
(gdb) p *argv
$10 = 0x7fffffffea53 "/import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello"
(gdb) p *argv[K[K[K[K(argv + 1)
$11 = 0x7fffffffeaa0 "bart"
(gdb) p *argv@3
$12 = {
  0x7fffffffea53 "/import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello", 0x7fffffffeaa0 "bart", 0x7fffffffeaa5 "lisa"}
(gdb) ls
Undefined command: "ls".  Try "help".
(gdb) n
new-ui           next             nexti            ni               nosharedlibrary
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      sayHello(argv[i]);
(gdb) p i
$13 = 1
(gdb) c
call              checkpoint        collect           compile           continue
catch             clear             commands          complete          core-file
cd                clone-inferior    compare-sections  condition         
(gdb) c
Continuing.
hello bart
hello lisa
hello [Inferior 1 (process 196549) exited normally]
(gdb) l
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l[Kl
Line number 23 out of range; hello.cc has 22 lines.
(gdb) backtrace [K[K[K[K[K[K[K[K[K
backtrace    bookmark     break        break-range  bt           
(gdb) b
backtrace    bookmark     break        break-range  bt           
(gdb) backtrace 
No stack.
(gdb) back [Ktrace [K[K[K[K[K[K[K[K[K[Kstart bart lisa
Temporary breakpoint 2 at 0x5555555551cd: file hello.cc, line 13.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/1-hello/hello bart lisa

Temporary breakpoint 2, main (argc=3, argv=0x7fffffffe768) at hello.cc:13
13	  if (argc == 1) {
(gdb) b sayHello(char const*) 
Breakpoint 3 at 0x555555555181: file hello.cc, line 7.
(gdb) c
Continuing.

Breakpoint 3, sayHello (name=0x7fffffffeaa0 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) l
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) b
Note: breakpoint 3 also set at pc 0x555555555181.
Breakpoint 4 at 0x555555555181: file hello.cc, line 7.
(gdb) in[K b
Num     Type           Disp Enb Address            What
3       breakpoint     keep y   0x0000555555555181 in sayHello(char const*) at hello.cc:7
	breakpoint already hit 1 time
4       breakpoint     keep y   0x0000555555555181 hello.cc:7
(gdb) rm 4[K[K[K[Kdelete 4
(gdb) i b
Num     Type           Disp Enb Address            What
3       breakpoint     keep y   0x0000555555555181 in sayHello(char const*) at hello.cc:7
	breakpoint already hit 1 time
(gdb) d[Kbacktrace 
#0  sayHello (name=0x7fffffffeaa0 "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
(gdb) i s
#0  sayHello (name=0x7fffffffeaa0 "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
(gdb) i
"info" must be followed by the name of an info command.
List of info subcommands:

info address -- Describe where symbol SYM is stored
info all-registers -- List of all registers and their contents
info args -- Argument variables of current stack frame
info auto-load -- Print current status of auto-loaded files
info auxv -- Display the inferior's auxiliary vector
info bookmarks -- Status of user-settable bookmarks
info breakpoints -- Status of specified breakpoints (all user-settable breakpoints if no argument)
info checkpoints -- IDs of currently known checkpoints
info classes -- All Objective-C classes
info common -- Print out the values contained in a Fortran COMMON block
info copying -- Conditions for redistributing copies of GDB
info dcache -- Print information on the dcache performance
info display -- Expressions to display when program stops
info exceptions -- List all Ada exception names
info extensions -- All filename extensions associated with a source language
info files -- Names of targets and files being debugged
info float -- Print the status of the floating point unit
info frame -- All about selected stack frame
info frame-filter -- List all registered Python frame-filters
info functions -- All function names
info guile -- Prefix command for Guile info displays
info handle -- What debugger does when program gets various signals
info inferiors -- Print a list of inferiors being managed
info line -- Core addresses of the code for a source line
info locals -- Local variables of current stack frame
info macro -- Show the definition of MACRO
info macros -- Show the definitions of all macros at LINESPEC
info mem -- Memory region attributes
info os -- Show OS data ARG
info pretty-printer -- GDB command to list all registered pretty-printers
info probes -- Show available static probes
info proc -- Show /proc process information about any running process
info program -- Execution status of the program
info record -- Info record options
info registers -- List of integer registers and their contents
info scope -- List the variables local to a scope
info selectors -- All Objective-C selectors
info set -- Show all GDB settings
info sharedlibrary -- Status of loaded shared object libraries
info signals -- What debugger does when program gets various signals
info skip -- Display the status of skips
info source -- Information about the current source file
info sources -- Source files in the program
info stack -- Backtrace of the stack
info static-tracepoint-markers -- List target static tracepoints markers
--Type <RET> for more, q to quit, c to continue without paging--q
Quit
(gdb) i
"info" must be followed by the name of an info command.
List of info subcommands:

info address -- Describe where symbol SYM is stored
info all-registers -- List of all registers and their contents
info args -- Argument variables of current stack frame
info auto-load -- Print current status of auto-loaded files
info auxv -- Display the inferior's auxiliary vector
info bookmarks -- Status of user-settable bookmarks
info breakpoints -- Status of specified breakpoints (all user-settable breakpoints if no argument)
info checkpoints -- IDs of currently known checkpoints
info classes -- All Objective-C classes
info common -- Print out the values contained in a Fortran COMMON block
info copying -- Conditions for redistributing copies of GDB
info dcache -- Print information on the dcache performance
info display -- Expressions to display when program stops
info exceptions -- List all Ada exception names
info extensions -- All filename extensions associated with a source language
info files -- Names of targets and files being debugged
info float -- Print the status of the floating point unit
info frame -- All about selected stack frame
info frame-filter -- List all registered Python frame-filters
info functions -- All function names
info guile -- Prefix command for Guile info displays
info handle -- What debugger does when program gets various signals
info inferiors -- Print a list of inferiors being managed
info line -- Core addresses of the code for a source line
info locals -- Local variables of current stack frame
info macro -- Show the definition of MACRO
info macros -- Show the definitions of all macros at LINESPEC
info mem -- Memory region attributes
info os -- Show OS data ARG
info pretty-printer -- GDB command to list all registered pretty-printers
info probes -- Show available static probes
info proc -- Show /proc process information about any running process
info program -- Execution status of the program
info record -- Info record options
info registers -- List of integer registers and their contents
info scope -- List the variables local to a scope
info selectors -- All Objective-C selectors
info set -- Show all GDB settings
info sharedlibrary -- Status of loaded shared object libraries
info signals -- What debugger does when program gets various signals
info skip -- Display the status of skips
info source -- Information about the current source file
info sources -- Source files in the program
info stack -- Backtrace of the stack
info static-tracepoint-markers -- List target static tracepoints markers
--Type <RET> for more, q to quit, c to continue without paging--q
Quit
(gdb) is [K[K s
#0  sayHello (name=0x7fffffffeaa0 "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
(gdb) info 
address                    handle                     sources
all-registers              inferiors                  stack
args                       line                       static-tracepoint-markers
auto-load                  locals                     symbol
auxv                       macro                      target
bookmarks                  macros                     tasks
breakpoints                mem                        terminal
checkpoints                os                         threads
classes                    pretty-printer             tracepoints
common                     probes                     tvariables
copying                    proc                       type-printers
dcache                     program                    types
display                    record                     unwinder
exceptions                 registers                  variables
extensions                 scope                      vector
files                      selectors                  vtbl
float                      set                        warranty
frame                      sharedlibrary              watchpoints
frame-filter               signals                    win
functions                  skip                       xmethod
guile                      source                     
(gdb) info 
address                    handle                     sources
all-registers              inferiors                  stack
args                       line                       static-tracepoint-markers
auto-load                  locals                     symbol
auxv                       macro                      target
bookmarks                  macros                     tasks
breakpoints                mem                        terminal
checkpoints                os                         threads
classes                    pretty-printer             tracepoints
common                     probes                     tvariables
copying                    proc                       type-printers
dcache                     program                    types
display                    record                     unwinder
exceptions                 registers                  variables
extensions                 scope                      vector
files                      selectors                  vtbl
float                      set                        warranty
frame                      sharedlibrary              watchpoints
frame-filter               signals                    win
functions                  skip                       xmethod
guile                      source                     
(gdb) info 
address                    handle                     sources
all-registers              inferiors                  stack
args                       line                       static-tracepoint-markers
auto-load                  locals                     symbol
auxv                       macro                      target
bookmarks                  macros                     tasks
breakpoints                mem                        terminal
checkpoints                os                         threads
classes                    pretty-printer             tracepoints
common                     probes                     tvariables
copying                    proc                       type-printers
dcache                     program                    types
display                    record                     unwinder
exceptions                 registers                  variables
extensions                 scope                      vector
files                      selectors                  vtbl
float                      set                        warranty
frame                      sharedlibrary              watchpoints
frame-filter               signals                    win
functions                  skip                       xmethod
guile                      source                     
(gdb) info s
scope                      signals                    stack
selectors                  skip                       static-tracepoint-markers
set                        source                     symbol
sharedlibrary              sources                    
(gdb) info s
scope                      signals                    stack
selectors                  skip                       static-tracepoint-markers
set                        source                     symbol
sharedlibrary              sources                    
(gdb) info s[K[K[K[K[K[Kp argc
No symbol "argc" in current context.
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p argc
$14 = 3
(gdb) down
#0  sayHello (name=0x7fffffffeaa0 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$15 = 0x7fffffffeaa0 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 3, sayHello (name=0x7fffffffeaa5 "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) c
Continuing.
hello lisa

Breakpoint 3, sayHello (name=0x0) at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p i
$16 = 3
(gdb) p argc
$17 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 197376] will be killed.

Quit anyway? (y or n) y
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ vim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;49r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[49;1H"hello.cc" 22L, 363C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"hello "[m << name << std::endl;
}

[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i <= argc; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                                             [24;1H~                                                                                             [25;1H~                                                                                             [26;1H~                                                                                             [27;1H~                                                                                             [28;1H~                                                                                             [29;1H~                                                                                             [30;1H~                                                                                             [31;1H~                                                                                             [32;1H~                                                                                             [33;1H~                                                                                             [34;1H~                                                                                             [35;1H~                                                                                             [36;1H~                                                                                             [37;1H~                                                                                             [38;1H~                                                                                             [39;1H~                                                                                             [40;1H~                                                                                             [41;1H~                                                                                             [42;1H~                                                                                             [43;1H~                                                                                             [44;1H~                                                                                             [45;1H~                                                                                             [46;1H~                                                                                             [47;1H~                                                                                             [48;1H~                                                                                             [m[49;77H1,1[11CAll]2;hello.cc (~/projects/i240b/submit/lab2/exercises/1-hello) - VIM]1;hello.cc[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"hello "[m << name << std::endl;
}

[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                                             [24;1H~                                                                                             [25;1H~                                                                                             [26;1H~                                                                                             [27;1H~                                                                                             [28;1H~                                                                                             [29;1H~                                                                                             [30;1H~                                                                                             [31;1H~                                                                                             [32;1H~                                                                                             [33;1H~                                                                                             [34;1H~                                                                                             [35;1H~                                                                                             [36;1H~                                                                                             [37;1H~                                                                                             [38;1H~                                                                                             [39;1H~                                                                                             [40;1H~                                                                                             [41;1H~                                                                                             [42;1H~                                                                                             [43;1H~                                                                                             [44;1H~                                                                                             [45;1H~                                                                                             [46;1H~                                                                                             [47;1H~                                                                                             [48;1H~                                                                                             [m[49;77H1,1[11CAll"hello.cc" 22L, 363C[1;1H[?25h[?25l[49;67H~@k[1;1H[49;67H   [2;1H[49;77H2[2;1H[?25h[?25l[49;67H~@k[2;1H[49;67H   [3;1H[49;77H3,0-1[3;1H[?25h[?25l[49;67H~@k[3;1H[49;67H   [4;1H[49;77H4,1  [4;1H[?25h[?25l[49;67H~@k[4;1H[49;67H   [5;1H[49;77H5[5;1H[?25h[?25l[49;67Hi[5;1H[49;67H [5;1H[49;1H[1m-- INSERT --[m[49;13H[K[49;77H5,1[11CAll[5;1H[?25h[?25l
[46m{

}[m[49;77H6[6;1H[?25h[?25l{

}[49;77H7[7;1H[?25h[?25l[6;1H[46m{

}[m[49;77H8[8;1H[?25h[?25l[6;1H{

}[49;77H9[9;1H[?25h[?25l[49;77H10,1[10;1H[?25h[?25l[49;78H1[11;1H[?25h[?25l
[46m{[22;1H}[m[49;78H2[12;1H[?25h[?25l{[22;1H}[49;78H3[13;1H[?25h[?25l[49;78H4[14;1H[?25h[?25l[49;78H5[15;1H[?25h[?25l[49;78H6[16;1H[?25h[?25l[49;78H7[17;1H[?25h[?25l[49;78H8[18;1H[?25h[?25l[49;80H2[18;2H[?25h[?25l[49;80H3[18;3H[?25h[?25l[49;80H4[18;4H[?25h[?25l[49;80H5[18;5H[?25h[?25l[49;80H6[18;6H[?25h[?25l[49;80H7[18;7H[?25h[?25l[49;80H8[18;8H[?25h[?25l [46m([25C)[m[49;80H9[18;9H[?25h[?25l[49;80H10[18;10H[?25h[?25l([25C)[49;81H1[18;11H[?25h[?25l[49;81H2[18;12H[?25h[?25l[49;81H3[18;13H[?25h[?25l[49;81H4[18;14H[?25h[?25l[49;81H5[18;15H[?25h[?25l[49;81H6[18;16H[?25h[?25l[49;81H7[18;17H[?25h[?25l[49;81H8[18;18H[?25h[?25l[49;81H9[18;19H[?25h[?25l[49;80H20[18;20H[?25h[?25l[49;81H1[18;21H[?25h[?25l[49;81H2[18;22H[?25h[?25l[49;81H3[18;23H[?25h[?25l[49;81H4[18;24H[?25h[?25l[49;81H5[18;25H[?25h[?25l argc; i++) {[18;37H[K[49;81H4]2;hello.cc + (~/projects/i240b/submit/lab2/exercises/1-hello) - VIM]1;hello.cc[18;24H[?25h[49;1H[K[18;23H[?25l[49;67H^[[18;23H[49;67H  [18;24H[49;77H18,23[9CAll[18;23H[?25h[?25l[49;67HZ[18;23H[?25h[?25l[49;68HZ[18;23H[?1006l[?1002l[?2004l[49;1H"hello.cc"[49;67H[K[49;12H22L, 362C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0ttman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ls[K[Kmake
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ ./hello bart lisa
hello bart
hello lisa
tman1@g7-16:~/i240b/submit/lab2/exercises/1-hello$ cd ..
tman1@g7-16:~/i240b/submit/lab2/exercises$ ls
1-hello  2-hello  3-overload  Makefile
tman1@g7-16:~/i240b/submit/lab2/exercises$ cd[K[Kcd 2-hello/
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ls
hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ls
hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ cat hello [K[K[K[K[K[KREADME 
Print out a line saying hello to each command-line argument.  Try to be
intelligent by upcasing the first character of each word in each
command-line argument.

tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ cat hello.cc
#include <locale>
#include <iostream>
#include <cstdlib>
#include <cstring>

/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */
void
upcaseWords(const char in[], char out[])
{
  bool inWord = false;
  const int n = std::strlen(in);
  for (int i = 0; i < n; i++) {
    if (!inWord && std::isalpha(in[i])) {
      out[i] = std::toupper(in[i]);
    }
    else {
      out[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

static void
sayHello(const char *name)
{
  std::cout << "Hello " << name << std::endl;
}


int
main(int argc, const char *argv[])
{
  if (argc == 1) {
    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
    std::exit(1);
  }
  else {
    for (int i = 1; i <= argc; i++) {
      const char *name = argv[i];
      char friendlyName[strlen(name)];
      upcaseWords(name, friendlyName);
      sayHello(friendlyName);
    }
  }
}
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ cat hello
ELF          >    À      @       Ð         @ 8  @ # "       @       @       @       h      h                   ¨      ¨      ¨                                                         à      à                                        í      í                                                                     -       =       =      È                         ¸-      ¸=      ¸=                               Ä      Ä      Ä      D       D              Påtd                        \       \              Qåtd                                                  Råtd    -       =       =      `      `             /lib64/ld-linux-x86-64.so.2          GNU                        GNU v¸È‘m0å6'Ìµ¡ö`ÅÓÓ              ‘ !            ÐeÎm%mC˜C                        G                     ~                      N                     Û                      m                      V                     ¹                      ?                                            [                     r                                            ;                       U                      c  "                   Ñ      A                €@             libstdc++.so.6 __gmon_start__ _ITM_deregisterTMCloneTable _ITM_registerTMCloneTable _ZNSt8ios_base4InitD1Ev _ZNSolsEPFRSoS_E _ZSt4endlIcSt11char_traitsIcEERSt13basic_ostreamIT_T0_ES6_ _ZNSt8ios_base4InitC1Ev _ZSt4cerr _ZStlsISt11char_traitsIcEERSt13basic_ostreamIcT_ES5_PKc _ZSt4cout libm.so.6 libgcc_s.so.1 libc.so.6 isalpha strlen __cxa_atexit toupper __cxa_finalize __libc_start_main GLIBCXX_3.4 GLIBC_2.2.5                                   t)’   „        5         ui	          =                    ¨=             \      °=             `      `@             `@      È?                    Ð?                    Ø?         	           à?                    è?                    ð?                    ø?                    €@                     A                    @                     @                    (@                    0@                    8@                    @@                    H@                    P@         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           HƒìH‹Ý/  H…ÀtÿÐHƒÄÃ         ÿ5â/  ÿ%ä/  @ ÿ%â/  h    éàÿÿÿÿ%Ú/  h   éÐÿÿÿÿ%Ò/  h   éÀÿÿÿÿ%Ê/  h   é°ÿÿÿÿ%Â/  h   é ÿÿÿÿ%º/  h   éÿÿÿÿ%²/  h   é€ÿÿÿÿ%ª/  h   épÿÿÿÿ%/  f        1íI‰Ñ^H‰âHƒäðPTL
  H£  H=å  ÿö.  ôD  H=q/  Hj/  H9øtH‹Î.  H…Àt	ÿà€    Ã€    H=A/  H5:/  H)þHÁþH‰ðHÁè?HÆHÑþtH‹¥.  H…ÀtÿàfD  Ã€    €=I1   u/UHƒ=V.   H‰åtH‹=â.  è-ÿÿÿèhÿÿÿÆ!1  ]Ã€    Ã€    é{ÿÿÿUH‰åHƒì H‰}èH‰uàÆEÿ H‹EèH‰Çèkþÿÿ‰EôÇEø    ‹Eø;Eô¢   ¶Eÿƒð„ÀtM‹EøHcÐH‹EèHÐ¶ ¾À‰Çèþÿÿ…Àt/‹EøHcÐH‹EèHÐ¶ ¾À‰Çè‚þÿÿ‰Á‹EøHcÐH‹EàHÐ‰Êˆë‹EøHcÐH‹EèHÐ‹UøHcÊH‹UàHÊ¶ ˆ‹EøHcÐH‹EèHÐ¶ ¾À‰Çè$þÿÿ…À•ÀˆEÿƒEøéRÿÿÿÉÃUH‰åHƒìH‰}øH5q  H=æ-  è±ýÿÿH‰ÂH‹EøH‰ÆH‰×èŸýÿÿH‰ÂH‹-  H‰ÆH‰×èšýÿÿÉÃUH‰åAWAVAUATSHƒì8‰}¬H‰u ƒ}¬uVH5  H=«.  èVýÿÿH‰ÂH‹E H‹ H‰ÆH‰×èAýÿÿH5ý  H‰Çè2ýÿÿH‰ÂH‹¨,  H‰ÆH‰×è-ýÿÿ¿   è3ýÿÿÇEÌ   ‹EÌ;E¬¯   H‰àH‰Ã‹EÌH˜HÅ    H‹E HÐH‹ H‰EÀH‹EÀH‰Çè³üÿÿHƒèH‰E¸H‰ÂHƒÂI‰ÖA¿    H‰ÂHƒÂI‰ÔA½    HP¸   HƒèHÐ¹   º    H÷ñHkÀH)ÄH‰àHƒÀ H‰E°H‹U°H‹EÀH‰ÖH‰Çè¾ýÿÿH‹E°H‰ÇèþÿÿH‰ÜƒEÌéEÿÿÿ¸    HeØ[A\A]A^A_]ÃUH‰åHƒì‰}ü‰uøƒ}üu2}øÿÿ  u)H=z.  èDüÿÿH,  H5g.  H‹§+  H‰ÇèçûÿÿÉÃUH‰å¾ÿÿ  ¿   è¤ÿÿÿ]Ãf.„     D  AWI‰×AVI‰öAUA‰ýATL%)  UH-)  SL)åHƒìèSûÿÿHÁýt1Û L‰úL‰öD‰ïAÿÜHƒÃH9ÝuêHƒÄ[]A\A]A^A_Ã Ã   HƒìHƒÄÃ                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     Hello  usage:   NAME... ;X   
   ðÿÿ¤   ”ðÿÿÌ   ¤ðÿÿt   ‰ñÿÿä   dòÿÿ  ­òÿÿ$  ÷óÿÿP  @ôÿÿp  dôÿÿ”  ÄôÿÿÜ         zR x      (ðÿÿ+                  zR x  $      Xïÿÿ    FJw€ ?;*3$"       D   Àïÿÿ              \   ðÿÿÛ    A†CÖ     |   XñÿÿI    A†CD  (   œ   ñÿÿJ   A†CMŽŒƒ8     È   ŸòÿÿI    A†CD      è   Èòÿÿ    A†CP       D     Èòÿÿ]    BEŽE E(ŒH0†H8ƒG@j8A0A(B BBB    T  àòÿÿ                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  \      `                                        '             5                           ä              =                           °=                    õþÿo                 è             8      
       œ                                           @             À                                          è             8      	              ûÿÿo           þÿÿo    ¨      ÿÿÿo           ðÿÿo    „      ùÿÿo                                                                                                                                                   ¸=                      6      F      V      f      v      †      –      ¦              `@      GCC: (Debian 8.3.0-6) 8.3.0 ,             ¥      Ì                      $¹       bþ  Vù  'ñ  ¥      Ì          cstd ( X€  R  
Aã  $TD   MÝ  ‡]  ‹»   2*    ‡]  ‘—P  y   ‰   ñ²  »   Ùš    ‡]  ”lÐ     ­   ñ²  »   ÷²   
þ2  ˜
»     ¸B  \0}ƒ  S¡ê   9Êg  ¢5ý²  9  £ê    Rà  X2•ƒ  ê   d>I  e÷   ú  q2 Q  üZ  |s'  	  /  	   
hš  ›R    
KŸ  œê   eÈ    ®p  §¸ê  c  n  ³  »     þM  «V  ‚    ³  ê    ®p  ¯“
  »   ¥  «  ³   §Æ  ³0W  »   Ã  É  ³   ºi  ]5‰ƒ  §Æ  ½¶â  É  î  ô  ³      ÇB_      ³  ê     ýö  Ëh  '  2  ³  ê    ÝÇ  ÒU«  C˜  J  P  ³   ¤½  ×¾®  »   h  x  ³  ³  ê     ¥R  Ú 	  Œ  ’  ³    Ä  á»  ¦  ±  ³  ê     YÏ  ÷a+  Å  Õ  ³  ê   £‹   3‘  †ÿ  ê  ú  ³  ê   £‹   }R  W#  ú  ìÍ  PÆƒ  &ŠÝ  )  ³  1  7  ³   &ŠÝ  	  %³  P  V  ³   &Ð5  +·  ê   o    ³  ê   Î‹   3RÕ  5úE  ”  ©  ³  ê   ê   Î‹   &YÂ  >«Û  ê   Â  Ò  ³  ê   ê    &†  F\$  C˜  ë  ö  ³  Î‹   !“>  O>    ˜‹  Î‹  ê    !!x  Xœ  8  ˜‹  Î‹  ê    !¼?  aÌ  Y  ˜‹  ê   £‹   !KÏ  t™—  z  ˜‹  z  z   ïV  ^Dæƒ  !KÏ  x‡º  ¨  ˜‹  ¨  ¨   R}  `%†  !KÏ  }tµ  Ö  ˜‹  ˜‹  ˜‹   !KÏ  Ã  ÷  ˜‹  Î‹  Î‹   f#  †ÜX  Â‹    ê   ê    3Í™  “œÒ  ,  7  ³  +³   3!  –Î"  L  f  ³  ê   ê   Î‹  ê    3¢  šÏ  {  ‹  ³  ê   ê      ¤ý
  ¡  §  ³   :  ­K™  ½  È  ³  Ùš     µï›  Þ  é  ³  +³     Âþ€  ÿ    ³  +³  ê   Ùš     ÑeN  *  ?  ³  +³  ê   ê      á~Ž  U  o  ³  +³  ê   ê   Ùš     ó}  …  š  ³  Î‹  ê   Ùš     ÝÙ  °  »  ³  1³     8»õ  Ñ  á  ³  Sz  Ùš     <:³  ÷    ³  +³  Ùš     @kó    -  ³  1³  Ùš   :  ‰ãÕ  C  S  ³  S  Ùš   n  ƒ  Tn  …Ëã  t    I³  	   
;ƒ  †	      -Å  £  ®  ³  Â‹   +Ü  ˜77  7³  È  Ó  ³  +³   +Ü  ¿/  7³  í  ø  ³  Î‹   +Ü  Ê”  7³      ³  £‹   +Ü  Ü	ú  7³  7  B  ³  1³   +Ü  ðá  7³  \  g  ³  Sz   Ï  0hK  	    ‡  ³   z(  :@Ž  z  ¡  §  ³   z(  B®  ¨  Á  Ç  ³   ;end JOç  z  á  ç  ³   ;end R-¥  ¨  	  	  ³   çV  b0K{  
  [à½  	  .	  4	  ³   áV  a5P{  
  dÒC  4	  [	  a	  ³   /ü  m&  	  {	  	  ³   /ü  vQx  4	  ›	  ¡	  ³   y(  o  ¨  »	  Á	  ³   òU  ‡ýÍ  ¨  Û	  á	  ³   
    4	  û	  
  ³   .ü  ™<u  4	  
  !
  ³   bÓ  ¢  ê   ;
  A
  ³   N  ¨æÎ  ê   [
  a
  ³   ^Ó  ­™  ê   {
  
  ³   J–  »  —
  §
  ³  ê   £‹   J–  È%n  ½
  È
  ³  ê    ¯  Îf2  Þ
  ä
  ³     áÌj  ê   þ
    ³   Ùo  ù¡V    %  ³  ê    V‹  ÿ'Ð  ;  A  ³   .Ç  A?  C˜  [  a  ³   å  [7­ƒ    $  a  ˆ  “  ³  ê    ë  Z2¡ƒ    '_›  “  º  Å  ³  ê    ;at <©9  a  Þ  é  ³  ê    ;at Q‘  “      ³  ê    /ì  a¨`  “  '  -  ³   /ì  lÛ‚  a  G  M  ³   
H  w]v  “  g  m  ³   
H  ‚éÏ  a  ‡    ³    ¢  šï  7³  §  ²  ³  +³    ¢  ™Ò¶  7³  Ì  ×  ³  Î‹    ¢  ¢ž„  7³  ñ  ü  ³  £‹    ¢  ¯Û!  7³    !  ³  Sz   8Ü  ÅM<  7³  ;  F  ³  +³   8Ü  Öè  7³  `  u  ³  +³  ê   ê    8Ü  â­Ì  7³    Ÿ  ³  Î‹  ê    8Ü  ï”y  7³  ¹  Ä  ³  Î‹   8Ü   L¦  7³  Þ  î  ³  ê   £‹   8Ü  
X  7³      ³  Sz   H  E£  )  4  ³  £‹   Ð™  Tà  7³  N  Y  ³  +³   Ð™  dDü  7³  s  ~  ³  1³   Ð™  {{n  7³  ˜  ­  ³  +³  ê   ê    Ð™  ‹±  7³  Ç  ×  ³  Î‹  ê    Ð™  ›V†  7³  ñ  ü  ³  Î‹   Ð™  ¬x‘  7³    &  ³  ê   £‹   Ð™  È¤$  7³  @  K  ³  Sz   ±ì  ý»Á  z  e  z  ³  ¨  ê   £‹   ±ì  K?i       ³  z  Sz   ±ì  _gz  7³  º  Ê  ³  ê   +³   ±ì  vôÐ  7³  ä  þ  ³  ê   +³  ê   ê    ±ì  bâ  7³    -  ³  ê   Î‹  ê    ±ì   êñ  7³  G  W  ³  ê   Î‹   ±ì  ¸Ü¬  7³  q  †  ³  ê   ê   £‹   ±ì  Êúî  z     °  ³  °  £‹   P}  l¨  ¢  ïû  7³  Ö  æ  ³  ê   ê    ¢  Ù5  z       ³  °   ¢  ,¨  z  %  5  ³  °  °   â'  ?jŸ  K  Q  ³   ÓÃ  Xe°  7³  k  €  ³  ê   ê   +³   ÓÃ  n:  7³  š  ¹  ³  ê   ê   +³  ê   ê    ÓÃ  ‡›  7³  Ó  í  ³  ê   ê   Î‹  ê    ÓÃ   Æ¹  7³      ³  ê   ê   Î‹   ÓÃ  ¸‡ð  7³  6  P  ³  ê   ê   ê   £‹   ÓÃ  Ê«l  7³  j    ³  °  °  +³   ÓÃ  Þ”  7³  ™  ³  ³  °  °  Î‹  ê    ÓÃ  ôü™  7³  Í  â  ³  °  °  Î‹   ÓÃ  	L,  7³  ü    ³  °  °  ê   £‹   ÓÃ  By  7³  0  J  ³  °  °  ˜‹  ˜‹   ÓÃ  Mò]  7³  d  ~  ³  °  °  Î‹  Î‹   ÓÃ  Xÿ  7³  ˜  ²  ³  °  °  z  z   ÓÃ  c5ˆ  7³  Ì  æ  ³  °  °  ¨  ¨   ÓÃ  |é-  7³       ³  ¨  ¨  Sz   &¦‰  Åá  7³  .  H  ³  ê   ê   ê   £‹   &ÐÃ  É]‰  7³  a  {  ³  ê   ê   Î‹  ê    &5Ü  ÍyÖ  7³  ”  ¤  ³  Î‹  ê    –>  ÞÕy  ê   ¾  Ó  ³  ˜‹  ê   ê    :¸  è‘  é  ô  ³  7³   –  ò›«  Î‹      ³   ±p  þ€(  Î‹  .  4  ³   ±p  		 Õ  ˜‹  N  T  ³   Ý  	íÉ  ú  n  t  ³   Ù  !	{  ê   Ž  £  ³  Î‹  ê   ê    Ù  /	f  ê   ½  Í  ³  +³  ê    Ù  O	qo  ê   ç  ÷  ³  Î‹  ê    Ù  `	9‘  ê     !  ³  £‹  ê    Ù  m	‰™  ê   ;  K  ³  +³  ê    Ù  	Ä  ê   e  z  ³  Î‹  ê   ê    Ù  	$2  ê   ”  ¤  ³  Î‹  ê    Ù  ®	d	  ê   ¾  Î  ³  £‹  ê    e'  ¼	&  ê   è  ø  ³  +³  ê    e'  ß	ù$  ê     '  ³  Î‹  ê   ê    e'  í	€˜  ê   A  Q  ³  Î‹  ê    e'  
q#  ê   k  {  ³  £‹  ê    ³  
†÷  ê   •  ¥  ³  +³  ê    ³  3
   ê   ¿  Ô  ³  Î‹  ê   ê    ³  A
4Ç  ê   î  þ  ³  Î‹  ê    ³  U
 “  ê     (  ³  £‹  ê    ñ(  c
Á  ê   B  R  ³  +³  ê    ñ(  †
¢]  ê   l    ³  Î‹  ê   ê    ñ(  ”
Ñ  ê   ›  «  ³  Î‹  ê    ñ(  ¦
Î  ê   Å  Õ  ³  £‹  ê      µ
çÂ  ê   ï  ÿ  ³  +³  ê      Ø
;Ý  ê     .  ³  Î‹  ê   ê      æ
_Ã  ê   H  X  ³  Î‹  ê      ø
¡[  ê   r  ‚  ³  £‹  ê    ””  8Ë  E   œ  ¬  ³  ê   ê    i#  ¢É  Â‹  Æ  Ñ  ³  +³   i#  x:¹  Â‹  ë     ³  ê   ê   +³   i#  ’þé  Â‹    9  ³  ê   ê   +³  ê   ê    i#  ¤¿©  Â‹  S  ^  ³  Î‹   i#  ¼$ë  Â‹  x    ³  ê   ê   Î‹   i#  ×wŒ  Â‹  §  Á  ³  ê   ê   Î‹  ê      £‹  #äÍ    #£  *   E    4
A8   5RŠ  6Ù‹  7ô‹  @íŒ  ‹{Œ  Ž  Ž´Ž  ÑŽ    ‘   ’B  “^  ”{  •˜  –¯  —¼  ˜ã  ™	  š&  ›R  œn  ž…   §  ¡Ä  ¢à  ¤‘  §(‘  ªN‘  ¬o‘  ®‹‘  °§‘  ±È‘  ²ã‘  ³þ‘  ´’  µ4’  ¶O’  ·“  ¸2“  ¹R“  ºr“  »’“  ¼¾“  ½Ù“  ¿û“  Á”  Â7”  Ãd”  Ä…”  Å¥”  Æ¼”  ÇÝ”  Èþ”  É•  Ê@•  ËX•  Ìp•  Ì•  Í®•  ÍÍ•  Îì•  Î–  Ï*–  ÏI–  Ðh–  ÐŒ–  "°–  "	Ì–  "
ô–  "û“  "‘  "N‘  "!‹‘  "%°–  "&Ì–  "'ô–  º¼  9Ì  <az  ;-J˜  ID  <-C˜  ®  >®+  p  ”  š  Y˜   Á›  C¨Y  p  ²  ¸  Y˜   _Tp C˜  =__v C˜    V  ¾X  9G  <az  ;-J˜  ID  <-C˜  ›Ü  >?Q  ë      i˜   Á›  CgE  ë  -  3  i˜   _Tp C˜  =__v C˜   Ñ  ´–  9Â  <az  ;-¶‹  ID  <-¯‹  D  >ÿ  f  Š    y˜   Á›  C‰  f  ¨  ®  y˜   _Tp ¯‹  =__v ¯‹    L  UÌ¡  	U±r  Ý	)™  L
þ  E)™  L+—M  ÷  —˜    Ù  VB  O5<  þ   WË  2èÓ  	
!  !Ð™  	Âµ  H  ·˜  ½˜   O  	!£‹  H  'eq 	"ð  C˜  y  ½˜  ½˜   'lt 	&`˜  C˜  ˜  ½˜  ½˜   i#  	.ên  Â‹  ½  Ã˜  Ã˜  
!   N  	<ñJ  
!  Ø  Ã˜   Ù  	Fi»  Ã˜  ý  Ã˜  
!  ½˜   $x  	T¢5  É˜  "   É˜  Ã˜  
!   –>  	\/  É˜  G   É˜  Ã˜  
!   Ð™  	d8Û  É˜  l   É˜  
!  H   O  	lMé  H  ‡   Ï˜   Ì  	!Â‹  ‡   	Ì  	r‘ý  ‡   ´   ½˜   Ô½  	v#é  C˜  Ô   Ï˜  Ï˜   eof 	zÔ  ‡   4  	~™  ‡    !  Ï˜     £‹   &  
î¯‹  5  	†#  !Ð™  	r\  @!  Õ˜  Û˜   O  	ˆ!øŽ  @!  'eq 	“Á‘  C˜  q!  Û˜  Û˜   'lt 	—S@  C˜  !  Û˜  Û˜   i#  	›\  Â‹  µ!  á˜  á˜  
!   N  	ªG  
!  Ð!  á˜   Ù  	µ7  á˜  õ!  á˜  
!  Û˜   $x  	Ä¾  ç˜  "  ç˜  á˜  
!   –>  	Ìë·  ç˜  ?"  ç˜  á˜  
!   Ð™  	Ô+  ç˜  d"  ç˜  
!  @!   O  	Ü’À  @!  "  í˜   Ì  	‰!{Œ  "  	Ì  	à  "  ¬"  Û˜   Ô½  	ä‚  C˜  Ì"  í˜  í˜   eof 	èŽ–  "  4  	ìeQ  "  ø"  í˜     øŽ   0ó˜  1ÿ˜  2™  3™  5³™  6¿™  7Ë™  8×™  :S™  ;_™  <k™  =w™  ?+š  @š  B#™  C/™  D;™  EG™  Gã™  Hï™  Iû™  Jš  Lƒ™  M™  N›™  O§™  Q7š  Rš  †©  	þÎ%  !Ð™  	™Š  $  Cš  Iš   O  	 !˜  $  'eq 	t0  C˜  =$  Iš  Iš   'lt 	‰j  C˜  \$  Iš  Iš   i#  	”£  Â‹  $  Oš  Oš  
!   N  	Ù¼  
!  œ$  Oš   Ù  	'ýD  Oš  Á$  Oš  
!  Iš   $x  	0ò	  Uš  æ$  Uš  Oš  
!   –>  	9•  Uš  %  Uš  Oš  
!   Ð™  	Ba^  Uš  0%  Uš  
!  $   O  	JÅö  $  K%  [š   Ì  	!™  K%  	Ì  	NA×  K%  x%  Iš   Ô½  	R-  C˜  ˜%  [š  [š   eof 	Vië  K%  4  	Z¨  K%  Ä%  [š     ˜   ]  	_º'  !Ð™  	h‹  ø%  aš  gš   O  	a!‹˜  ø%  'eq 	l‡à  C˜  )&  gš  gš   'lt 	p@â  C˜  H&  gš  gš   i#  	t$ù  Â‹  m&  mš  mš  
!   N  	ø”  
!  ˆ&  mš   Ù  	ˆë  mš  ­&  mš  
!  gš   $x  	‘&Ï  sš  Ò&  sš  mš  
!   –>  	š|V  sš  ÷&  sš  mš  
!   Ð™  	£(  sš  '  sš  
!  ø%   O  	«p  ø%  7'  yš   Ì  	b!›™  7'  	Ì  	¯-î  7'  d'  gš   Ô½  	³L
  C˜  „'  yš  yš   eof 	·ù)  7'  4  	»x  7'  °'  yš     ‹˜   XPp  4)  $Rp  O)  
{  QyŒ   TRp  Su7  ô'  ÿ'  „š  yŒ    ¡l  UY  (  (  „š    B<  VÏ  -(  3(  „š   ”R  Xj  yŒ  K(  Q(  Šš   Rp  `Èî  f(  l(  „š   Rp  bDÍ  (  Œ(  „š  š   Rp  e2  ¡(  ¬(  „š  »)   Rp  ió¦  Á(  Ì(  „š  –š   	+Ü  v_  œš  å(  ð(  „š  š   	+Ü  zÇ  œš  	)  )  „š  –š   îö  R¢  ))  4)  „š  Â‹   :¸  „x’  I)  T)  „š  œš   fð&  ƒ*  C˜  m)  s)  Šš   gN]  ™Vî  ¢š  ˆ)  Šš    Æ'  I¥)   9Æ'  h¾T  Eü{  »)  Æ'   Ø'  
òš  *á  Ç)    V
ö)  E  YÜ¨  ï)  ¨š    Ñ)  (r¬  ]m¬  ö)  Úú  
ïX”  $,ß  lƒ*  i©€   ‘Ý  ƒS˜  @*  F*  Óš   ‘Ý  …~Ç  [*  f*  Óš  Ùš   j¡  ‹2Q  w*  Óš  Â‹    *  Y  Â‹  §¹*  Z¡L  ,©    ,HÂ  ,£6  ,CI   ˆ*  YHû  Â‹  ¶ã*  ZH  ,ÛÃ   ,„   ¾*  Š  Ê
B,  Gê  Î(J˜   úÆ  Ó'É‹   æú  Ö'É‹   H  ÛÉ‹   |  ß(J˜     â(J˜   dP  ç(J˜   5v  ë'É‹   ìœ  ï'É‹   Ýˆ  ó'É‹     ø'É‹     ü'É‹   Ÿ¬  ÿ(J˜   \Ÿ  (J˜   +"  (J˜   ;Ø  
6ã*   If  (J˜   I  (J˜   *v  (J˜   ¢   (J˜   9e  #(J˜   è“  &(J˜   …  +5¹*    î`  L.  Gê  *J˜  min „â  C˜  max ‡Ú  C˜  ‹å  ‹—Ù  C˜  úÆ  )É‹  æú  Ž)É‹   H  É‹   |  ’*J˜     “*J˜  dP  ”*J˜  5v  •)É‹  N„  ˜)  C˜  Àn  ›"–  C˜  ìœ  )É‹   Ýˆ  ž)É‹     Ÿ)É‹      )É‹   Ÿ¬  ¢*J˜   \Ÿ  £*J˜   +"  ¤*J˜   ;Ø  ¥8ã*   If  §*J˜   °6  ªºÀ  C˜  `Ÿ  ­Õ|  C˜  /"  °×g  C˜  K:  ³äh  C˜  I  µ*J˜   *v  ¶*J˜  ¢  ·*J˜   9e  ¼*J˜  è“  ½*J˜   …  ¾7¹*   _Tp C˜   vå  ÄV0  Gê  Æ*J˜  min É¢a  £‹  max ÌR  £‹  ‹å  Ð&&  £‹  úÆ  Ó)É‹  æú  Ô)É‹  H  ÖÉ‹   |  Ø*J˜    Ù*J˜  dP  Ú*J˜  5v  Û)É‹  N„  Þã.  £‹  Àn  á\X  £‹  ìœ  ã)É‹   Ýˆ  ä)É‹     å)É‹     æ)É‹   Ÿ¬  è*J˜   \Ÿ  é*J˜   +"  ê*J˜   ;Ø  ë8ã*   If  í*J˜   °6  ðpã  £‹  `Ÿ  ó×™  £‹  /"  öÌ%  £‹  K:  ù¶   £‹  I  û*J˜   *v  ü*J˜  ¢  ý*J˜   9e  ÿ*J˜  è“   *J˜   …  7¹*   _Tp £‹   aR  `2  Gê  	*J˜  min íØ  /—  max Û  /—  ‹å  ­…  /—  úÆ  )É‹  æú  )É‹  H  É‹   |  *J˜    *J˜  dP  *J˜  5v  )É‹  N„  "ù  /—  Àn  %êÖ  /—  ìœ  ')É‹   Ýˆ  ()É‹     ))É‹     *)É‹   Ÿ¬  ,*J˜   \Ÿ  -*J˜   +"  .*J˜   ;Ø  /8ã*   If  1*J˜   °6  4Êš  /—  `Ÿ  7­_  /—  /"  :°  /—  K:  >ì  /—  I  A*J˜   *v  B*J˜  ¢  C*J˜   9e  E*J˜  è“  F*J˜   …  G7¹*   _Tp /—   Û  Mj4  Gê  O*J˜  min RµÆ  —  max U}{  —  ‹å  Yƒ¯  —  úÆ  \)É‹  æú  ^)É‹  H  aÉ‹   |  c*J˜     d*J˜  dP  e*J˜  5v  f)É‹  N„  iö>  —  Àn  lz-  —  ìœ  n)É‹   Ýˆ  o)É‹     p)É‹     q)É‹   Ÿ¬  s*J˜   \Ÿ  t*J˜   +"  u*J˜   ;Ø  v8ã*   If  x*J˜   °6  {f  —  `Ÿ  ¾.  —  /"  ƒxÉ  —  K:  ‡²o  —  I  Š*J˜   *v  ‹*J˜  ¢  Œ*J˜  9e  Ž*J˜  è“  *J˜   …  7¹*   _Tp —     –t6  Gê  ˜*J˜  min ›"ã  øŽ  max žîš  øŽ  ‹å  ¢(L  øŽ  úÆ  ¥)É‹  æú  ¦)É‹  	H  ©É‹   |  «*J˜    ¬*J˜  dP  ­*J˜  5v  ®)É‹  N„  ±Ìt  øŽ  Àn  ´»   øŽ  ìœ  ¶)É‹   Ýˆ  ·)É‹     ¸)É‹     ¹)É‹   Ÿ¬  »*J˜   \Ÿ  ¼*J˜   +"  ½*J˜   ;Ø  ¾8ã*   If  À*J˜   °6  Ã/˜  øŽ  `Ÿ  Æ*ç  øŽ  /"  ÉÚ«  øŽ  K:  Ìß øŽ  I  Î*J˜   *v  Ï*J˜  ¢  Ð*J˜   9e  Ò*J˜  è“  Ó*J˜   …  Ô7¹*   _Tp øŽ   þ  Û~8  Gê  ÝJ˜  min àÓÜ  ˜  max ãï¿  ˜  ‹å  ææ  ˜  úÆ  èÉ‹  æú  éÉ‹  H  êÉ‹   |  ëJ˜     ìJ˜  dP  íJ˜  5v  îÉ‹  N„  ñ’   ˜  Àn  ôç¸  ˜  ìœ  öÉ‹   Ýˆ  ÷É‹     øÉ‹     ùÉ‹   Ÿ¬  ûJ˜   \Ÿ  üJ˜   +"  ýJ˜   ;Ø  þ+ã*   If  ÿJ˜   °6  º ˜  `Ÿ  ÃÏ  ˜  /"  Ö ˜  K:  oM  ˜  I  J˜   *v  J˜  ¢  J˜  9e  J˜  è“  J˜   …  *¹*   _Tp ˜   ô  ˆ:  Gê  J˜  min )A  ‹˜  max  Ôÿ  ‹˜  ‹å  #0Ó  ‹˜  úÆ  %É‹   æú  &É‹  	H  'É‹   |  (J˜     )J˜  dP  *J˜  5v  +É‹  N„  .eß  ‹˜  Àn  1  ‹˜  ìœ  3É‹   Ýˆ  4É‹     5É‹     6É‹   Ÿ¬  8J˜   \Ÿ  9J˜   +"  :J˜   ;Ø  ;+ã*   If  <J˜   °6  ?^£  ‹˜  `Ÿ  B&¦  ‹˜  /"  E¿  ‹˜  K:  HÂ@  ‹˜  I  JJ˜   *v  KJ˜  ¢  LJ˜  9e  NJ˜  è“  OJ˜   …  P*¹*   _Tp ‹˜   ´á  V’<  Gê  X*J˜  min [–Í  N—  max ^¼‚  N—  ‹å  bE  N—  úÆ  e)É‹  æú  f)É‹  H  hÉ‹   |  j*J˜    k*J˜  dP  l*J˜  5v  m)É‹  N„  p    N—  Àn  s–  N—  ìœ  u)É‹   Ýˆ  v)É‹     w)É‹     x)É‹   Ÿ¬  z*J˜   \Ÿ  {*J˜   +"  |*J˜   ;Ø  }8ã*   If  *J˜   °6  ‚{  N—  `Ÿ  … n  N—  /"  ˆÈ  N—  K:  ‹qþ  N—  I  *J˜   *v  Ž*J˜  ¢  *J˜   9e  ‘*J˜  è“  ’*J˜   …  “7¹*   _Tp N—   ˜<  ™œ>  Gê  ›*J˜  min ž  »‹  max ¡ÇÎ  »‹  ‹å  ¥,]  »‹  úÆ  ¨)É‹  æú  ª)É‹  H  ­É‹   |  ¯*J˜     °*J˜  dP  ±*J˜  5v  ²)É‹  N„  µÌ›  »‹  Àn  ¸qU  »‹  ìœ  º)É‹   Ýˆ  »)É‹     ¼)É‹     ½)É‹   Ÿ¬  ¿*J˜   \Ÿ  À*J˜   +"  Á*J˜   ;Ø  Â8ã*   If  Ä*J˜   °6  ÇÑ2  »‹  `Ÿ  ËtŠ  »‹  /"  Ï«|  »‹  K:  Óîz  »‹  I  Ö*J˜   *v  ×*J˜  ¢  Ø*J˜  9e  Ú*J˜  è“  Û*J˜   …  Ü7¹*   _Tp »‹    `  â¦@  Gê  ä*J˜  min ç7  Â‹  max êéÇ  Â‹  ‹å  îdÿ  Â‹  úÆ  ñ)É‹  æú  ò)É‹  	H  ôÉ‹   |  ö*J˜    ÷*J˜  dP  ø*J˜  5v  ù)É‹  N„  üÇÞ  Â‹  Àn  ÿ8õ  Â‹  ìœ  )É‹   Ýˆ  )É‹     )É‹     )É‹   Ÿ¬  *J˜   \Ÿ  *J˜   +"  *J˜   ;Ø  	8ã*   If  *J˜   °6  —²  Â‹  `Ÿ  çI  Â‹  /"  ¯}  Â‹  K:  ÷  Â‹  I  *J˜   *v  *J˜  ¢  *J˜   9e  *J˜  è“  *J˜   …  7¹*   _Tp Â‹   \è  %°B  Gê  '*J˜  min *uO  rŒ  max -  rŒ  ‹å  1[  rŒ  úÆ  4)É‹   æú  6)É‹  	H  9É‹   |  ;*J˜     <*J˜  dP  =*J˜  5v  >)É‹  N„  Aöw  rŒ  Àn  D&´  rŒ  ìœ  F)É‹   Ýˆ  G)É‹     H)É‹     I)É‹   Ÿ¬  K*J˜   \Ÿ  L*J˜   +"  M*J˜   ;Ø  N8ã*   If  P*J˜   °6  SUÖ  rŒ  `Ÿ  Ve  rŒ  /"  Zš:  rŒ  K:  ^½q  rŒ  I  a*J˜   *v  b*J˜  ¢  c*J˜  9e  e*J˜  è“  f*J˜   …  g7¹*   _Tp rŒ   4`  mºD  Gê  o*J˜  min rÝ  X”  max uu”  X”  ‹å  y†ë  X”  úÆ  |)É‹  ?æú  })É‹  H  É‹   |  *J˜    ‚*J˜  dP  ƒ*J˜  5v  „)É‹  N„  ‡Q¶  X”  Àn  Š<  X”  ìœ  Œ)É‹   Ýˆ  )É‹     Ž)É‹     )É‹   Ÿ¬  ‘*J˜   \Ÿ  ’*J˜   +"  “*J˜   ;Ø  ”8ã*   If  –*J˜   °6  ™k  X”  `Ÿ  œò¡  X”  /"  Ÿ¯  X”  K:  ¢t  X”  I  ¤*J˜   *v  ¥*J˜  ¢  ¦*J˜   9e  ¨*J˜  è“  ©*J˜   …  ª7¹*   _Tp X”   ˆG  °ÄF  Gê  ²*J˜  min µ„"  ¯‹  max ¸¨Þ  ¯‹  ‹å  ¼P9  ¯‹  úÆ  ¿)É‹  @æú  Á)É‹  H  ÄÉ‹   |  Æ*J˜     Ç*J˜  dP  È*J˜  5v  É)É‹  N„  ÌåP  ¯‹  Àn  Ï¥  ¯‹  ìœ  Ñ)É‹   Ýˆ  Ò)É‹     Ó)É‹     Ô)É‹   Ÿ¬  Ö*J˜   \Ÿ  ×*J˜   +"  Ø*J˜   ;Ø  Ù8ã*   If  Û*J˜   °6  Þ=  ¯‹  `Ÿ  âUÄ  ¯‹  /"  æÝf  ¯‹  K:  ê³ú  ¯‹  I  í*J˜   *v  î*J˜  ¢  ï*J˜  9e  ñ*J˜  è“  ò*J˜   …  ó7¹*   _Tp ¯‹   €Z  ùÎH  Gê  û*J˜  min þZ(  í–  max å  í–  ‹å  Ÿš  í–  úÆ  )É‹  ?æú  
)É‹  H  É‹   |  *J˜    *J˜  dP  *J˜  5v  )É‹  N„    í–  Àn  Áb  í–  ìœ  )É‹   Ýˆ  )É‹     )É‹     )É‹   Ÿ¬  *J˜   \Ÿ   *J˜   +"  !*J˜   ;Ø  "8ã*   If  $*J˜   °6  '`½  í–  `Ÿ  *l  í–  /"  -˜c  í–  K:  1€  í–  I  3*J˜   *v  4*J˜  ¢  5*J˜   9e  7*J˜  è“  8*J˜   …  97¹*   _Tp í–   ¶Ç  ?ØJ  Gê  A*J˜  min D_l  —  max G²)  —  ‹å  K,„  —  úÆ  N)É‹  @æú  P)É‹  H  SÉ‹   |  U*J˜     V*J˜  dP  W*J˜  5v  X)É‹  N„  [L®  —  Àn  ^*  —  ìœ  `)É‹   Ýˆ  a)É‹     b)É‹     c)É‹   Ÿ¬  e*J˜   \Ÿ  f*J˜   +"  g*J˜   ;Ø  h8ã*   If  j*J˜   °6  mhá  —  `Ÿ  q-  —  /"  uo´  —  K:  yE  —  I  |*J˜   *v  }*J˜  ¢  ~*J˜  9e  €*J˜  è“  *J˜   …  ‚7¹*   _Tp —   ôç  :ãL  Gê  <*J˜  min ?À6  Œ  max Biô  Œ  ‹å  FXú  Œ  úÆ  I)É‹  æú  J)É‹  H  LÉ‹  	|  O*J˜    P*J˜   dP  Q*J˜   5v  R)É‹  N„  U  Œ  Àn  X¼£  Œ  -ìœ  Z)É‹  ƒ-Ýˆ  [)É‹  [  \)É‹  €  ])É‹  &Ÿ¬  _*J˜  \Ÿ  `*J˜  +"  a*J˜  ;Ø  b8ã*  If  d*J˜   °6  hìä  Œ  `Ÿ  k®ø  Œ  /"  nQ  Œ  K:  qÙm  Œ  I  s*J˜  *v  u*J˜  ¢  v*J˜   9e  x*J˜   è“  y*J˜   …  {7¹*  _Tp Œ   Ä  …ñN  Gê  ‡*J˜  min Šâ§  Œ  max a  Œ  ‹å  ‘Ts  Œ  úÆ  ”)É‹  5æú  •)É‹  H  —É‹  |  š*J˜    ›*J˜   dP  œ*J˜   5v  )É‹  N„   äq  Œ  Àn  £¶  Œ  -ìœ  ¥)É‹  ƒx-Ýˆ  ¦)É‹  Í}>  §)É‹   >  ¨)É‹  4Ÿ¬  ª*J˜  \Ÿ  «*J˜  +"  ¬*J˜  ;Ø  ­8ã*  If  ¯*J˜   °6  ³Ç  Œ  `Ÿ  ¶0º  Œ  /"  ¹åß  Œ  K:  ¼Uk  Œ  I  ¾*J˜  *v  À*J˜  ¢  Á*J˜   9e  Ã*J˜   è“  Ä*J˜   …  Æ7¹*  _Tp Œ     Ð Q  Gê  Ò*J˜  min Õoò  "Œ  max Ø\à  "Œ  ‹å  Ü‘  "Œ  úÆ  ß)É‹  @æú  à)É‹  H  â)É‹  |  å*J˜    æ*J˜   dP  ç*J˜   5v  è)É‹  N„  ë©d  "Œ  Àn  îNä  "Œ  -ìœ  ð)É‹  ƒ€-Ýˆ  ñ)É‹  ½Y>  ò)É‹   @>  ó)É‹  DŸ¬  õ*J˜  \Ÿ  ö*J˜  +"  ÷*J˜  ;Ø  ø8ã*  If  ú*J˜   °6  þA'  "Œ  `Ÿ  ×  "Œ  /"  ]–  "Œ  K:   ñ  "Œ  I  	*J˜  *v  *J˜  ¢  *J˜   9e  *J˜   è“  *J˜   …  7¹*  _Tp "Œ   $û  GZ  Rà  V
!  Q  ?>I  X"Q  Ó  ]¶0  BQ  HQ  Ùª   @Ó  a›Ø  ^Q  iQ  Ùª  ßª   Ó  c¨¾  ~Q  ‰Q  Ùª  Î‹   Ó  iÑü  žQ  ®Q  Ùª  Î‹  Q   A+Ü  n2j  åª  ÈQ  ÓQ  Ùª  ßª   R}  R+Î‹  	z(  sïo  ÓQ  ùQ  ÿQ  ëª   %end w*ø  ÓQ  R  R  ëª   	y(  {|æ  ÓQ  7R  =R  ëª   	òU  ãp  ÓQ  VR  \R  ëª   áV  TK†Z  	
  ƒã  \R  ‚R  ˆR  ëª   	/ü  ‡µ   \R  ¡R  §R  ëª   	
  ‹~.  \R  ÀR  ÆR  ëª   	.ü  r9  \R  ßR  åR  ëª   	bÓ  •M;  Q  þR  S  ëª   	N  ™Î†  Q  S  #S  ëª   	^Ó  ÎÅ  Q  <S  BS  ëª   	.Ç  ¤#   C˜  [S  aS  ëª   	  ªJL  Íš  zS  …S  ëª  Q   %at ²i  Íš  S  ¨S  ëª  Q   	/ì  ¼yF  Íš  ÁS  ÇS  ëª   	
H  Äôæ  Íš  àS  æS  ëª   	±p  ÌJ  Î‹  ÿS  T  ëª   Â\  ÒÁ=  T  %T  Ùª  Q   3{  Ú…~  :T  ET  Ùª  Q   :¸  ÞEÔ  ZT  eT  Ùª  åª   	–>  éE   Q  ~T  “T  ëª  ˜‹  Q  Q   	””  õ#ð   Q  ¬T  ¼T  ëª  Q  Q   	i#  ý› Â‹  ÕT  àT  ëª   Q   i#  ·,  Â‹  úT  U  ëª  Q  Q   Q   i#  ñH  Â‹  )U  HU  ëª  Q  Q   Q  Q  Q   i#  +  Â‹  bU  mU  ëª  Î‹   i#  ü¼  Â‹  ‡U  œU  ëª  Q  Q  Î‹   i#  ý  Â‹  ¶U  ÐU  ëª  Q  Q  Î‹  Q   Ù  "þ   Q  êU  úU  ëª   Q  Q   Ù  &tT  Q  V  $V  ëª  £‹  Q   Ù  )ú×  Q  >V  SV  ëª  Î‹  Q  Q   Ù  ,“  Q  mV  }V  ëª  Î‹  Q   Ù  0þì  Q  —V  §V  ëª   Q  Q   Ù  4yË  Q  ÁV  ÑV  ëª  £‹  Q   Ù  7ô£  Q  ëV   W  ëª  Î‹  Q  Q   Ù  :8|  Q  W  *W  ëª  Î‹  Q   e'  >¶  Q  DW  TW  ëª   Q  Q   e'  BA¾  Q  nW  ~W  ëª  £‹  Q   e'  Fy¸  Q  ˜W  ­W  ëª  Î‹  Q  Q   e'  I¬  Q  ÇW  ×W  ëª  Î‹  Q   ³  M*¼  Q  ñW  X  ëª   Q  Q   ³  R£Ô  Q  X  +X  ëª  £‹  Q   ³  V=€  Q  EX  ZX  ëª  Î‹  Q  Q   ³  Z¥N  Q  tX  „X  ëª  Î‹  Q   ñ(  ^dÛ  Q  žX  ®X  ëª   Q  Q   ñ(  c"a  Q  ÈX  ØX  ëª  £‹  Q   ñ(  fs  Q  òX  Y  ëª  Î‹  Q  Q   ñ(  jk  Q  !Y  1Y  ëª  Î‹  Q     q½  Q  KY  [Y  ëª   Q  Q     v­ó  Q  uY  …Y  ëª  £‹  Q     yãA  Q  ŸY  ´Y  ëª  Î‹  Q  Q     }­  Q  ÎY  ÞY  ëª  Î‹  Q   Ð5  …p…  Q  øY  Z  ëª  Q  Î‹   YÂ  €Á  Q  "Z  2Z  ëª  Q  Q   f#  ™V>  Â‹  RZ  Q  Q   )g  £
!   )ñ  ¤Î‹    £‹  #äÍ      Q  *ùú  $Áa  Gd  Rà  V
!  ˜Z  ?>I  X"¥Z  Ó  ]—¿  ÍZ  ÓZ  úª   @Ó  a»  éZ  ôZ  úª   «   Ó  c¾U  	[  [  úª  <   Ó  iã   )[  9[  úª  <  ˜Z   A+Ü  nž  «  S[  ^[  úª   «   R}  R+<  	z(  s|¢  ^[  „[  Š[  «   %end wŽ  ^[  £[  ©[  «   	y(  {¼æ  ^[  Â[  È[  «   	òU  ö  ^[  á[  ç[  «   áV  TKd  	
  ƒà  ç[  \  \  «   	/ü  ‡Bž  ç[  ,\  2\  «   	
  ‹C  ç[  K\  Q\  «   	.ü  0g  ç[  j\  p\  «   	bÓ  •·»  ˜Z  ‰\  \  «   	N  ™‡  ˜Z  ¨\  ®\  «   	^Ó  \‹  ˜Z  Ç\  Í\  «   	.Ç  ¤t4  C˜  æ\  ì\  «   	  ªøÛ  ßš  ]  ]  «  ˜Z   %at ²¯í  ßš  (]  3]  «  ˜Z   	/ì  ¼óu  ßš  L]  R]  «   	
H  Äœ¶  ßš  k]  q]  «   	±p  ÌZ  <  Š]  ]  «   Â\  Ò   ¥]  °]  úª  ˜Z   3{  ÚB  Å]  Ð]  úª  ˜Z   :¸  ÞVê  å]  ð]  úª  «   	–>  éc­  ˜Z  	^  ^  «  òŽ  ˜Z  ˜Z   	””  õ#  ‹Z  7^  G^  «  ˜Z  ˜Z   	i#  ýK  Â‹  `^  k^  «  ‹Z   i#  õ  Â‹  …^  š^  «  ˜Z  ˜Z  ‹Z   i#  ü*  Â‹  ´^  Ó^  «  ˜Z  ˜Z  ‹Z  ˜Z  ˜Z   i#  IÞ  Â‹  í^  ø^  «  <   i#  ¬  Â‹  _  '_  «  ˜Z  ˜Z  <   i#  bÕ  Â‹  A_  [_  «  ˜Z  ˜Z  <  ˜Z   Ù  "½  ˜Z  u_  …_  «  ‹Z  ˜Z   Ù  &«°  ˜Z  Ÿ_  ¯_  «  øŽ  ˜Z   Ù  )è•  ˜Z  É_  Þ_  «  <  ˜Z  ˜Z   Ù  ,j×  ˜Z  ø_  `  «  <  ˜Z   Ù  0?¸  ˜Z  "`  2`  «  ‹Z  ˜Z   Ù  41ô  ˜Z  L`  \`  «  øŽ  ˜Z   Ù  7yè  ˜Z  v`  ‹`  «  <  ˜Z  ˜Z   Ù  :Òr  ˜Z  ¥`  µ`  «  <  ˜Z   e'  >á1  ˜Z  Ï`  ß`  «  ‹Z  ˜Z   e'  B©  ˜Z  ù`  	a  «  øŽ  ˜Z   e'  FB÷  ˜Z  #a  8a  «  <  ˜Z  ˜Z   e'  I,ò  ˜Z  Ra  ba  «  <  ˜Z   ³  MPÀ  ˜Z  |a  Œa  «  ‹Z  ˜Z   ³  RŽÅ  ˜Z  ¦a  ¶a  «  øŽ  ˜Z   ³  Vþ&  ˜Z  Ða  åa  «  <  ˜Z  ˜Z   ³  Zz  ˜Z  ÿa  b  «  <  ˜Z   ñ(  ^D8  ˜Z  )b  9b  «  ‹Z  ˜Z   ñ(  cV=  ˜Z  Sb  cb  «  øŽ  ˜Z   ñ(  f\¤  ˜Z  }b  ’b  «  <  ˜Z  ˜Z   ñ(  jgø  ˜Z  ¬b  ¼b  «  <  ˜Z     qñ´  ˜Z  Öb  æb  «  ‹Z  ˜Z     v†^  ˜Z   c  c  «  øŽ  ˜Z     yá‘  ˜Z  *c  ?c  «  <  ˜Z  ˜Z     }hp  ˜Z  Yc  ic  «  <  ˜Z   Ð5  …šv  ˜Z  ƒc  “c  «  ˜Z  Î‹   YÂ  Ð  ˜Z  ­c  ½c  «  ˜Z  ˜Z   f#  ™žñ  Â‹  Ýc  ˜Z  ˜Z   )g  £
!   )ñ  ¤<    øŽ  #äÍ  !   ‹Z  *vs  $É‰  G—m  Rà  V
!  #d  ?>I  X"0d  Ó  ]³Â  Xd  ^d  «   @Ó  a÷U  td  d  «  !«   Ó  cB‚  ”d  Ÿd  «  '«   Ó  iøV  ´d  Äd  «  '«  #d   A+Ü  n`õ  -«  Þd  éd  «  !«   R}  R+'«  	z(  sr|  éd  e  e  3«   %end wæå  éd  .e  4e  3«   	y(  {å  éd  Me  Se  3«   	òU  k  éd  le  re  3«   áV  TKœm  	
  ƒ@-  re  ˜e  že  3«   	/ü  ‡ôÈ  re  ·e  ½e  3«   	
  ‹ª  re  Öe  Üe  3«   	.ü  ŒE  re  õe  ûe  3«   	bÓ  •­ß  #d  f  f  3«   	N  ™]²  #d  3f  9f  3«   	^Ó  ñÄ  #d  Rf  Xf  3«   	.Ç  ¤¬  C˜  qf  wf  3«   	  ªùœ  9«  f  ›f  3«  #d   %at ²G{  9«  ³f  ¾f  3«  #d   	/ì  ¼+P  9«  ×f  Ýf  3«   	
H  Ä@  9«  öf  üf  3«   	±p  ÌBr  '«  g  g  3«   Â\  ÒË  0g  ;g  «  #d   3{  Ú  Pg  [g  «  #d   :¸  Þû  pg  {g  «  -«   	–>  éué  #d  ”g  ©g  3«  ?«  #d  #d   	””  õgg  d  Âg  Òg  3«  #d  #d   	i#  ý^ Â‹  ëg  ög  3«  d   i#  ¼è  Â‹  h  %h  3«  #d  #d  d   i#  ¯w  Â‹  ?h  ^h  3«  #d  #d  d  #d  #d   i#  êÞ  Â‹  xh  ƒh  3«  '«   i#  T[  Â‹  h  ²h  3«  #d  #d  '«   i#  ƒ;  Â‹  Ìh  æh  3«  #d  #d  '«  #d   Ù  "J~  #d   i  i  3«  d  #d   Ù  &BJ  #d  *i  :i  3«  ˜  #d   Ù  )h‡  #d  Ti  ii  3«  '«  #d  #d   Ù  ,@æ  #d  ƒi  “i  3«  '«  #d   Ù  0¨ë  #d  ­i  ½i  3«  d  #d   Ù  4º#  #d  ×i  çi  3«  ˜  #d   Ù  7kd  #d  j  j  3«  '«  #d  #d   Ù  :7µ  #d  0j  @j  3«  '«  #d   e'  >E  #d  Zj  jj  3«  d  #d   e'  B;Ú  #d  „j  ”j  3«  ˜  #d   e'  F”!  #d  ®j  Ãj  3«  '«  #d  #d   e'  I¸M  #d  Ýj  íj  3«  '«  #d   ³  M@•  #d  k  k  3«  d  #d   ³  R 7  #d  1k  Ak  3«  ˜  #d   ³  V¸ì  #d  [k  pk  3«  '«  #d  #d   ³  Zq  #d  Šk  šk  3«  '«  #d   ñ(  ^ãÔ  #d  ´k  Äk  3«  d  #d   ñ(  cÌd  #d  Þk  îk  3«  ˜  #d   ñ(  f†ü  #d  l  l  3«  '«  #d  #d   ñ(  jÊ^  #d  7l  Gl  3«  '«  #d     qÖž  #d  al  ql  3«  d  #d     vÝL  #d  ‹l  ›l  3«  ˜  #d     y\í  #d  µl  Êl  3«  '«  #d  #d     }LH  #d  äl  ôl  3«  '«  #d   Ð5  …ê@  #d  m  m  3«  #d  Î‹   YÂ  åÀ  #d  8m  Hm  3«  #d  #d   f#  ™Ô­  Â‹  hm  #d  #d   )g  £
!   )ñ  ¤'«    ˜  #äÍ  â#   d  *øa  $¤ˆ  G"w  Rà  V
!  ®m  ?>I  X"»m  Ó  ]Yì  ãm  ém  N«   @Ó  a}f  ÿm  
n  N«  T«   Ó  cH  n  *n  N«  Z«   Ó  iS  ?n  On  N«  Z«  ®m   A+Ü  n‚ `«  in  tn  N«  T«   R}  R+Z«  	z(  s¿Š  tn  šn   n  f«   %end wzr  tn  ¹n  ¿n  f«   	y(  {Ä:  tn  Øn  Þn  f«   	òU  É¯  tn  ÷n  ýn  f«   áV  TK'w  	
  ƒ„X  ýn  #o  )o  f«   	/ü  ‡2\  ýn  Bo  Ho  f«   	
  ‹»‹  ýn  ao  go  f«   	.ü  ·R  ýn  €o  †o  f«   	bÓ  •Qw  ®m  Ÿo  ¥o  f«   	N  ™
á  ®m  ¾o  Äo  f«   	^Ó    ®m  Ýo  ão  f«   	.Ç  ¤‘  C˜  üo  p  f«   	  ªxÌ  l«  p  &p  f«  ®m   %at ²Iƒ  l«  >p  Ip  f«  ®m   	/ì  ¼M`  l«  bp  hp  f«   	
H  Äw}  l«  p  ‡p  f«   	±p  Ì  Z«   p  ¦p  f«   Â\  ÒÀ  »p  Æp  N«  ®m   3{  ÚÒ÷  Ûp  æp  N«  ®m   :¸  Þ›Ý  ûp  q  N«  `«   	–>  é¾Ê  ®m  q  4q  f«  r«  ®m  ®m   	””  õ$M  ¡m  Mq  ]q  f«  ®m  ®m   	i#  ý²x  Â‹  vq  q  f«  ¡m   i#  ³ª  Â‹  ›q  °q  f«  ®m  ®m  ¡m   i#  ¡  Â‹  Êq  éq  f«  ®m  ®m  ¡m  ®m  ®m   i#  g  Â‹  r  r  f«  Z«   i#  ñó  Â‹  (r  =r  f«  ®m  ®m  Z«   i#  SÎ  Â‹  Wr  qr  f«  ®m  ®m  Z«  ®m   Ù  "ga  ®m  ‹r  ›r  f«  ¡m  ®m   Ù  &²ä  ®m  µr  År  f«  ‹˜  ®m   Ù  )ø‡  ®m  ßr  ôr  f«  Z«  ®m  ®m   Ù  ,>*  ®m  s  s  f«  Z«  ®m   Ù  0ÙB  ®m  8s  Hs  f«  ¡m  ®m   Ù  4°ô  ®m  bs  rs  f«  ‹˜  ®m   Ù  7h  ®m  Œs  ¡s  f«  Z«  ®m  ®m   Ù  :s  ®m  »s  Ës  f«  Z«  ®m   e'  >x  ®m  ås  õs  f«  ¡m  ®m   e'  B'ó  ®m  t  t  f«  ‹˜  ®m   e'  F/å  ®m  9t  Nt  f«  Z«  ®m  ®m   e'  I–±  ®m  ht  xt  f«  Z«  ®m   ³  M4É  ®m  ’t  ¢t  f«  ¡m  ®m   ³  Ròª  ®m  ¼t  Ìt  f«  ‹˜  ®m   ³  V·D  ®m  æt  ût  f«  Z«  ®m  ®m   ³  Zí[  ®m  u  %u  f«  Z«  ®m   ñ(  ^ Þ  ®m  ?u  Ou  f«  ¡m  ®m   ñ(  c@G  ®m  iu  yu  f«  ‹˜  ®m   ñ(  fÿ}  ®m  “u  ¨u  f«  Z«  ®m  ®m   ñ(  jþ  ®m  Âu  Òu  f«  Z«  ®m     q(’  ®m  ìu  üu  f«  ¡m  ®m     v¡s  ®m  v  &v  f«  ‹˜  ®m     yë  ®m  @v  Uv  f«  Z«  ®m  ®m     }¦>  ®m  ov  v  f«  Z«  ®m   Ð5  …  ®m  ™v  ©v  f«  ®m  Î‹   YÂ  V:  ®m  Ãv  Óv  f«  ®m  ®m   f#  ™s@  Â‹  óv  ®m  ®m   )g  £
!   )ñ  ¤Z«    ‹˜  #äÍ  Î%   ¡m  *†`  R‚  q^w  F5  s4s9w  F{  141Kw   4q,w   «  €Ô«  †;¬  ‰Y¬  Œt¬  Š¬  Ž ¬  ¶¬  ‘á¬  ”ý¬  –­  ™0­  šL­  ›m­  Ž­   °­  £Ä­  ¥Ñ­  ¦ä­  §®  ¨%®  ©E®  «\®  ¬}®  ð¬  õ•‚  ö™®  øµ®  ù¯  úË®  ûë®  ü&¯  b‘Ž  cË¯  eB°  fU°  gk°  h‚°  i™°  j¯°  kÆ°  lè°  m	±  q$±  rJ±  tj±  u‹±  v­±  xÄ±  yÛ±  ~è±  ƒû±  „²  …,²  ‡?²  ˆW²  ‹}²  ‰²  Ÿ²  >#  €Sz  ¸B  ˆ˜‹  wZ  ³°F  My  zy  Ó²  Œy   }R  ƒ,*  zy  Rà  —$
!  wZ  ÁçN  My  ¾y  Ó²  Œy  ¾y   ­B  ‘-®š  !uZ  ÍýQ  ìy  Ó²  My  Œy   ^Ó  ï=È  Œy  z  Ù²   kÒ  ø¨  zy  "z  Ù²   ID  …£‹  ºi  ‹'Î‹  g4  ¦%*  £  *   $ø  /F{  ïV  6Î‹  
õ2  :`z   Rà  5
!  
g  ;zz   ¶  >»e  ¨z  ¸z  =³  ¸z  zz   R}  7Î‹  ¶  BŠÑ  Úz  àz  =³   	bÓ  G½  zz  ùz  ÿz  C³   	z(  KYf  ¸z  {  {  C³   %end O;v  ¸z  7{  ={  C³   _E £‹   Sz  *5Ê  *j¥  R[³  SO³  T{Œ  \m³  eˆ³  h£³  i¹³  k_V2 G[G{  5K  
|  l˜†  [˜†  _ÐÓ  Ç{  Í{  Ï³   —†  `†  ã{  î{  Ï³  Â‹   \ÿò  cg›  \o"  dC˜    <öš  =åš  >{’  @Õ³  Aá³  Bü³  C´  D4´  EJ´  Ff´  G|´  #ÿ  ²|  _M  ¶+*  ¸B  ·+˜‹  ë  ¸+Çš  ïú  ˜‹   ùº  ½Ø|  _M  Á+*  ¸B  Â+Î‹  ë  Ã+Íš  ïú  Î‹   ™›  9N}  <az  ;-¶‹  ID  <-¯‹  Ä~  >-œ  ò|  }  }  Ë´   Á›  CÐ\  ò|  4}  :}  Ë´   _Tp ¯‹  =__v ¯‹   Ø|  ‘Ò  ]
z}  m‘Ò  ^(  s}  Ñ´    S}  ]Lª  aGª  z}   †  .
¸}  E†  .%¹  ±}  Ü´    “}  V»‰  0/µ‰  ¸}   n¹H  `
Ð}  ]É5  j/Ä5  Ú}   5ˆ   ~    £‹  #äÍ     5p6  +~    øŽ  #äÍ  !   5bÂ  G~    £‹  #äÍ     ³¢  Ÿ_~  _Tp ò´   æ–  ¨‹~  2G~   Gaz  ®J˜  _Tp ò´   5•î  §~    øŽ  #äÍ  !   Œ¦  Ÿ¿~  _Tp µ   *B  ¨ë~  2§~   Gaz  ®J˜  _Tp µ   en  Š!+~  ocin <Ø·  ë~  §í  !ó}  (°T  =«T    (×  >×    (ˆ£  ?ƒ£    dn  ²#‹~  (‘  BŒ  C  ¦í  µ#~  (:  C5  _  (<‚  D7‚  _  (5R  E0R  _  p”S  J¦{  K µ  KDµ  Rhµ  Uƒµ  [šµ  \¶µ  ]Öµ  ]õµ  ^¶  ^4¶  _T¶  _s¶  `’¶  `²¶  4   x/€  _Tp ì´   qº   2€   Gaz   ‡J˜  _Tp ì´    rá·  
RŠ  F  
A4
Ae€  ø°–  "Ì–  "ô–  WÏ3  !#",
!  "-*  $(ß  ":‚  µA  "Ok)  Ë€  Ñ€  µš   µA  "QSœ  æ€  ñ€  µš  »š   ´A  "Vþâ      µš  Â‹   ¸B  "?˜‹  	x  "YÜ¾    7  B  Áš  B   ë  "AÇš  ºi  "@Î‹  	x  "]Uª  O  u  €  Áš  €   å  "BÍš  	wZ  "cb    ¦  ¶  µš  ¶  ®š   Rà  "=
!  uZ  "tòƒ  Ø  è  µš    ¶   	^Ó  "â°  ¶  ‚  ‚  Áš   _Tp £‹   ©€  å9  #7]‚  €  #:É‹  ¸ý  #;É‹  z  #?J˜  øÆ  #@É‹  @  Â‹   È¬  Ø™®  ãµ®  äË®  åë®  ç¯  è&¯  sdiv Õvä  ¬  ´‚  í–  í–   ïÚ  $2
æƒ  $2
™y  $2
Zy  $2
Ëy  $2
ìy  2?y   ½Œ  $^ÞF  *  ƒ  Ùš   t4¸  $aE%  ƒ  ß²  ß²   6Ó  $d™´  C˜  6ÑØ  $gH&  C˜  6‚ù  $jFØ  C˜  6ä£  $mã7  C˜  6…  $pzú  C˜  ID  $:5"z  lƒ  ¸B  $;5My  ºi  $<5/z  Rà  $=5Œy  ë  $@5å²  å  $A5ë²  ø²  $tÜƒ  ÝÕ  $uA<z  _Tp £‹   £  *   ^Æ  %ü †  _„ñ  %ÿ˜‹   
  %!Y  „  „  ’´   :
  %©à  5„  @„  ’´  ˜´   .ë  %2‡|  ZÛ  %9¿  @„  h„  n„  ž´   .¸B  %	2{|  ×§  % Ë˜  n„  –„  œ„  ž´   ç¡  %$P  ¤´  ¶„  ¼„  ’´   ç¡  %+«  æƒ  Ö„  á„  ’´  Â‹    §  %0IA  ¤´  û„  …  ’´    §  %7›”  æƒ  …  &…  ’´  Â‹     %<"Á  @„  @…  K…  ž´  K…   ._M  %8o|   ¢  %@øR  ¤´  s…  ~…  ’´  K…   Ïý  %Dq3  æƒ  ˜…  £…  ž´  K…   Ì§  %H…  ¤´  ½…  È…  ’´  K…   îÛ  %Lc  æƒ  â…  í…  ž´  K…   u  %PÆ?  ˜´  †  †  ž´   ïú  ˜‹  È  E    æƒ  ^{œ  %ü_ˆ  _„ñ  %ÿÎ‹   
  %6!  X†  ^†  ª´   :
  %>“  t†  †  ª´  °´   .ë  %2Â|  ZÛ  %Ò  †  §†  ­†  ¶´   .¸B  %	2¶|  ×§  % ‹ç  ­†  Õ†  Û†  ¶´   ç¡  %$D  ¼´  õ†  û†  ª´   ç¡  %+©W  %†  ‡   ‡  ª´  Â‹    §  %0ö‹  ¼´  :‡  @‡  ª´    §  %7øŠ  %†  Z‡  e‡  ª´  Â‹     %<ª  †  ‡  Š‡  ¶´  Š‡   ._M  %8ª|   ¢  %@xž  ¼´  ²‡  ½‡  ª´  Š‡   Ïý  %D‡€  %†  ×‡  â‡  ¶´  Š‡   Ì§  %HÍ  ¼´  ü‡  ˆ  ª´  Š‡   îÛ  %Ly·  %†  !ˆ  ,ˆ  ¶´  Š‡   u  %P|k  °´  Fˆ  Lˆ  ¶´   ïú  Î‹  È  E    %†  Þ  #d«ˆ  H  #gÉ‹  z  #jJ˜  äú  #kÉ‹    #lÉ‹  @  Œ   Îá  #dòˆ  H  #gÉ‹  z  #jJ˜  äú  #kÉ‹    #lÉ‹  @  Œ   ¤¤  #d9‰  H  #gÉ‹  z  #jJ˜  äú  #kÉ‹    #lÉ‹  @  "Œ   É{  #7€‰  €  #:¶‹  ¸ý  #;¶‹  z  #?J˜  øÆ  #@É‹  @  ¯‹   n5  #7Ç‰  €  #:ª‹  ¸ý  #;ª‹  z  #?J˜  øÆ  #@É‹  @  £‹   }L  #7Š  €  #:U—  ¸ý  #;U—  z  #?J˜  øÆ  #@É‹  @  N—   u*;  #7€  #:_”  ¸ý  #;_”  z  #?J˜  øÆ  #@É‹  @  X”    |  `&3˜‹  
dï  &7	˜‹   
ZK  &8	˜‹  
oÈ  &>	˜‹  
æ€  &D	˜‹  
ü#  &E	˜‹   
`ï  &F	˜‹  (
VK  &G	˜‹  0
kÈ  &H	˜‹  8
7  &I	˜‹  @
Ð•  &J	˜‹  H
÷  &K£‹  P
÷  &L£‹  Q
Æù  &N£‹  R
   &P£‹  S
°  &R£‹  T
XE  &T£‹  U
m.  &[£‹  V
  &\£‹  W
Âù  &_£‹  X
œ  &a£‹  Y
°  &c£‹  Z
TE  &e£‹  [
i.  &l£‹  \
  &m£‹  ] £‹  ˜‹  r}  £‹  ‰Ø  ¯‹  r  vint Â‹  ª‹  Î‹  "„  &z˜‹  ô‹  Â‹  Î‹   H¬¬  &} Œ  RŠ   {à  ËZ  ú|  =  8  &  'Ø¯‹  wcð  ( rŒ  B[û  ( rŒ   B6Ž  ( rŒ  Bßò  ( yŒ  Bñò  ( yŒ   ŽØ  xÍÿ  )rŒ  C*ÀB  ÑŒ  S*¶Œ  9ðw  *rŒ  9·.  *ÑŒ   
a}  *Â‹   
_z  *”Œ   +£‹  áŒ  7¯‹   ÂB  *‡Œ  ÄB  +áŒ  íŒ  ïx  ,
  Fú  Ø-1‘Ž  
ï>  -3Â‹   
žZ  -6	˜‹  
øG  -7	˜‹  
u  -8	˜‹  
Z»  -9	˜‹   
”]  -:	˜‹  (
 }  -;	˜‹  0
”O  -<	˜‹  8
±q  -=	˜‹  @
0I  -@	˜‹  H
²@  -A	˜‹  P
R›  -B	˜‹  X
œ­  -Dƒ¯  `
\ð  -F‰¯  h
Ì­  -HÂ‹  p
j\  -IÂ‹  t
Q–  -J˜  x
sÆ  -M»‹  €
=6  -N/—  ‚
{  -O¯  ƒ
&m  -QŸ¯  ˆ
U–  -Y˜  
út  -[ª¯  ˜
ó  -\µ¯   
óø  -]‰¯  ¨
+ -^	yŒ  °
Ü  -_
)Œ  ¸
e)  -`Â‹  À
Ã%  -bJ»¯  Ä Jú  .
  ”:  /{Œ  ´Ž  Â‹   M  /×{Œ  ËŽ  ËŽ   þŒ  t  /ôòŽ  òŽ  òŽ  Â‹  ËŽ   øŽ  V£  øŽ  þ  /å{Œ     øŽ  ËŽ   ˜þ  /ûÂ‹  <  <  ËŽ   ÿŽ  $  /=Â‹  ^  ËŽ  Â‹   ¿ý  /DÂ‹  {  ËŽ  <  / T¤  /mÂ‹  ˜  ËŽ  <  / N  /Ø{Œ  ¯  ËŽ   I‚  /Þ{Œ  °R  /3)Œ  Ý  Î‹  )Œ  Ý   íŒ  òî  /()Œ  	  òŽ  Î‹  )Œ  Ý   ö€  /$Â‹         ùŒ  ª–  /Q)Œ  L  òŽ  L  )Œ  Ý   Î‹  þ  /æ{Œ  n  øŽ  ËŽ   «Ÿ  /ì{Œ  …  øŽ   GŠ  /NÂ‹  §  òŽ  )Œ  <  / Ð…  /wÂ‹  Ä  <  <  / ´?  /{Œ  à  {Œ  ËŽ   ¾ý  /VÂ‹  ‘  ËŽ  <  ‘   5Œ  S¤  /¡Â‹  (‘  ËŽ  <  ‘   FŠ  /cÂ‹  N‘  òŽ  )Œ  <  ‘   Ï…  /­Â‹  o‘  <  <  ‘   µT  /^Â‹  ‹‘  <  ‘   ´è  /©Â‹  §‘  <  ‘   2N  /-)Œ  È‘  ˜‹  øŽ  Ý   ÷Y  /aòŽ  ã‘  òŽ  <   it  /jÂ‹  þ‘  <  <   <  /ƒÂ‹  ’  <  <   Xz  /WòŽ  4’  òŽ  <   ït  /»)Œ  O’  <  <   ®ƒ  /C)Œ  u’  òŽ  )Œ  <  u’   “  ytm 80“  
Èý  0	Â‹   
õ#  0
Â‹  
Ù4  0Â‹  
b  0Â‹  
B0  0Â‹  
0Ë  0Â‹  
”Î  0Â‹  
þ:  0Â‹  
ü¤  0Â‹   
êç  0X”  (
ö  0Î‹  0 {’  #¼  /Þ)Œ  2“  <   £  /eòŽ  R“  òŽ  <  )Œ   ÿ  /mÂ‹  r“  <  <  )Œ   <—  /\òŽ  ’“  òŽ  <  )Œ   —s  /W)Œ  ¸“  ˜‹  ¸“  )Œ  Ý   <  ‰?  /¿)Œ  Ù“  <  <   EÎ  /yŒ  õ“  <  õ“   òŽ  LÎ  /~Œ  ”  <  õ“   Y©  /ÙòŽ  7”  òŽ  <  õ“   œÎ  /¬X”  X”  <  õ“  Â‹   _   X”  _„  /±¯‹  …”  <  õ“  Â‹   `p  /‡)Œ  ¥”  òŽ  <  )Œ   A{  / Â‹  ¼”  {Œ   Ó  /Â‹  Ý”  <  <  )Œ   Ù  /òŽ  þ”  òŽ  <  )Œ   è´  /òŽ  •  òŽ  <  )Œ   Aƒ  /òŽ  @•  òŽ  øŽ  )Œ   Àý  /KÂ‹  X•  <  / U¤  /tÂ‹  p•  <  / h  /¡h  <  •  <  øŽ   h  /Ÿh  òŽ  ®•  òŽ  øŽ   ¾(  /Å¾(  <  Í•  <  <   ¾(  /Ã¾(  òŽ  ì•  òŽ  <   þ  /«þ  <  –  <  øŽ   þ  /©þ  òŽ  *–  òŽ  øŽ   H  /ÐH  <  I–  <  <   H  /ÎH  òŽ  h–  òŽ  <   ,É  /ù,É  <  Œ–  <  øŽ  )Œ   ,É  /÷,É  òŽ  °–  òŽ  øŽ  )Œ   ö  /€"Œ  Ì–  <  õ“   Êr  /¹í–  í–  <  õ“  Â‹   Z   Ë¤  /À—  —  <  õ“  Â‹   „Ø  i}  Ýe  1$/—  k}  «4  1%—  œt  1&N—  ª  N—  P  1'»‹  Þ´  1(Â‹  f—  ÃŽ  1)rŒ  Lù  1+X”  SÓ  1,¯‹  ñ  13#—  4ü  146—  Ún  15B—  ¥â  16Z—  o®  17f—  w   18w—  ó  19ƒ—  õ\  1:—  Ÿ  1GX”  öx  1H¯‹  Ø…  1–X”  ;Î  1—X”  Š  1šX”  ¶  1žX”  ù&  C˜  0§/  c   Ì  0w  Þ  G  0§  Y   Â  Áš  ˜  2Ý  ‹˜  Ù  D  X?™  8·˜  [:   H  U  U  H  ”   @!  M!  M!  @!  Œ"  ße  2#—  žt  2B—  à´  2f—  Nù  2ƒ—  ­4  36—  P  3Z—  ÅŽ  3w—  UÓ  3—  ‘ñ  4+›—  Ün  4,³—  q®  4-Ë—  ó  4.ã—  6ü  41§—  §â  42¿—  y   43×—  ÷\  44ï—  m  4:/—  ù3  4<X”  âo  4=X”  þ±  4>X”  m  4G—  ø3  4I¯‹  áo  4J¯‹  ý±  4K¯‹  x
  4WX”  w
  4Z¯‹  ¡  4eû—  øx  4f˜  $  $  $  $  X%  ø%  &  &  ø%  D'  z?e  Æ'  )  )  JÆ'  Æ'  Ì)  Ñ)  ´š  {©€  ‚  ‚  £‹  ª‹  *  ƒ*  ÿŽ  ¶  57˜  åš  Œ  6+˜  +˜‹  ›  7¯‹   Oú  7Ÿ›  ÎB  7 Â‹  ›>  7¡X”  Qú  7¦›  ÐB  7®Â‹  >  7¯X”  |ú  7Â‹  
è  8 Â‹  gÜ  õ*  ™U  +  ‡Q  +  Í  +  ›  -+    ;+  Î/  I+  GÒ  W+  '@  e+  =d  s+  ¸h  +  iÙ  +  ¦C  +  ,m  «+  ¡  º+  ÍY  É+  Aã  Ø+  ¢g  ç+  ~Y  ö+  rï  ,  c]  ,  ƒ  #,  u  2,  ”ã  P,  ìˆ  ’,  ­  ¡,  à…  °,  ”h  ¿,  ï  Î,  ±é  Ý,  óÜ  ì,  Ô¤  -  ªG  ,-  d  ;-  œ¹  J-  ð¨  Y-  ‹  h-  ¶p  w-  Ò_  †-  ¥³  •-  rÍ  è-  k  ÷-  ¥J  .  „½  .  HF  $.  ‹ä  3.  ès  Z.  ÞK  œ.  œ©  «.  ö  º.  PŠ  É.  (Ä  Ø.  ™‚  ç.  ÃA  ö.  n  '/  RV  6/  ¨’  E/  &p  T/  Þk  c/  c1  r/   >  /  ¬  /  –b  Ÿ/  ì  ò/  ‚¾  0  ‹m  0  %  0  ®Q  .0  ‚ª  =0  h   d0  I0  ¦0  ~l  µ0  ?h  Ä0  õ  Ó0  Èi  â0  …I  ñ0  Cq   1  µå  11  îO  @1  Y  O1    ^1  ûè  m1  Ù  |1  ù¥  ‹1  
º  š1  ‹  ©1  /¤  ü1  žÚ  2  Ø*  2  AR  )2  ÏŒ  82  µ¨  G2    n2  –D  °2  ‡Ó  ¿2  ŽÇ  Î2  »<  Ý2  <  ì2  R”  û2  ¾K  
3  Ä;  ;3  s¡  J3  nb  Y3    h3  ?  w3  '  †3  Ó8  •3  œ\  ¤3  –  ³3  ˜  4  }Ô  4  ]  $4  É-  34  êc  B4  <1  Q4  ñþ  x4  „•  º4  ˜õ  É4   9  Ø4  #E  ç4  Û  ö4  lÏ  5  æe  5  =°  E5  †  T5  ?Ü  c5  Ùý  r5  }³  5  ,¯  5  œ{  Ÿ5  õS  ®5  †q  ½5  ¨¡  6  ¦t  6  6(  .6  ,H  =6  ÉÈ  L6  {u  [6  %O  ‚6  *3  Ä6  py  Ó6  ÿK  â6  z¬  ñ6  †B   7  ÐT  7  Z  7  xÈ  O7  ÕÝ  ^7  Žò  m7  :N  |7  ïÌ  ‹7  Õ  š7  ß6  ©7  öŽ  ¸7  ¾Ö  Ç7  [  8  \¯  )8  –‹  88  ƒ  G8  ˜  V8  „  e8  Y  Œ8  ÌO  Î8  ôT  Ý8  Œ¨  ì8  PO  û8  .  
9  µ4  9  Ý   (9  #  Y9  ¥•  h9  |J  w9  V  †9  ö%  •9  mP  ¤9  NC  ³9  î  Â9  €§  Ñ9  ·¬  $:  †  3:  L3  B:  -ä  Q:  pt  `:  ÉJ  o:  A  –:  Po  Ø:  Ëz  ç:  T  ö:  l¼  ;  ‡_  ;  QT  #;  îi  2;  ´Ÿ  c;  ÜŸ  r;  s  ;  Ì  ;  ¥  Ÿ;  >  ®;  Ôù  ½;  G¬  Ì;  Èu  Û;  °  .<  ›=  =<  éb  L<  ¬§  [<  Ø„  j<  9½  y<  Ò   <  4Ö  â<  þ  ñ<  Øð   =  „Þ  =  á  =  _ù  -=  –0  <=  Âc  m=  ¹  |=  ÎŽ  ‹=  ©Ñ  š=  µf  ©=  ¯*  ¸=  ÄÄ  Ç=  U  Ö=  Æ(  å=  ;  8>  ¢u  G>  Â  V>  %  e>  ²  t>   ƒ>  âÒ  ª>  úŒ  ì>  /V  û>  g„  
?  0[  ?  É¿  (?  Õ3  7?  åµ  F?  0 w?  7  †?  Ñ)  •?  óÑ  ¤?  ´  ³?  ->  Â?  ,  Ñ?  Ì	  à?  2‰  ï?  Mþ  B@  ë'  Q@  ?  `@  ø“  o@    ~@  6²  @  >‡  ´@  Ú  ö@  —ù  A  ÉH  A  G  #A  Qe  2A  "Ô  AA    PA  Æ  A  è0  A  8  ŸA  ,†  ®A  ¡È  ½A  g  ÌA  :Ñ  ÛA  Ò²  êA  +=  ùA  Dá  LB  ,Õ  [B  ÔÆ  jB  ôÿ  yB  £"  ˆB  3  —B  X ¾B  «j   C  õ/  C  úÓ  C  k  -C  ®½  <C  ãí  KC  UZ  ZC  ]I  ‹C  Î‡  šC  ·ò  ©C  Çþ  ¸C  µL  ÇC  ‚  ÖC  kc  åC  J  ôC  U  D  Ÿ%  VD  Ê&  eD  h¨  tD  ÓÑ  ƒD  ÷+  ’D  5  ¡D  »  ÈD  N´  
E  gÑ  E  eû  (E  äë  7E  Hb  FE  +§  UE  ÕS  dE  1  •E  |C  ¤E  «8  ³E  ½¸  ÂE  ­  ÑE  ëô  àE  ´1  ïE  P±  þE  ¡O  F  ÔG  `F  ªÓ  oF  £Î  ~F  ‹8  F  Ð³  œF  ¸  «F  Uº  ÒF  hj  G  TŒ  #G  Ÿþ  2G  ‰ß  AG  CÙ  PG  ˜e  _G  gÓ  nG  r  ŸG  Fö  ®G  €  ½G  1  ÌG  )w  ÛG  <ß  êG  Wñ  ùG  8 H  Øï  H  ±Ë  jH  Ê  yH  •H  ˆH  v±  —H    ¦H  gÅ  µH  q  ÜH  ô,  I  Ô+  -I  7Ã  <I  "Š  KI  ÖZ  ZI  ø  iI  y‚  xI  (9  ©I  :ÿ  ¸I  ø_  ÇI  ¯m  ÖI  ì;  åI  Ô
  ôI  ö»  J  `©  J  tš  !J  5ì  tJ  µÍ  ƒJ  j  ’J  T  ¡J  ùê  °J  (/  ¿J  I¡  æJ  Ü±  (K  cq  7K  ß<  FK  L—  UK  "Â  dK  þY  sK  «z  ‚K  ³  ³K  0  ÃK  Œá  ÒK  N  áK  ¤	  ðK  p—  ÿK  Ÿ  L  $  L  ×v  ,L  ÙQ  L  ;+  ŽL  ¹Ù  L  «Z  ¬L  û³  »L  €/  ÊL  £×  ñL  ð  3M  G  BM  t¶  QM  ¥¯  `M  gh  oM  ë   ~M  5«  M  Çû  ¾M  ¼  ÎM  IU  ÞM  ",  îM  Œ1  þM  ,Z  N  
  N  S·  +N  Ñ  :N  J  N  ‰w  œN  V  «N  Š  ºN  ~   ÉN  ¢-  ØN  Žê  ÿN  we  AO  ’å  PO  )x  _O  8í  nO  «  }O  ­Ã  ŒO  :  ›O  ˆô  ÌO  ?t  ÝO  pö  íO  Ôé  ýO  !  P  ¥‡  P  Í×  +P  ]  :P  ÞË  IP  ­2  œP  Ù}  «P    ºP  Óø  ÉP  ÄÚ  ØP  ¥­  çP  á4  Q   Q  Z   Q  Z  ÀÐ  ªZ  ‹Z  d  ‹Z  d  úÊ  5d  d  —m  †˜  d  —m  †˜  ˜  T  Àm  ¡m  "w  ’˜  ¡m  "w  ’˜  ‹˜  C9;A   «  
y.  9<	Â‹   Krem 9=	Â‹   B  9>x«  C9CðR  Ô«  
y.  9DX”   Krem 9EX”   ñR  9F¬«  C9MÕË  ¬  
y.  9Ní–   Krem 9Oí–   ÖË  9Pà«  Êð  9%!¬  '¬  }Â‹  ;¬  ®š  ®š   ¹Ð  9PÂ‹  R¬  R¬   X¬  ~¦A  9U¦A  Â‹  t¬  R¬   $  9eŒ  Š¬  Î‹   R$  9hÂ‹   ¬  Î‹   W$  9kX”  ¶¬  Î‹   ( 91yŒ  á¬  ®š  ®š  )Œ  )Œ  ¬   div 9Q «  ý¬  Â‹  Â‹   ‡–  9w˜‹  ­  Î‹   t  9SÔ«  0­  X”  X”   çÉ  9—Â‹  L­  Î‹  )Œ   Ø  9¢)Œ  m­  òŽ  Î‹  )Œ   “:  9šÂ‹  Ž­  òŽ  Î‹  )Œ   1ü  9;°­  yŒ  )Œ  )Œ  ¬   €©A  9lÄ­  Â‹   IB¬  9ÅÂ‹  1A¬  9Çä­  rŒ   mn  9uŒ  ÿ­  Î‹  ÿ­   ˜‹  Ón  9°X”  %®  Î‹  ÿ­  Â‹     9´¯‹  E®  Î‹  ÿ­  Â‹   ¹6  9Â‹  \®  Î‹   z*  9¥)Œ  }®  ˜‹  <  )Œ   zÄ  9žÂ‹  ™®  ˜‹  øŽ   t  9W¬  µ®  í–  í–   .  9p$í–  Ë®  Î‹   ú  9Èí–  ë®  Î‹  ÿ­  Â‹   ÛÍ  9Í—  ¯  Î‹  ÿ­  Â‹   tn  9{Œ  &¯  Î‹  ÿ­   ºù  9~"Œ  A¯  Î‹  ÿ­   Ü–  :
i¯  
3¿  :˜   
D—  :áŒ   éƒ  :A¯  !Z  -+L>U  ~¯  
  +£‹  Ÿ¯  7¯‹    u¯  L÷t  ¥¯  Lð  °¯  +£‹  Ë¯  7¯‹   ß–  ;Ti¯  Ë¯  sF  ;‰è¯  ‘Ž  U¯  ;Šè¯  O/  ;‹è¯  ªª  <Â‹  +Ô‹  °  ‚ HE  <°  ©ª  <Â‹  GE  <°  1V„  ;ûU°  è¯   ÞÀ  ;ÕÂ‹  k°  è¯   8€  ;ýÂ‹  ‚°  è¯   Iý  ;ÿÂ‹  ™°  è¯   õ{  ;ÚÂ‹  ¯°  è¯   ¾  ;ëÂ‹  Æ°  è¯   æ`  ;áÂ‹  â°  è¯  â°   Ë¯  ‘  ;:˜‹  	±  ˜‹  Â‹  è¯   <  ;öè¯  $±  Î‹  Î‹   ;R  ;Œ)Œ  J±  yŒ  )Œ  )Œ  è¯   ŒR  ;üè¯  j±  Î‹  Î‹  è¯   ‹  ;²Â‹  ‹±  è¯  X”  Â‹   #P  ;æÂ‹  §±  è¯  §±   ×¯  •Ü  ;·X”  Ä±  è¯   ¿  ;ìÂ‹  Û±  è¯   I»²  ;òÂ‹  1eÐ  ;û±  Î‹   Ç†  ;’Â‹  ²  Î‹   €€  ;”Â‹  ,²  Î‹  Î‹   1•\  ;¼?²  è¯   1NÄ  ;0W²  è¯  ˜‹   _ø  ;4Â‹  }²  è¯  ˜‹  Â‹  )Œ   Hƒ  ;­è¯  4Ø  ;»˜‹  Ÿ²  ˜‹   %H  ;…Â‹  »²  Â‹  è¯   M)  =-˜‹  ZÌ  =.˜‹  zy  ‡y  *  lƒ  xƒ  R   J*  +£‹  ³  7¯‹   E   Ý  ê   ú    Ý  JE   E   Sz  F{  S  ¸‘  >&¯‹  ›R  ?0g³  r—  Ýå  >ŸÂ‹  ˆ³  {Œ  O³   j0  ?7{Œ  £³  {Œ  [³   l0  ?4[³  ¹³  Î‹   ßå  >›O³  Ï³  Î‹   ¦{  HS  7Höš  í»  7NŒ  ü³  åš  åš   O  7Råš  ´  ´   {’  s’  7Kåš  .´  .´   åš  p’  7‹˜‹  J´  u’   r’  7Ž˜‹  `´  `´   ñš  Ñ  7w´  |´  `´   Þ•  7{´  ’´  `´   æƒ  ž‹   †  æƒ  %†  Ô‹  _ˆ  %†  +¢  å|  N}  S}  D}  “}  D½}  Dß}  ó}  +~  ÅE  s~  ‹~  l  Ó~  ƒ›  	±B      -É  @H-É  ®š  Dµ  ®š  Â‹  )Œ   -É  @F-É  yŒ  hµ  yŒ  Â‹  )Œ   º  @Â‹  ƒµ  Î‹  Î‹   ±  @Œ˜‹  šµ  Â‹   Ìn  @O˜‹  ¶µ  ˜‹  Î‹   Ûñ  @’)Œ  Öµ  ˜‹  Î‹  )Œ      @Ï   Î‹  õµ  Î‹  Â‹      @Í   ˜‹  ¶  ˜‹  Â‹     @  Î‹  4¶  Î‹  Î‹     @  ˜‹  T¶  ˜‹  Î‹   ´æ  @ê´æ  Î‹  s¶  Î‹  Â‹   ´æ  @è´æ  ˜‹  ’¶  ˜‹  Â‹   ãñ  @7ãñ  Î‹  ²¶  Î‹  Î‹   ãñ  @5ãñ  ˜‹  Ò¶  ˜‹  Î‹   š  ?€  „¾ã  yŒ  MYm  #‚  €€€€x…="  /‚  ÿÿÿ`Pý  ü   ÿÿÿÿÿÿÿÿ0éÃ  •ˆ  &N¨I  Üˆ  4NUS  #‰  D0Ð’  j‰  @0·ƒ  ™‰  M¯  Ô‰  €€~N<5  à‰  ÿMN§  Š  €€€€€€€€€`wW  #Š  ÿÿÿÿÿÿÿ†L6  \             œ‡V/        I       œÔ·  8Ã²  0Â‹  ‘l8‘  0Â‹  ‘h ˆ˜ö  "Â‹  É      J      œk¸  8Dý  "
Â‹  ‘œ8Œý  "L  ‘O=      Â       Pi )Â‹  ‘¼OP      ¦       Q`)  *Î‹  ‘°Q”[  +k¸  ‘    +£‹  €¸  ‰¯‹  ‘¨ Š€?  €      I       œ¯¸  8`)  Î‹  ‘h ‹ó  [6  ¥      Û       œain Î‹  ‘Xaout #˜‹  ‘PQà¡  C˜  ‘oPn É‹  ‘dOÈ      µ       Pi Â‹  ‘h    I   I4  4 nG   :;9I?<l   .?:;9nI2<d   :;9  . ?:;9nI<   :;9I  	.?:;9nI2<d  
 :;9I8   I  .?:;9I<  & I  .?:;9nI<   I  .?:;9I<  . ?:;9nI<  .?:;9n2<d   :;9I?<  / I   :;9I2  / I  :;9  :;9  .?:;9n2<d  $ >  .?:;9nI<   :;9I  4 :;9I?<  .?:;9nI<d   :;9I?<l    .?:;9n<d  !.?:;9n<  " :;9  #/ I  $:;9  %.?:;9nI2<d  &.?:;9nI<d  '.?:;9nI<  (4 :;9nI?<  ) :;9I8  * <  +I  ,(   - :;9I?<l   . :;9I2  /   04 nG  1.?:;9<  2 I8  3.?:;9n<d  4: :;9  5<  6. ?:;9nI<  7! I/  8 :;9I  9 :;9I  :.?:;9n2<cd  ;.?:;9nI2<d  < :;9I?<l   =0 I  > :;9I?<l   ? :;9I?2<l   @.?:;9n2<‹d  A.?:;9nI2<‹d  B :;I8  C:;9n  D4 G  E.?:;9n<c‹d  F9 :;9‰  G :;9I?<l   H. ?:;9I<  I. ?:;9I<  JB I  K :;9I8  L <  M4 nG  N4 nG  O  P4 :;9I  Q4 :;9I  R9:;9‰  S:;9  T.?:;9n<cd  U9 :;9  V4 :;9nI?<
l   W9 :;9  X9:;9  Y>I:;9  Z(   [: :;9  \ :;9I?<  ]4 :;9nI?<
l   ^:;9  _ :;9I82  `4 nG  a :;9I  b%  c9:;  d :;9I?2<  e I8  f.?:;9nI2<cd  g.?:;9nI2<d  h.?:;9n‡<  i I82  j.?:;9n2<d  k9 :;9‰  l:;92  m.?:;9n<c‹d  n :;9  o4 :;9nI?<  p4 :;9I<  q:;9  r9:;9  s.?:;9nI<  t.?:;9n<  u:;9  v$ >  w:;  x   y:;9  z;   {&   |4 :;9I?<  }I  ~   .?:;9I<  €.?:;9‡<   :;9  ‚!   ƒ4 G  „4 I?4<  …4 nG  †. 4@–B  ‡.4@–B  ˆ.?:;9I@–B  ‰! I/  Š.:;9@–B  ‹.?:;9n@–B   {   ”  û      /usr/include/c++/8 /usr/include/c++/8/bits /usr/include/c++/8/debug /usr/include/x86_64-linux-gnu/c++/8/bits /usr/include/c++/8/ext /usr/include /usr/lib/gcc/x86_64-linux-gnu/8/include /usr/include/x86_64-linux-gnu/bits/types /usr/include/x86_64-linux-gnu/bits  hello.cc    iostream   basic_string.h   clocale   cwchar   type_traits   stl_pair.h   debug.h   char_traits.h   c++config.h   cstdint   exception_ptr.h   new   allocator.h   limits   string_view   cstdlib   cstdio   alloc_traits.h   initializer_list   cwctype   system_error   ios_base.h   ctime   stl_iterator_base_types.h   utility   uses_allocator.h   tuple   istream   iosfwd   cstring   ostream   predefined_ops.h   new_allocator.h   numeric_traits.h   alloc_traits.h   stl_iterator.h   locale.h   stddef.h   <built-in>    wint_t.h   __mbstate_t.h   mbstate_t.h   __FILE.h   struct_FILE.h   FILE.h   wchar.h   struct_tm.h   types.h 	  stdint-intn.h 	  stdint-uintn.h 	  stdint.h   time_t.h   clock_t.h   time.h   atomic_word.h   stdlib.h   __fpos_t.h   stdio.h   sys_errlist.h 	  errno.h   wctype-wchar.h 	  wctype.h   string.h     	¥      óKº= t	»t% J  ò ž!KòºÈiÈÈ< 0 ò ž y‚	@»)(!Au*g=:!¡ t¿ b<u%ºJS/à—<Ö ff)<J _ZNSt14numeric_limitsIsE7epsilonEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5emptyEv long long int _ZNSt14numeric_limitsIaE14is_specializedE _ZNSt14numeric_limitsIDsE7epsilonEv _ZNSt14numeric_limitsIcE10denorm_minEv _ZNSt14numeric_limitsIDiE5radixE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4findES2_m positive_sign _ZNSt14numeric_limitsIyE10denorm_minEv _ZNSt14numeric_limitsIxE9quiet_NaNEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4swapERS4_ gmtime mbstowcs _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE14_M_replace_auxEmmmc _ZNSt14numeric_limitsIiE17has_signaling_NaNE _ZNSt15__exception_ptr13exception_ptr9_M_addrefEv _ZNSt14numeric_limitsIbE13has_quiet_NaNE _ZNSt14numeric_limitsIiE12has_infinityE __pad5 _ZNKSt17basic_string_viewIcSt11char_traitsIcEE6rbeginEv strtoul _ZNKSt17basic_string_viewIwSt11char_traitsIwEE6substrEmm _ZNSt11char_traitsIwE7compareEPKwS2_m getwchar _ZNSt11char_traitsIDiE6assignERDiRKDi strerror __is_convertible_to_basic_ostream<std::basic_ostream<char, std::char_traits<char> >&> numeric_limits<wchar_t> _ZNSt10in_place_tC4Ev _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_S_copyEPcPKcm tmpfile _ZNSt14numeric_limitsIaE15has_denorm_lossE initializer_list _ZNSt14numeric_limitsIdE8infinityEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE16find_last_not_ofEPKDimm _ZSt5wcout _Value _ZNSt11char_traitsIwE6lengthEPKw _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_M_set_lengthEm shrink_to_fit _ZNKSt16initializer_listIcE4sizeEv _ZNKSt17basic_string_viewIwSt11char_traitsIwEE6rbeginEv strpbrk _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofEPKcmm _ZNSt14numeric_limitsIlE9is_signedE nothrow_t _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8max_sizeEv _ZNSt14numeric_limitsIwE10is_integerE _ZNSt14numeric_limitsIfE7epsilonEv _ZNSt14numeric_limitsIfE10has_denormE _ZNSt14numeric_limitsIlE10has_denormE _ZNSt11char_traitsIDiE12to_char_typeERKj _ZNSt11char_traitsIcE7not_eofERKi _ZNSt17basic_string_viewIwSt11char_traitsIwEEC4ERKS2_ _M_str _ZNSt14numeric_limitsIyE8is_exactE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE8_M_checkEmPKc _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4dataEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7crbeginEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofEPKcm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_M_disposeEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindEcm _ZNSt14numeric_limitsIfE12has_infinityE _ZNSt14numeric_limitsIiE10has_denormE _ZNSt11char_traitsIDsE4moveEPDsPKDsm crbegin _ZNSt14numeric_limitsIdE17has_signaling_NaNE _ZNSt11char_traitsIDiE11eq_int_typeERKjS2_ uintptr_t __normal_iterator _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_M_dataEv _ZNSt14numeric_limitsIyE13has_quiet_NaNE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4Ev _ZNSt14numeric_limitsIiE3minEv _ZNSt14numeric_limitsIDiE14max_exponent10E operator[] _ZSt4wcin c_str _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_S_moveEPcPKcm _ZNSt14numeric_limitsItE10is_integerE find_last_not_of _ZNSt14numeric_limitsIjE3maxEv _ZNSt11char_traitsIwE4findEPKwmRS1_ _ZNSt14numeric_limitsIDsE9is_iec559E __min _ZNSt14numeric_limitsIDiE10is_boundedE _ZNSt14numeric_limitsIbE8digits10E _ZNKSt17basic_string_viewIwSt11char_traitsIwEE8_M_limitEmm max_exponent ~basic_string _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofERKS4_m _ZNSt14numeric_limitsIsE12max_exponentE _ZNSt21__numeric_limits_base9is_signedE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcPKcS7_ _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4dataEv is_iec559 clock _ZNSt14numeric_limitsIDiE14is_specializedE _ZNSt14numeric_limitsIDsE11round_styleE _ZNSt14numeric_limitsIcE10has_denormE _ZNK9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEdeEv _ZNSt14numeric_limitsImE12min_exponentE _ZNSt14numeric_limitsIaE12max_exponentE _ZNSt14numeric_limitsIxE15tinyness_beforeE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5emptyEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE6cbeginEv _M_allocated_capacity char_traits<wchar_t> _ZNSt14numeric_limitsIdE9is_iec559E __sv_wrapper _ZNSt14numeric_limitsIsE8infinityEv __intmax_t _ZNK9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEixEl _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16_M_get_allocatorEv _ZNSt14numeric_limitsIsE12max_digits10E lconv _ZNSt14numeric_limitsIlE13has_quiet_NaNE _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEppEi _ZNSt14numeric_limitsItE3minEv _ZNSt14numeric_limitsIhE13has_quiet_NaNE _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEppEv _ZNSt14numeric_limitsImE12has_infinityE _ZNSt14numeric_limitsIDsE13has_quiet_NaNE _ZNKSt17integral_constantImLm0EEcvmEv _ZNSt14numeric_limitsItE5trapsE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE13find_first_ofES2_m __numeric_limits_base strchr _ZNSt17integral_constantImLm0EE5valueE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofEcm _ZNSt21__numeric_limits_base10is_integerE _ZNSt14numeric_limitsIsE6lowestEv _M_len _ZNSt14numeric_limitsIcE12min_exponentE _ZNSt14numeric_limitsIhE15has_denorm_lossE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofERKS4_m _CharT _ZNSt14numeric_limitsIxE7epsilonEv _ZNSt14numeric_limitsIhE10is_integerE tm_mday _ZNKSt15__exception_ptr13exception_ptr6_M_getEv _ZNSt33__is_convertible_to_basic_ostreamIRSoE5valueE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8_M_eraseEmm _ZNSt14numeric_limitsIDiE11round_errorEv _ZNSt14numeric_limitsIeE5radixE _ZNSt14numeric_limitsIDsE5radixE string_literals fseek _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE2atEm _ZNSt14numeric_limitsIsE14max_exponent10E tm_zone numeric_limits<char16_t> _ZNSt14numeric_limitsIhE14max_exponent10E _ZNSt14numeric_limitsIsE14is_specializedE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4cendEv wcsncat _ZNSt14numeric_limitsIeE10is_integerE _ZNSt14numeric_limitsIdE15has_denorm_lossE qsort _M_capacity _ZNSt14numeric_limitsIhE14is_specializedE long double _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEppEv is_modulo _ZNKSt17basic_string_viewIcSt11char_traitsIcEE13find_first_ofEPKcm _ZNSt14numeric_limitsIbE10is_integerE _ZNSt14numeric_limitsIiE15tinyness_beforeE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4backEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE13find_first_ofES2_m _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4findES2_m wcstold _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE17find_first_not_ofEPKDim denorm_indeterminate char_traits<char32_t> _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5rfindEPKDim _ZNSt14numeric_limitsIsE9is_iec559E _ZNSt11char_traitsIcE3eofEv _IO_wide_data _ZNSt14numeric_limitsItE8digits10E _M_mutate _ZNSt11char_traitsIwE6assignEPwmw fgetwc _ZNSt14numeric_limitsIyE5trapsE fgetws _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findEPKcmm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE16find_last_not_ofES2_m __cxx11 _ZNSt14numeric_limitsIeE9is_moduloE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSEPKc _ZNSt14numeric_limitsIlE8infinityEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE8max_sizeEv __debug basic_string_view const_reference _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7compareEmmS2_ _ZNSt15__exception_ptr13exception_ptrC4EDn _ZNSt14numeric_limitsIhE9is_moduloE _ZNSt14numeric_limitsIjE5radixE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7compareEmmS2_mm _ZNSt14numeric_limitsIbE3minEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6resizeEmc 5div_t _ZNSt17basic_string_viewIDiSt11char_traitsIDiEEC4EPKDi float_round_style _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5emptyEv _ZNSt14numeric_limitsIxE10is_boundedE _ZNSt14numeric_limitsIdE6digitsE numeric_limits<long double> _ZNSt14numeric_limitsIyE9quiet_NaNEv _ZNSt14numeric_limitsIcE3maxEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE12find_last_ofEPKDsm _ZNSt14numeric_limitsIdE11round_errorEv __numeric_traits_floating<float> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_NS6_IPcS4_EESB_ __uint_least32_t basic_ostream<char, std::char_traits<char> > _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4rendEv _ZNSt14numeric_limitsIdE8is_exactE _ZNSt14numeric_limitsIeE12has_infinityE _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEC4Ev _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE13find_first_ofEPKDsmm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLESt16initializer_listIcE has_signaling_NaN _ZN9__gnu_cxx24__numeric_traits_integerIiE5__maxE _S_synced_with_stdio _ZNSt14numeric_limitsImE3minEv _ZNSt14numeric_limitsIjE15tinyness_beforeE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_mutateEmmPKcm _ZNSt14numeric_limitsIDiE12min_exponentE allocator_traits<std::allocator<char> > _S_compare _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofEcm _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5rfindEDsm tm_min currency_symbol fwide atof _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEixEm atoi atol _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE11_M_disjunctEPKc _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignESt16initializer_listIcE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofEPKcmm _ZN9__gnu_cxx14__alloc_traitsISaIcEcE10_S_on_swapERS1_S3_ _ZNSt14numeric_limitsIcE5trapsE _ZNSt14numeric_limitsIlE9is_iec559E _unused2 _ZNSt14numeric_limitsIcE13signaling_NaNEv _ZNSt14numeric_limitsIDiE12has_infinityE size_t _ZNSt14numeric_limitsIcE6lowestEv _ZN9__gnu_cxx14__alloc_traitsISaIcEcE27_S_propagate_on_move_assignEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4rendEv _ZNSt14numeric_limitsIlE10is_boundedE operator bool _ZNKSt17basic_string_viewIwSt11char_traitsIwEE12find_last_ofEPKwmm _ZNSt14numeric_limitsIeE8infinityEv find_first_of _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17_S_to_string_viewESt17basic_string_viewIcS2_E nullptr_t pop_back _ZNSt14numeric_limitsIiE10is_boundedE _ZNSt11char_traitsIDiE6assignEPDimDi _ZNSt14numeric_limitsIwE9is_moduloE _ZNSt14numeric_limitsIxE3minEv cbegin _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4dataEv wcspbrk _ZNSt14numeric_limitsItE15has_denorm_lossE find_first_not_of _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16_M_get_allocatorEv program_invocation_name _mode _ZN9__gnu_cxx13new_allocatorIcEC4Ev _ZNSt14numeric_limitsIbE7epsilonEv _ZNSt14numeric_limitsIyE3maxEv _ZNSt14numeric_limitsIiE12max_exponentE _ZNSt11char_traitsIDiE3eofEv _ZNSt14numeric_limitsIyE11round_errorEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4findEPKDim wcstombs _ZNKSt15__exception_ptr13exception_ptrcvbEv _ZNSt14numeric_limitsItE13has_quiet_NaNE _ZNSt14numeric_limitsIaE9is_moduloE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7compareEmmS2_mm _ZNSt14numeric_limitsIfE10is_boundedE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE18_M_construct_aux_2Emc _ZNKSt17integral_constantIbLb0EEcvbEv _ZNSt14numeric_limitsIyE8digits10E _ZNSt14numeric_limitsIlE15tinyness_beforeE _ZNSt14numeric_limitsIdE14max_exponent10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_mc _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7compareEmmS2_ _ZNSt14numeric_limitsIyE6digitsE _ZNSt11char_traitsIDsE11eq_int_typeERKtS2_ _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE6rbeginEv _ZNSt14numeric_limitsIhE11round_errorEv _ZNSt14numeric_limitsIdE11round_styleE _ZNSt14numeric_limitsIhE5trapsE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_St16initializer_listIcE int_p_sign_posn quot _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7crbeginEv __wchb _ZNSt14numeric_limitsIhE9quiet_NaNEv _ZNSt14numeric_limitsIcE7epsilonEv _ZNSt11char_traitsIcE4copyEPcPKcm _ZNSt14numeric_limitsIyE11round_styleE stderr __static_initialization_and_destruction_0 _ZNSt14numeric_limitsIfE11round_styleE _ZNSt17integral_constantIbLb0EE5valueE _ZNSt21__numeric_limits_base8is_exactE _ZNSt14numeric_limitsIlE8digits10E _ZNSt14numeric_limitsIfE14min_exponent10E tm_mon _ZNSt14numeric_limitsIaE6digitsE towctrans _ZNSt11char_traitsIDsE2eqERKDsS2_ _ZNSt14numeric_limitsItE5radixE _ZNSt17basic_string_viewIcSt11char_traitsIcEEC4Ev _ZNSt14numeric_limitsIjE14min_exponent10E _ZNSt14numeric_limitsIxE14max_exponent10E _ZNSt14numeric_limitsIhE11round_styleE _ZNSt14numeric_limitsIcE13has_quiet_NaNE _ZNSt14numeric_limitsIdE12has_infinityE _ZNSt14numeric_limitsImE17has_signaling_NaNE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE13find_first_ofES2_m _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindEPKcm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13shrink_to_fitEv _ZNSt14numeric_limitsIeE9is_iec559E _ZNSt14numeric_limitsItE8infinityEv _M_array _M_p _ZNSt14numeric_limitsIjE11round_styleE _ZNSt14numeric_limitsIDsE6digitsE _ZNSt14numeric_limitsIDiE9is_moduloE _ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEplEl __ops _ZNSt14numeric_limitsIiE8is_exactE uint_fast16_t __is_convertible_to_basic_ostream_impl<std::basic_ostream<char, std::char_traits<char> >&, void> rebind_alloc _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5emptyEv __uint8_t _ZNSt14numeric_limitsIDiE8is_exactE tm_hour _ZNSt17basic_string_viewIcSt11char_traitsIcEE4nposE _ZNSt14numeric_limitsIlE11round_styleE _ZN9__gnu_cxx24__numeric_traits_integerIsE5__maxE __numeric_traits_integer<char> string_view_literals _ZNSt11char_traitsIcE4moveEPcPKcm _ZSt6ignore _M_check _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5eraseEN9__gnu_cxx17__normal_iteratorIPKcS4_EE _vtable_offset _GLOBAL__sub_I__Z11upcaseWordsPKcPc basic_ostream<wchar_t, std::char_traits<wchar_t> > round_toward_infinity system _ZNSt14numeric_limitsIfE3minEv _ZNSt14numeric_limitsIDsE17has_signaling_NaNE _ZNSt14numeric_limitsIiE14min_exponent10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSERKS4_ _ZNSt15__exception_ptr13exception_ptrC4EPv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE12find_last_ofEDsm _ZN9__gnu_cxx14__alloc_traitsISaIcEcE15_S_always_equalEv _ZNSt14numeric_limitsIjE12max_exponentE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE17find_first_not_ofES2_m _ZNSt14numeric_limitsImE5trapsE _ZNSt14numeric_limitsImE12max_exponentE _ZNSt14numeric_limitsIhE17has_signaling_NaNE _ZNSt14numeric_limitsIwE12max_digits10E _ZNSt14numeric_limitsIyE12min_exponentE _ZNSt14numeric_limitsImE6lowestEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5crendEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE2atEm __numeric_traits_integer<int> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmRKS4_mm denorm_min _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE8_M_limitEmm mbtowc _ZNSt14numeric_limitsIjE13signaling_NaNEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE6cbeginEv tm_yday _ZNSt14numeric_limitsItE9is_iec559E __numeric_traits_integer<long int> _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4sizeEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7compareEmmPKDsm _ZNSt14numeric_limitsIhE12min_exponentE _ZNSt14numeric_limitsIyE12has_infinityE fopen _ZNSt14numeric_limitsIlE11round_errorEv _M_release _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendERKS4_ wcscoll numeric_limits<short unsigned int> _ZNSt14numeric_limitsIhE9is_signedE _ZNSt14numeric_limitsIfE12max_digits10E _ZNSt14numeric_limitsImE8infinityEv _ZNSt14numeric_limitsIjE15has_denorm_lossE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE17find_first_not_ofEwm _ZNSt14numeric_limitsIsE10is_boundedE _ZNSt17basic_string_viewIcSt11char_traitsIcEE13remove_prefixEm _ZNSt14numeric_limitsIcE17has_signaling_NaNE _ZNSt14numeric_limitsIiE13has_quiet_NaNE _ZNSt17basic_string_viewIcSt11char_traitsIcEE10_S_compareEmm _S_copy __timezone _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE16find_last_not_ofEPKDim _flags _ZNSt14numeric_limitsIhE7epsilonEv _ZNSt14numeric_limitsIhE12has_infinityE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5emptyEv sayHello wcsspn _ZNSt14numeric_limitsIiE9is_moduloE ungetwc _S_assign _ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE4baseEv _ZNSt21__numeric_limits_base12min_exponentE _ZNSt11char_traitsIwE2ltERKwS2_ _ZNSt17basic_string_viewIDiSt11char_traitsIDiEE10_S_compareEmm _IO_backup_base _ZNSt14numeric_limitsIDiE10denorm_minEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE8_M_checkEmPKc _ZNSt14numeric_limitsIDiE3minEv _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmmEv at_quick_exit ~new_allocator _ZNSt14numeric_limitsIcE5radixE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE16find_last_not_ofEPKcmm __is_convertible_to_basic_istream<std::basic_istream<wchar_t, std::char_traits<wchar_t> >&> _ZNSt14numeric_limitsIDsE10is_integerE const_void_pointer 11__mbstate_t __daylight _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5rfindES2_m _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7crbeginEv _ZNSt14numeric_limitsIDiE17has_signaling_NaNE _ZNSt14numeric_limitsImE14min_exponent10E _ZNSt21__numeric_limits_base12has_infinityE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6rbeginEv operator std::integral_constant<long unsigned int, 0>::value_type basic_string<char, std::char_traits<char>, std::allocator<char> > _ZNSt14numeric_limitsIhE6digitsE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE12find_last_ofEPKDimm _ZNSt11char_traitsIDsE4findEPKDsmRS1_ _ZNSt14numeric_limitsIwE9is_signedE _sys_errlist int_n_sep_by_space _ZNKSt17integral_constantIbLb1EEclEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5crendEv _ZNSt33__is_convertible_to_basic_istreamIRSiE5valueE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE15_M_check_lengthEmmPKc _ZNSt14numeric_limitsIbE15tinyness_beforeE stdin _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5frontEv _ZNSt16allocator_traitsISaIcEE8allocateERS0_m _ZN9__gnu_cxx14__alloc_traitsISaIcEcE17_S_select_on_copyERKS1_ _ZNSt14numeric_limitsIdE8digits10E _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE17find_first_not_ofEDim numeric_limits<long unsigned int> _ZNSt14numeric_limitsIbE14min_exponent10E _ZNSt14numeric_limitsImE9is_iec559E _IO_read_end push_back __max_digits10 wcsstr ungetc _ZNSt14numeric_limitsIwE5trapsE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE16find_last_not_ofEPKDsm _ZNSt14numeric_limitsIxE9is_moduloE _Swallow_assign _ZNSt14numeric_limitsIjE12max_digits10E _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7compareEmmS2_mm _IO_save_base npos round_toward_neg_infinity _ZNSt14numeric_limitsIlE12min_exponentE _ZNSt14numeric_limitsIaE8is_exactE _ZN9__gnu_cxx25__numeric_traits_floatingIdE16__max_exponent10E _ZNSt14numeric_limitsIiE9quiet_NaNEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4dataEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4findEDsm _ZNSt14numeric_limitsIDiE12max_exponentE _ZNSt14numeric_limitsIbE9is_moduloE _ZNSt14numeric_limitsIDiE11round_styleE _ZNSt11char_traitsIcE6lengthEPKc ios_base _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7compareES2_ mon_thousands_sep _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEcvSt17basic_string_viewIcS2_EEv _ZNSt14numeric_limitsIhE5radixE _ZNSt14numeric_limitsIcE6digitsE _ZNSt14numeric_limitsIDsE12max_digits10E _ZNSt14numeric_limitsIwE6lowestEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEEixEm __numeric_traits_integer<short int> round_indeterminate _ZNSt14numeric_limitsIlE12has_infinityE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE16find_last_not_ofEDsm _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE6substrEmm difference_type _ZNSt14numeric_limitsIDsE10denorm_minEv _ZNSt21piecewise_construct_tC4Ev _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE13find_first_ofEPKDsm _M_length _ZNSt14numeric_limitsIfE14max_exponent10E wcrtomb _ZNSt14numeric_limitsIDsE14max_exponent10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_mm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE12find_last_ofEPKcm _ZNSt16allocator_traitsISaIcEE8allocateERS0_mPKv to_char_type _ZNSt14numeric_limitsIDsE14is_specializedE _ZNSt14numeric_limitsIDiE9is_signedE _ZNSt14numeric_limitsIjE3minEv _IO_buf_base _ZNSt14numeric_limitsImE15has_denorm_lossE _ZNSt14numeric_limitsIDiE6digitsE _ZNSt14numeric_limitsIaE14min_exponent10E __uint16_t fsetpos _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5frontEv is_exact _ZNSt14numeric_limitsIDiE13has_quiet_NaNE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_Alloc_hiderC4EPcRKS3_ _ZNSt14numeric_limitsImE7epsilonEv _ZNSt14numeric_limitsIfE13signaling_NaNEv _ZNSaIcED4Ev _ZNKSt17integral_constantIbLb1EEcvbEv _ZNSt11char_traitsIwE7not_eofERKj _ZNSt21__numeric_limits_base8digits10E _ZNSt14numeric_limitsIcE15tinyness_beforeE _ZNSt14numeric_limitsIfE9is_iec559E _ZNSt16allocator_traitsISaIcEE10deallocateERS0_Pcm _ZSt5wclog fread _ZNSt14numeric_limitsIaE5trapsE numeric_limits<signed char> allocator_type freopen _M_get wctrans_t _M_dispose mbrlen _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5crendEv 6ldiv_t _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEpLEl _ZN9__gnu_cxx25__numeric_traits_floatingIeE16__max_exponent10E __ioinit _ZNSt17basic_string_viewIDiSt11char_traitsIDiEEC4EPKDim _ZNSt14numeric_limitsImE5radixE _ZNSt14numeric_limitsIwE10has_denormE _ZNSt17basic_string_viewIDiSt11char_traitsIDiEE4nposE _ZNSt14numeric_limitsIsE8is_exactE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4findEcm _ZSt4cout vwprintf rethrow_exception _ZNSt14numeric_limitsIDsE8is_exactE _ZNSt14numeric_limitsIDiE8digits10E _ZNSt14numeric_limitsItE10has_denormE _IO_marker _ZNSt14numeric_limitsIdE12max_exponentE _ZNSt14numeric_limitsItE11round_errorEv _ZNSt21__numeric_limits_base6digitsE _ZNSt17basic_string_viewIwSt11char_traitsIwEEC4EPKw cend _ZNSt17basic_string_viewIDsSt11char_traitsIDsEEC4ERKS2_ _ZNSt14numeric_limitsIiE8digits10E _ZNSt14numeric_limitsIcE14min_exponent10E _ZNSt11char_traitsIDiE4copyEPDiPKDim _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7reserveEm const_reverse_iterator _ZNSt17basic_string_viewIDsSt11char_traitsIDsEEC4EPKDsm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_M_local_dataEv _ZN9__gnu_cxx24__numeric_traits_integerIlE5__maxE _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEppEi _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendESt16initializer_listIcE _ZNSt14numeric_limitsIcE11round_errorEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE6rbeginEv integral_constant<bool, true> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_S_compareEmm _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEC4Ev _ZNSt21__numeric_limits_base10is_boundedE _ZNKSt17integral_constantIbLb0EEclEv _ZNSt21__numeric_limits_base10has_denormE wcscat _ZNSt14numeric_limitsIfE8is_exactE _IO_lock_t _ZNSt14numeric_limitsIdE13has_quiet_NaNE _ZNSt14numeric_limitsIlE5radixE deallocate numeric_limits<long long int> _IO_read_ptr _ZNSt14numeric_limitsIfE5trapsE __float128 _ZNSt14numeric_limitsIyE10is_integerE _S_to_string_view _ZNSt14numeric_limitsIjE6lowestEv _ZNSt14numeric_limitsIiE9is_signedE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7compareEmmPKDs friendlyName _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofEcm _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE12find_last_ofEPKDim _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4rendEv _flags2 _ZNSt11char_traitsIwE6assignERwRKw rewind _ZNSt14numeric_limitsIhE10has_denormE remove_prefix _ZNKSt17integral_constantImLm2EEclEv __uint_least64_t _ZNSt14numeric_limitsIeE10has_denormE _ZNSt14numeric_limitsItE6lowestEv __cxa_exception_type _ZNSt21__numeric_limits_base5trapsE _Alloc_hider _IO_write_ptr _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofEPKcmm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S8_S8_ _ZNSt11char_traitsIDsE6assignEPDsmDs _ZNKSt17basic_string_viewIwSt11char_traitsIwEE16find_last_not_ofEwm _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE17find_first_not_ofEPKDsm _ZNSt15__exception_ptr13exception_ptraSERKS0_ _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE11_M_capacityEm _ZNSt14numeric_limitsIsE10is_integerE _ZNSt14numeric_limitsIaE9quiet_NaNEv _ZNSt14numeric_limitsIbE10has_denormE _ZNSt14numeric_limitsIyE12max_exponentE numeric_limits<int> numeric_limits<long int> _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5frontEv reverse_iterator<char32_t const*> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5frontEv fgetpos numeric_limits<bool> _ZNSt14numeric_limitsIdE3maxEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE17find_first_not_ofEcm _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4findES2_m _ZNSt14numeric_limitsIcE3minEv basic_string_view<wchar_t, std::char_traits<wchar_t> > reverse_iterator<char16_t const*> _ZN9__gnu_cxx13new_allocatorIcE8allocateEmPKv _ZNSt14numeric_limitsImE10is_integerE _ZNSt14numeric_limitsIhE12max_exponentE _ZNSt14numeric_limitsIcE15has_denorm_lossE _ZNSt14numeric_limitsIxE11round_errorEv _ZNSt14numeric_limitsIsE9is_moduloE _ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmiEl _ZNSt14numeric_limitsIlE17has_signaling_NaNE _ZNSt14numeric_limitsIxE13signaling_NaNEv _ZNSt14numeric_limitsItE12min_exponentE _ZNSt14numeric_limitsIhE15tinyness_beforeE _ZNSt14numeric_limitsIbE12max_exponentE _ZNSt21__numeric_limits_base14min_exponent10E _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5rfindEPKDsmm _ZNSt14numeric_limitsIeE7epsilonEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE17find_first_not_ofEDsm _ZNSt14numeric_limitsIjE9quiet_NaNEv traps decltype(nullptr) _ZNSt14numeric_limitsIjE10is_integerE _ZNSt14numeric_limitsIeE6digitsE _ZNSt14numeric_limitsIxE8is_exactE _ZNSt16initializer_listIcEC4EPKcm __int8_t _ZNSt14numeric_limitsIwE5radixE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findERKS4_m has_denorm_loss _ZNKSt16initializer_listIcE5beginEv _ZNSt17basic_string_viewIDiSt11char_traitsIDiEEC4ERKS2_ _ZNSt14numeric_limitsItE12has_infinityE _ZNSt14numeric_limitsImE13signaling_NaNEv _ZNSt14numeric_limitsIjE13has_quiet_NaNE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5crendEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE6substrEmm _ZNSt21__numeric_limits_base9is_iec559E _M_local_buf _ZNSt14numeric_limitsIbE13signaling_NaNEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5rfindEPKDimm _ZNSt14numeric_limitsIaE12max_digits10E _ZNSt14numeric_limitsIdE10is_integerE wcschr _ZNSt14numeric_limitsIbE9is_signedE _ZNSt21__numeric_limits_base12max_exponentE _ZNSt14numeric_limitsIbE10denorm_minEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE2atEm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEN9__gnu_cxx17__normal_iteratorIPcS4_EESt16initializer_listIcE const_pointer _ZNSt14numeric_limitsIaE10is_integerE _ZNSt14numeric_limitsIsE5radixE _ZNSt14numeric_limitsIyE9is_moduloE _ZNSt17basic_string_viewIcSt11char_traitsIcEEaSERKS2_ _ZNSt14numeric_limitsIxE6digitsE _ZNSt11char_traitsIDsE2ltERKDsS2_ _ZNSt14numeric_limitsIlE6digitsE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8capacityEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE17find_first_not_ofEPKcm _ZNSt14numeric_limitsIdE10denorm_minEv _ZNK9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE4baseEv _ZNSt14numeric_limitsIcE12has_infinityE _ZNSt33__is_convertible_to_basic_istreamIRSt13basic_istreamIwSt11char_traitsIwEEE5valueE _ZNSt14numeric_limitsIyE3minEv _ZNSt14numeric_limitsIaE8digits10E _M_addref _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_RKS4_ uint_fast8_t _lock _ZNSt21__numeric_limits_base13has_quiet_NaNE _ZN9__gnu_cxx24__numeric_traits_integerIiE5__minE _ZNSt14numeric_limitsIcE9is_moduloE _ZNSt14numeric_limitsIyE14max_exponent10E _ZNSt14numeric_limitsIfE10denorm_minEv _ZNSt14numeric_limitsIsE9quiet_NaNEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6resizeEm wistream strtod strtof _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignERKS4_mm round_error strtok strtol __int_least16_t _ZNSt11char_traitsIcE7compareEPKcS2_m _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6cbeginEv _ZNSt14numeric_limitsIsE6digitsE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findEPKcm _ZNSt14numeric_limitsIhE10denorm_minEv reserve uint_fast32_t _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5beginEv _ZNSt14numeric_limitsIcE14max_exponent10E __exception_ptr wcsxfrm _ZNKSt17basic_string_viewIwSt11char_traitsIwEE16find_last_not_ofEPKwm _M_data _ZNSt14numeric_limitsIbE17has_signaling_NaNE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4cendEv _ZNSt14numeric_limitsIyE14is_specializedE _ZNSt14numeric_limitsIaE5radixE _ZNSt14numeric_limitsIfE8digits10E _ZNSt14numeric_limitsIwE15has_denorm_lossE _IO_buf_end _ZNSt14numeric_limitsIjE10denorm_minEv _ZNSt14numeric_limitsIdE7epsilonEv short unsigned int _ZNSt14numeric_limitsIxE12min_exponentE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4dataEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE3endEv __swappable_with_details wcstoll _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5rfindEPKwm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE17find_first_not_ofEPKcmm _ZNSt14numeric_limitsIdE6lowestEv reverse_iterator<wchar_t const*> wcsrtombs _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE16find_last_not_ofEDim _ZNSt14numeric_limitsIcE14is_specializedE lldiv _ZNSt14numeric_limitsIlE10denorm_minEv _ZNSt14numeric_limitsIeE14min_exponent10E wcscmp _ZNSt14numeric_limitsIDiE15tinyness_beforeE __int16_t _ZNSt14numeric_limitsIwE10is_boundedE _ZNSt14numeric_limitsIwE7epsilonEv wcscspn _IO_codecvt _IO_read_base _ZNSt21__numeric_limits_base11round_styleE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5crendEv _ZNSt14numeric_limitsIwE11round_styleE _ZNSt14numeric_limitsItE10is_boundedE _ZNSt14numeric_limitsIsE15has_denorm_lossE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5frontEv is_bounded radix _ZNKSt16initializer_listIcE3endEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4backEv _ZNKSt17basic_string_viewIwSt11char_traitsIwEE8_M_checkEmPKc _ZNSt14numeric_limitsIfE15has_denorm_lossE _ZNSt17integral_constantIbLb1EE5valueE _ZNSt14numeric_limitsIxE12has_infinityE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4sizeEv _ZNSt14numeric_limitsIdE10is_boundedE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7compareEmmS2_mm __wch _ZNSt14numeric_limitsIjE7epsilonEv address _S_move _ZNSt14numeric_limitsIeE12max_digits10E _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4rendEv _ZNSt11char_traitsIDiE7not_eofERKj _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7compareES2_ __FILE __uintmax_t _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_PcSA_ _ZNSt14numeric_limitsIDsE8digits10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendEPKc _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4copyEPcmm _ZNKSt17basic_string_viewIwSt11char_traitsIwEE12find_last_ofEPKwm wcscpy __value _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmRKS4_ _ZNSt14numeric_limitsIfE5radixE _ZNSt14numeric_limitsIsE8digits10E _ZNSt14numeric_limitsItE10denorm_minEv _shortbuf _M_exception_object remove_suffix wctob _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE2atEm _ZNSt14numeric_limitsIhE3maxEv _ZNSt14numeric_limitsIwE17has_signaling_NaNE __numeric_traits_integer<long unsigned int> fflush _ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5rfindEPKcm _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5beginEv _ZNSt14numeric_limitsItE13signaling_NaNEv _ZNSt14numeric_limitsIbE9quiet_NaNEv float _IO_write_end _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EPKcmRKS3_ __const_iterator __count unsigned char _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4backEv _ZNSt14numeric_limitsIiE13signaling_NaNEv _ZNSt14numeric_limitsIeE10is_boundedE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE17find_first_not_ofEPKDimm _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4findES2_m _ZNSt17basic_string_viewIcSt11char_traitsIcEE13remove_suffixEm operator std::integral_constant<long unsigned int, 2>::value_type _ZNSt17basic_string_viewIDsSt11char_traitsIDsEE13remove_suffixEm _ZNSt14numeric_limitsIjE9is_signedE _ZNSt14numeric_limitsIbE10is_boundedE __priority int_p_sep_by_space _ZN9__gnu_cxx24__numeric_traits_integerIsE5__minE type_info _ZNSt11char_traitsIDiE4findEPKDimRS1_ _ZNSt14numeric_limitsIxE10denorm_minEv feof _ZNKSt17basic_string_viewIcSt11char_traitsIcEE12find_last_ofEPKcmm rename _ZNK9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEplEl int_curr_symbol mbsinit _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_mRKS3_ _ZNSt17basic_string_viewIwSt11char_traitsIwEE13remove_suffixEm _ZNSt11char_traitsIwE11to_int_typeERKw _ZNSt16allocator_traitsISaIcEE37select_on_container_copy_constructionERKS0_ numeric_limits<char32_t> _ZNSt11char_traitsIwE11eq_int_typeERKjS2_ _ZSt5wcerr _ZNSt17basic_string_viewIDsSt11char_traitsIDsEEC4EPKDs _ZNSt14numeric_limitsIyE5radixE _ZNSt14numeric_limitsIcE8is_exactE _ZNSt14numeric_limitsIsE3maxEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5frontEv _ZNSt14numeric_limitsIDsE5trapsE _M_sv wmemset _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE2atEm _ZNSt21__numeric_limits_base15tinyness_beforeE wcsftime _ZN9__gnu_cxx24__numeric_traits_integerIcE5__maxE __fpos_t _ZN9__gnu_cxx13new_allocatorIcE10deallocateEPcm setlocale _ZNSt14numeric_limitsIyE6lowestEv epsilon clearerr wcstoul _ZNSt14numeric_limitsIiE12max_digits10E denorm_present _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLEc _ZNSt14numeric_limitsIsE15tinyness_beforeE _S_nothrow_move _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmIEl _ZNKSt17basic_string_viewIcSt11char_traitsIcEE8_M_checkEmPKc _ZNSt14numeric_limitsIaE6lowestEv vswscanf __off_t _ZNSt14numeric_limitsIbE12max_digits10E _M_disjunct _ZNSt8ios_base4InitD4Ev _ZNSt14numeric_limitsIjE14max_exponent10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEPKc ~Init _ZNSt14numeric_limitsIwE14min_exponent10E remove _ZNKSt17basic_string_viewIcSt11char_traitsIcEE6lengthEv _ZNKSt17basic_string_viewIwSt11char_traitsIwEE6lengthEv _ZNSt14numeric_limitsIjE14is_specializedE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4findEPKDsmm _ZNSt14numeric_limitsIeE13has_quiet_NaNE _ZNSt14numeric_limitsIlE14min_exponent10E _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4findEPKDimm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S9_S9_ basic_string_view<char32_t, std::char_traits<char32_t> > min_exponent10 _ZNSt14numeric_limitsIbE6digitsE _ZNKSt17integral_constantImLm0EEclEv _ZNSt14numeric_limitsIiE15has_denorm_lossE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_M_replaceEmmPKcm _M_replace_aux _ZSt13allocator_arg basic_string_view<char16_t, std::char_traits<char16_t> > _ZNSt14numeric_limitsIdE5trapsE _ZNSt14numeric_limitsIyE9is_signedE vswprintf _ZNSt14numeric_limitsIcE9is_signedE _ZNSt14numeric_limitsItE9quiet_NaNEv _ZNSt11char_traitsIDsE6assignERDsRKDs _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5beginEv _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmmEi clear _ZNKSt17basic_string_viewIwSt11char_traitsIwEE8max_sizeEv _ZNSt14numeric_limitsIDsE9is_moduloE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7crbeginEv _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmmEv _ZNSt14numeric_limitsIxE8digits10E _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmPKcm _S_select_on_copy _ZNSt14numeric_limitsIaE15tinyness_beforeE _ZNSt14numeric_limitsIiE6digitsE int_n_sign_posn _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7compareEPKc _ZNSt14numeric_limitsIhE8infinityEv __clock_t _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S8_m _ZNKSt17basic_string_viewIwSt11char_traitsIwEE3endEv fp_offset _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5beginEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_mmRKS3_ __uint32_t _ZNSt14numeric_limitsItE12max_exponentE _ZNSt14numeric_limitsIDsE10has_denormE __max_exponent10 atoll not_eof _ZSt19piecewise_construct _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_lengthEm _ZNSt14numeric_limitsIDsE15tinyness_beforeE numeric_limits<double> _ZNSt14numeric_limitsIaE3maxEv getdate_err is_integer _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4sizeEv mktime _ZNSt14numeric_limitsIdE9is_moduloE __is_signed allocator_arg_t _ZNSt14numeric_limitsIsE11round_errorEv fgetc _M_destroy operator std::__cxx11::basic_string<char>::__sv_type _M_construct fgets _ZNSt14numeric_limitsIeE6lowestEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findEcm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEmc wctype_t _ZNSt11char_traitsIwE2eqERKwS2_ _ZNKSt17basic_string_viewIwSt11char_traitsIwEE16find_last_not_ofEPKwmm _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE16find_last_not_ofES2_m asctime _ZNSt15__exception_ptr13exception_ptr4swapERS0_ _ZNSt14numeric_limitsIcE12max_exponentE _ZN9__gnu_cxx24__numeric_traits_integerImE8__digitsE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4findEPKcm _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEC4ERKS2_ _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofEcm tinyness_before _ZNSt14numeric_limitsIiE5trapsE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSEc _ZNSt14numeric_limitsIhE8is_exactE _ZNSt14numeric_limitsIlE3maxEv substr _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmmEi _ZNSt11char_traitsIDiE6lengthEPKDi _ZNSt11char_traitsIDsE4copyEPDsPKDsm _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE12find_last_ofES2_m _ZNSt14numeric_limitsIwE6digitsE _ZNSt14numeric_limitsIDiE14min_exponent10E negative_sign localtime _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4findEPKwmm _ZNSt14numeric_limitsIbE11round_errorEv resize _old_offset _ZNSt14numeric_limitsIeE13signaling_NaNEv getenv _ZNSt11char_traitsIwE3eofEv mbsrtowcs integral_constant<long unsigned int, 0> _G_fpos_t __is_convertible_to_basic_istream<std::basic_istream<char, std::char_traits<char> >&> wcsncpy __state _ZNSt14numeric_limitsIfE9is_signedE _ZNSt14numeric_limitsIfE13has_quiet_NaNE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcN9__gnu_cxx17__normal_iteratorIS5_S4_EES8_ _ZNSt14numeric_limitsIhE9is_iec559E _ZNSt14numeric_limitsIwE8infinityEv _ZNSaIcEC4Ev _ZNSt11char_traitsIcE2ltERKcS2_ _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofEPKcm _ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEptEv piecewise_construct_t __gnu_debug _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS3_ _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindERKS4_m _M_assign _ZNSt14numeric_limitsIcE9quiet_NaNEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S8_ _M_dataplus _ZNSt14numeric_limitsIyE15has_denorm_lossE _ZNSt14numeric_limitsIxE6lowestEv char16_t _ZNSt14numeric_limitsIaE8infinityEv _ZNSt14numeric_limitsIwE3maxEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmPKcm _IO_save_end _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEixEm integral_constant<long unsigned int, 2> operator() _ZNSt14numeric_limitsItE7epsilonEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_ _ZNKSt17integral_constantImLm2EEcvmEv _ZN9__gnu_cxx13new_allocatorIcEC4ERKS1_ __normal_iterator<char const*, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > min_exponent _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEEixEm _ZNSt14numeric_limitsIDiE10is_integerE _ZNSt14numeric_limitsIlE15has_denorm_lossE _ZNSt14numeric_limitsIxE12max_exponentE _ZNSt11char_traitsIDsE7not_eofERKt _ZNSt17basic_string_viewIDsSt11char_traitsIDsEE13remove_prefixEm _ZNSt17basic_string_viewIwSt11char_traitsIwEEaSERKS2_ _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4rendEv _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEpLEl _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE16find_last_not_ofES2_m _ZNSt14numeric_limitsIfE17has_signaling_NaNE _M_string_length has_quiet_NaN _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8pop_backEv putwchar _ZNSt14numeric_limitsIsE12min_exponentE _ZNSt14numeric_limitsIsE14min_exponent10E _ZNSt17basic_string_viewIwSt11char_traitsIwEE13remove_prefixEm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4copyEPcmm _ZNSt14numeric_limitsIdE15tinyness_beforeE round_toward_zero _ZNSt14numeric_limitsIwE11round_errorEv _ZNSt17basic_string_viewIwSt11char_traitsIwEEC4EPKwm _ZNSt21__numeric_limits_base17has_signaling_NaNE _ZNSt14numeric_limitsIfE14is_specializedE _ZNSt14numeric_limitsIhE14min_exponent10E ~allocator _ZNSt14numeric_limitsIwE9is_iec559E __swappable_details inWord operator++ _ZNSt14numeric_limitsIlE9quiet_NaNEv _M_erase operator+= _ZNSt17integral_constantImLm2EE5valueE _ZNSt15__exception_ptr13exception_ptrD4Ev _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5beginEv __is_convertible_to_basic_istream_impl<std::basic_istream<char, std::char_traits<char> >&, void> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9push_backEc wchar_t _ZNSt14numeric_limitsIDiE8infinityEv _ZSt4clog _Alloc _ZNSt11char_traitsIDsE7compareEPKDsS2_m _ZNSt14numeric_limitsIfE11round_errorEv _S_always_equal _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5rfindEPKcmm _ZNSt14numeric_limitsIaE9is_iec559E vfwscanf _ZNKSt17basic_string_viewIwSt11char_traitsIwEE17find_first_not_ofEPKwmm __numeric_traits_floating<long double> wcstoull _ZNSt14numeric_limitsIbE12min_exponentE tm_isdst _ZNSt14numeric_limitsIsE12has_infinityE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE3endEv reverse_iterator<__gnu_cxx::__normal_iterator<char const*, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > > _ZNSt14numeric_limitsIaE17has_signaling_NaNE _ZNSt14numeric_limitsIDiE9quiet_NaNEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendEmc __is_convertible_to_basic_istream_impl<std::basic_istream<wchar_t, std::char_traits<wchar_t> >&, void> _ZNSt15__exception_ptr13exception_ptrC4EOS0_ operator-- _ZNSt14numeric_limitsImE8is_exactE _ZN9__gnu_cxx24__numeric_traits_integerIlE5__minE _ZNSt14numeric_limitsIDiE15has_denorm_lossE _ZNSt14numeric_limitsIsE5trapsE operator-= operator-> _ZNSt14numeric_limitsIdE3minEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5eraseEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_ _ZNSt14numeric_limitsIlE9is_moduloE _ZNSt14numeric_limitsIDiE12max_digits10E _ZNSt14numeric_limitsIaE11round_styleE _ZNSt9nothrow_tC4Ev _ZNSt14numeric_limitsIbE12has_infinityE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE13find_first_ofEwm wcstok _ZNSt14numeric_limitsIyE10has_denormE char_traits<char16_t> _ZNSt14numeric_limitsIcE8digits10E _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEPKc short int _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7crbeginEv _ZSt8in_place _ZNK9__gnu_cxx13new_allocatorIcE7addressERKc _ZNSt14numeric_limitsIcE11round_styleE _sys_nerr _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7compareEmmS2_ _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE12find_last_ofEDim _ZNSt14numeric_limitsIdE5radixE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE11_M_is_localEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5c_strEv _ZNSt14numeric_limitsIwE13signaling_NaNEv _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7compareEmmPKw srand _ZNSt14numeric_limitsIsE10has_denormE _ZSt7nothrow _ZNSt14numeric_limitsIDsE9is_signedE has_infinity localeconv _ZNSt14numeric_limitsIDiE9is_iec559E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmmc _ZNKSt17basic_string_viewIcSt11char_traitsIcEE16find_last_not_ofEPKcm _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4copyEPwmm _markers _ZNSt14numeric_limitsIeE11round_styleE _fileno _ZNSt17basic_string_viewIDsSt11char_traitsIDsEE10_S_compareEmm operator std::integral_constant<bool, false>::value_type _ZNSt14numeric_limitsIyE7epsilonEv __int_least32_t _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5beginEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_createERmm _ZNSt14numeric_limitsIlE13signaling_NaNEv _ZNSt14numeric_limitsIwE13has_quiet_NaNE stdout _ZNSt14numeric_limitsIDsE10is_boundedE _ZNSt14numeric_limitsIhE6lowestEv _ZNSt14numeric_limitsIdE9is_signedE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4cendEv int_n_cs_precedes _ZNSt14numeric_limitsIaE13signaling_NaNEv _ZNSt14numeric_limitsIwE12min_exponentE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmRKS4_ _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4findEwm _ZNK9__gnu_cxx13new_allocatorIcE8max_sizeEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEPKcm _ZNSt14numeric_limitsImE10has_denormE _ZNSt14numeric_limitsIxE5trapsE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE13find_first_ofEPKDim _ZNSt14numeric_limitsIfE6digitsE uint_fast64_t _ZNSt14numeric_limitsItE15tinyness_beforeE _ZNSt14numeric_limitsIiE11round_styleE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE6lengthEv _ZNSt14numeric_limitsIiE8infinityEv getchar __initialize_p _ZNSt14numeric_limitsIjE10has_denormE rebind<char> find_last_of _ZNSt14numeric_limitsIfE12min_exponentE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_RKS3_ _ZNSt14numeric_limitsIwE12has_infinityE _ZNSt14numeric_limitsIbE15has_denorm_lossE _ZNSt14numeric_limitsImE15tinyness_beforeE _ZNSt14numeric_limitsIfE15tinyness_beforeE _ZNSt14numeric_limitsIjE11round_errorEv _ZNSt14numeric_limitsImE6digitsE _ZNSt14numeric_limitsIyE13signaling_NaNEv _ZN9__gnu_cxx14__alloc_traitsISaIcEcE27_S_propagate_on_copy_assignEv __int32_t wmemmove _ZNKSt17basic_string_viewIwSt11char_traitsIwEE16find_last_not_ofES2_m _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5rfindEPKDsm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcS5_S5_ _ZNSt11char_traitsIcE6assignERcRKc _ZNSt14numeric_limitsIiE5radixE __time_t _ZNKSt17basic_string_viewIcSt11char_traitsIcEE13find_first_ofES2_m _ZNSt14numeric_limitsIlE7epsilonEv _ZNSt14numeric_limitsIdE12max_digits10E _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4backEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLEPKc _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8_M_checkEmPKc _ZNSt14numeric_limitsIdE10has_denormE _ZNK9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmiEl _ZSt3cin __gnu_cxx _ZNSt11char_traitsIwE4copyEPwPKwm _ZNSt14numeric_limitsImE11round_styleE _S_on_swap _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5rfindES2_m _ZNKSt17basic_string_viewIcSt11char_traitsIcEE13find_first_ofEPKcmm _ZNSt14numeric_limitsImE14max_exponent10E _ZNSt14numeric_limitsIDsE11round_errorEv _ZNSt14numeric_limitsItE14min_exponent10E _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmRKS4_ _ZNSt15allocator_arg_tC4Ev _ZNSt14numeric_limitsIbE14max_exponent10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmPKc _ZNSt14numeric_limitsIaE10has_denormE _ZNSt14numeric_limitsIdE9quiet_NaNEv _ZNSt14numeric_limitsIxE14is_specializedE strcoll _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcN9__gnu_cxx17__normal_iteratorIPKcS4_EESA_ iterator_traits<char const*> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_M_destroyEm _IO_write_base _ZNSt11char_traitsIcE4findEPKcmRS1_ _ZNSt14numeric_limitsImE14is_specializedE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4sizeEv difftime _ZNSt14numeric_limitsIyE17has_signaling_NaNE wcslen _ZNKSt17basic_string_viewIcSt11char_traitsIcEE12find_last_ofES2_m _ZNSt14numeric_limitsIsE9is_signedE _ZNSt14numeric_limitsIdE14min_exponent10E integral_constant<bool, false> _ZNSt11char_traitsIDsE6lengthEPKDs _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7compareEmmPKc _ZNSt14numeric_limitsIsE11round_styleE _ZNSt14numeric_limitsIxE8infinityEv _ZNSt14numeric_limitsIbE5trapsE _M_create _ZNSt14numeric_limitsIlE10is_integerE eq_int_type _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6rbeginEv _ZNSt11char_traitsIwE4moveEPwPKwm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE13find_first_ofEcm _ZNSt14numeric_limitsIcE10is_boundedE _ZNSt17basic_string_viewIcSt11char_traitsIcEEC4EPKc _ZNK9__gnu_cxx13new_allocatorIcE7addressERc _ZNSt14numeric_limitsIDiE13signaling_NaNEv __pos _ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEdeEv _ZNSt17basic_string_viewIwSt11char_traitsIwEEC4Ev _ZNSt14numeric_limitsIiE10is_integerE _ZNSt14numeric_limitsIDsE3maxEv _ZNSt17basic_string_viewIDiSt11char_traitsIDiEE13remove_prefixEm _ZNKSt17basic_string_viewIwSt11char_traitsIwEE12find_last_ofES2_m _ZNSt11char_traitsIwE12to_char_typeERKj _ZNSt14numeric_limitsIbE8infinityEv fclose _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE8_M_limitEmm _ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEixEl _ZNKSt17basic_string_viewIcSt11char_traitsIcEE8_M_limitEmm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEN9__gnu_cxx17__normal_iteratorIPKcS4_EEmc _ZNSt14numeric_limitsIfE10is_integerE round_to_nearest _M_limit basic_istream<char, std::char_traits<char> > _ZNSt14numeric_limitsItE9is_moduloE _ZNSt17basic_string_viewIDsSt11char_traitsIDsEEC4Ev _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofERKS4_m _ZNSt14numeric_limitsIyE12max_digits10E _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofEPKcm _ZNSt14numeric_limitsIeE8is_exactE _M_replace denorm_absent _ZN9__gnu_cxx25__numeric_traits_floatingIfE16__max_exponent10E _ZNSt14numeric_limitsIcE10is_integerE setbuf _ZNSt14numeric_limitsImE9quiet_NaNEv wctomb _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindEPKcmm _ZNSt14numeric_limitsItE17has_signaling_NaNE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE8max_sizeEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEED4Ev _ZNSt14numeric_limitsIxE11round_styleE _ZNKSt17basic_string_viewIwSt11char_traitsIwEE12find_last_ofEwm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE8max_sizeEv __normal_iterator<char*, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > _cur_column _ZNSt14numeric_limitsIjE12min_exponentE _M_local_data _ZNSt14numeric_limitsIhE3minEv _ZNSt14numeric_limitsIjE9is_moduloE __digits _ZNSt15__exception_ptr13exception_ptraSEOS0_ empty _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofEPKcm _ZNSaIcEC4ERKS_ _ZNSt14numeric_limitsIhE12max_digits10E numeric_limits<long long unsigned int> _M_is_local _ZNSt14numeric_limitsIiE3maxEv _Container _ZNSt14numeric_limitsIsE13signaling_NaNEv _ZNSt16allocator_traitsISaIcEE8max_sizeERKS0_ mon_grouping _ZNSt14numeric_limitsIDsE12min_exponentE _ZNSt14numeric_limitsIjE12has_infinityE _ZNSt14numeric_limitsIwE15tinyness_beforeE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4rendEv wmemchr _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE12find_last_ofES2_m _ZNSt14numeric_limitsIhE13signaling_NaNEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareERKS4_ mblen _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13get_allocatorEv reverse_iterator<__gnu_cxx::__normal_iterator<char*, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > > _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4copyEPDimm _ZNSt17basic_string_viewIDsSt11char_traitsIDsEE4nposE tm_year _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6substrEmm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5rfindEcm _ZNSt14numeric_limitsIxE9is_iec559E 7lldiv_t _ZNSt14numeric_limitsIeE15has_denorm_lossE to_int_type _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_S_assignEPcmc program_invocation_short_name _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEEixEm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendEPKcm _ZNSt14numeric_limitsIDsE12has_infinityE _ZNSt21__numeric_limits_base12max_digits10E _ZNSt15__exception_ptr13exception_ptrC4ERKS0_ _ZNSt14numeric_limitsIbE9is_iec559E _ZNSt14numeric_limitsIsE3minEv _ZNSt14numeric_limitsIyE10is_boundedE strtoull _Traits _Char_alloc_type _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4cendEv __off64_t wcstod wcstof _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7compareEmmPKDim tm_wday wcstol _ZNSt14numeric_limitsImE9is_moduloE _ZNSt14numeric_limitsItE3maxEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6lengthEv _ZNSt11char_traitsIDiE4moveEPDiPKDim _S_copy_chars _M_construct_aux_2 _ZNSt14numeric_limitsIwE8is_exactE _ZNSt15__exception_ptr13exception_ptr10_M_releaseEv _ZNSt14numeric_limitsIDsE9quiet_NaNEv _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4backEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5clearEv perror _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_Alloc_hiderC4EPcOS3_ atexit _ZNSt17basic_string_viewIwSt11char_traitsIwEE4nposE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmRKS4_mm _ZNSt14numeric_limitsIjE17has_signaling_NaNE _ZNSt14numeric_limitsImE8digits10E _ZNSt16initializer_listIcEC4Ev _ZNSt14numeric_limitsItE14max_exponent10E _ZNSt14numeric_limitsIlE5trapsE _ZNSt14numeric_limitsIiE14max_exponent10E _ZNSt14numeric_limitsItE14is_specializedE _ZNSt21__numeric_limits_base5radixE select_on_container_copy_construction in_place_t _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_assignERKS4_ _ZNSt14numeric_limitsIiE14is_specializedE wmemcmp _S_propagate_on_copy_assign _ZNSt14numeric_limitsIDiE6lowestEv __uint64_t max_size _ZNSt14numeric_limitsIxE5radixE _ZNSt14numeric_limitsIhE8digits10E _ZNSt14numeric_limitsImE10is_boundedE _ZNSt8ios_base4InitC4Ev char_traits<char> _ZNSt14numeric_limitsIlE12max_digits10E _ZNSt14numeric_limitsIjE8is_exactE _ZNSt17basic_string_viewIcSt11char_traitsIcEE4swapERS2_ _ZNSt14numeric_limitsIhE10is_boundedE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE12find_last_ofEcm _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE17find_first_not_ofES2_m _ZNSt14numeric_limitsIjE10is_boundedE _M_check_length _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7compareEmmPKwm _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4dataEv other _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ENS4_12__sv_wrapperERKS3_ _ZNSt14numeric_limitsItE6digitsE _ZNSt14numeric_limitsIjE8infinityEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_appendEPKcm _ZNSt14numeric_limitsIDsE15has_denorm_lossE _ZNSt14numeric_limitsIaE11round_errorEv _ZSt4cerr _ZNSt14numeric_limitsIeE9quiet_NaNEv _ZNSt11char_traitsIDsE11to_int_typeERKDs _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4findEPKwm _ZNSt14numeric_limitsIdE14is_specializedE _ZNSt14numeric_limitsIeE17has_signaling_NaNE _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4findEPKcmm tmpnam has_denorm _ZN9__gnu_cxx14__alloc_traitsISaIcEcE20_S_propagate_on_swapEv long long unsigned int _ZNSt17basic_string_viewIcSt11char_traitsIcEEC4ERKS2_ _S_propagate_on_move_assign _ZNSt14numeric_limitsIaE3minEv wmemcpy rfind _ZNSt14numeric_limitsIaE13has_quiet_NaNE _ZNSt14numeric_limitsIxE10is_integerE _ZNSt21__numeric_limits_base14max_exponent10E _ZNSt14numeric_limitsIbE6lowestEv _ZNSt14numeric_limitsIfE9is_moduloE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EOS4_ _ZNSt14numeric_limitsIjE6digitsE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE13find_first_ofEDsm _ZNSt14numeric_limitsIbE3maxEv _ZNSt14numeric_limitsIaE10is_boundedE _ZNSt14numeric_limitsIeE15tinyness_beforeE __alloc_traits<std::allocator<char>, char> numeric_limits<unsigned char> _ZNSt11char_traitsIcE6assignEPcmc operator* _ZNKSt17basic_string_viewIcSt11char_traitsIcEE17find_first_not_ofES2_m _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8_M_limitEmm operator- _ZNKSt17basic_string_viewIwSt11char_traitsIwEEixEm operator= _M_append _ZNSt14numeric_limitsIwE12max_exponentE _ZNSt21__numeric_limits_base14is_specializedE ftell operator std::integral_constant<bool, true>::value_type _ZNSt14numeric_limitsIDsE3minEv _ZNSt14numeric_limitsIbE5radixE _ZNSt14numeric_limitsIlE3minEv char32_t _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofEPKcmm _M_get_allocator _ZNSt17basic_string_viewIDiSt11char_traitsIDiEE4swapERS2_ _ZNSt14numeric_limitsIDsE14min_exponent10E _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE17find_first_not_ofES2_m _ZNKSt17basic_string_viewIwSt11char_traitsIwEE7compareEPKw _ZNSt14numeric_limitsItE9is_signedE _ZNSt14numeric_limitsImE3maxEv _ZNSt14numeric_limitsIiE7epsilonEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7compareEPKDs new_allocator<char> _ZNSt14numeric_limitsIxE13has_quiet_NaNE _ZNSt14numeric_limitsIDiE7epsilonEv _ZNSt14numeric_limitsIxE9is_signedE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4sizeEv _ZNSt14numeric_limitsIdE13signaling_NaNEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignERKS4_ size_type _ZNSt14numeric_limitsIeE3maxEv __unknown__ _ZNSt11char_traitsIDiE2eqERKDiS2_ _ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEC4ERKS1_ _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE6lengthEv _ZNSt14numeric_limitsIjE9is_iec559E _ZNSt14numeric_limitsIyE8infinityEv _ZNSt14numeric_limitsIfE12max_exponentE numeric_limits<short int> __numeric_traits_floating<double> _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSESt16initializer_listIcE _ZNSt11char_traitsIDiE2ltERKDiS2_ _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmPKcm __uint_least16_t _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_M_local_dataEv _ZN9__gnu_cxx13new_allocatorIcED4Ev _ZNSt14numeric_limitsIwE3minEv _ZNSt21__numeric_limits_base15has_denorm_lossE _ZNSt14numeric_limitsIcE8infinityEv _ZNSt14numeric_limitsIbE14is_specializedE __dso_handle _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12__sv_wrapperC4ESt17basic_string_viewIcS2_E _ZNSt14numeric_limitsIDiE5trapsE _ZNSt14numeric_limitsIeE11round_errorEv _ZN9__gnu_cxx3divExx _ZNSt14numeric_limitsIbE11round_styleE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE4findEDim _ZNSt14numeric_limitsIfE8infinityEv _ZNSt14numeric_limitsIxE3maxEv _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE13find_first_ofEPKDimm numeric_limits<char> lowest _ZNSt14numeric_limitsIeE8digits10E _ZNSt14numeric_limitsIaE12min_exponentE iswctype _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE3endEv _ZNSt14numeric_limitsIDsE6lowestEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4findEPKDsm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE6cbeginEv strrchr _ZNKSt17basic_string_viewIwSt11char_traitsIwEE6cbeginEv _ZNKSt17basic_string_viewIcSt11char_traitsIcEE4backEv _ZNSt14numeric_limitsIwE9quiet_NaNEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE3endEv _ZNK9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEptEv tm_gmtoff numeric_limits<float> _Atomic_word _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendERKS4_mm numeric_limits<unsigned int> _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5rfindEPKwmm vwscanf _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7compareEmmS2_ _ZNSt14numeric_limitsIaE12has_infinityE _ZNSt11char_traitsIcE11eq_int_typeERKiS2_ _ZNSt11char_traitsIcE12to_char_typeERKi _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE4copyEPDsmm _ZNSt14numeric_limitsIbE8is_exactE _ZNSt14numeric_limitsIeE14max_exponent10E _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmRKS4_mm is_specialized _ZNSt17basic_string_viewIwSt11char_traitsIwEE4swapERS2_ _ZNSt14numeric_limitsIeE14is_specializedE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_M_dataEPc _ZNSt14numeric_limitsIyE15tinyness_beforeE _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmPKc _ZNSt11char_traitsIDsE3eofEv _ZNSt14numeric_limitsIlE6lowestEv _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE5rfindES2_m _ZNSt14numeric_limitsImE9is_signedE _ZNSt14numeric_limitsIaE10denorm_minEv front _ZNSt14numeric_limitsIyE9is_iec559E _ZNSt17basic_string_viewIDiSt11char_traitsIDiEEC4Ev _ZNSt14numeric_limitsIcE9is_iec559E insert _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE12find_last_ofEPKDsmm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE5rfindES2_m _ZNSt14numeric_limitsIeE9is_signedE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE16find_last_not_ofEPKDsmm wostream _ZNKSt17basic_string_viewIwSt11char_traitsIwEE2atEm _ZNSt14numeric_limitsIlE8is_exactE _ZNSt14numeric_limitsIDiE10has_denormE _ZNSt11char_traitsIDiE11to_int_typeERKDi _ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv basic_istream<wchar_t, std::char_traits<wchar_t> > _ZNSt15__exception_ptr13exception_ptrC4Ev mbrtowc _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEN9__gnu_cxx17__normal_iteratorIPKcS4_EEc mon_decimal_point _ZNSt21__numeric_limits_base9is_moduloE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLERKS4_ _ZNSt14numeric_limitsIxE15has_denorm_lossE _ZNSt11char_traitsIcE2eqERKcS2_ _ZNKSt17basic_string_viewIcSt11char_traitsIcEE6substrEmm _chain typedef __va_list_tag __va_list_tag _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmmc __compar_fn_t _ZNSt14numeric_limitsItE12max_digits10E _ZNSt14numeric_limitsIeE10denorm_minEv /home/tman1/i240b/submit/lab2/exercises/2-hello _ZNSt14numeric_limitsIxE17has_signaling_NaNE _M_current __int_least8_t _ZNSt17basic_string_viewIwSt11char_traitsIwEE10_S_compareEmm strxfrm strstr _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmPKc _ZNKSt17basic_string_viewIwSt11char_traitsIwEE13find_first_ofEPKwm _ZNSt14numeric_limitsIeE3minEv _ZNSt14numeric_limitsIDsE12max_exponentE _ZNSt14numeric_limitsIlE12max_exponentE overflow_arg_area reg_save_area _S_refcount __int_least64_t upcaseWords _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE13find_first_ofEDim _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EOS4_RKS3_ _ZNKSt17basic_string_viewIcSt11char_traitsIcEE16find_last_not_ofEcm _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7compareEmmPKDi _ZNKSt17basic_string_viewIwSt11char_traitsIwEE5rfindEwm _ZNSt14numeric_limitsIfE3maxEv _ZNSt14numeric_limitsIeE12min_exponentE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE5rfindEDim _ZNSt14numeric_limitsImE13has_quiet_NaNE _ZNSt14numeric_limitsIaE9is_signedE _ZNSt14numeric_limitsIiE11round_errorEv _ZNSt17basic_string_viewIDsSt11char_traitsIDsEEaSERKS2_ _ZNSt14numeric_limitsIwE8digits10E _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ESt16initializer_listIcERKS3_ _ZNKSt17basic_string_viewIwSt11char_traitsIwEE4cendEv _ZNSt14numeric_limitsIxE14min_exponent10E _ZNSt14numeric_limitsIeE12max_exponentE main _ZNSt14numeric_limitsIcE12max_digits10E _ZNSt11char_traitsIDsE12to_char_typeERKt ~exception_ptr _M_set_length int_frac_digits _ZNSt14numeric_limitsIiE10denorm_minEv _ZNKSt17basic_string_viewIwSt11char_traitsIwEE13find_first_ofEPKwmm _ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofERKS4_m _ZNSt17basic_string_viewIDiSt11char_traitsIDiEE13remove_suffixEm initializer_list<char> _ZNKSt17basic_string_viewIcSt11char_traitsIcEE3endEv setvbuf _ZNKSt17basic_string_viewIwSt11char_traitsIwEE17find_first_not_ofEPKwm _ZNSt14numeric_limitsIfE9quiet_NaNEv _ZNSt14numeric_limitsIeE5trapsE _freeres_list _ZNSt14numeric_limitsIaE7epsilonEv _ZNSt11char_traitsIDiE7compareEPKDiS2_m __int64_t hello.cc _ZNSt14numeric_limitsItE8is_exactE _S_propagate_on_swap _ZNSt14numeric_limitsIjE8digits10E strtold int_p_cs_precedes _ZNSt14numeric_limitsIsE17has_signaling_NaNE strtoll _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSEOS4_ _IO_FILE __tzname _ZNSt14numeric_limitsIfE6lowestEv _ZN9__gnu_cxx14__alloc_traitsISaIcEcE15_S_nothrow_moveEv _ZNSt14numeric_limitsImE10denorm_minEv ptrdiff_t __digits10 _Iterator reverse_iterator<char const*> basic_string_view<char, std::char_traits<char> > float_denorm_style gp_offset _ZNSt14numeric_limitsImE12max_digits10E _ZNSt17basic_string_viewIDsSt11char_traitsIDsEE4swapERS2_ _ZNSt14numeric_limitsIdE12min_exponentE _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5eraseEmm crend __uint_least8_t _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEOS4_ _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE17find_first_not_ofEPKDsmm _ZNSt17basic_string_viewIcSt11char_traitsIcEEC4EPKcm _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7compareEmmPKcm argc ferror _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4nposE argv _ZNSt11char_traitsIcE11to_int_typeERKc __max vfwprintf tm_sec operator+ _ZNSt14numeric_limitsIwE14max_exponent10E wcsrchr fputwc GNU C++17 8.3.0 -mtune=generic -march=x86-64 -g -std=c++17 _ZNSt14numeric_limitsIiE9is_iec559E _ZNSt14numeric_limitsIsE10denorm_minEv fputws _ZNSt14numeric_limitsIxE12max_digits10E _ZNSt14numeric_limitsIlE14max_exponent10E _ZNSt14numeric_limitsIwE14is_specializedE wcsncmp iterator_traits<char*> _ZNSt14numeric_limitsIyE14min_exponent10E _ZNSt14numeric_limitsIiE6lowestEv _ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_M_constructEmc wint_t _ZNSt14numeric_limitsIDiE3maxEv _ZNSt14numeric_limitsIjE5trapsE _ZNSt14numeric_limitsIaE14max_exponent10E _ZNSt14numeric_limitsIsE13has_quiet_NaNE _ZNKSt17basic_string_viewIDiSt11char_traitsIDiEE7compareEPKDi _ZNSt14numeric_limitsImE11round_errorEv _ZN9__gnu_cxx17__normal_iteratorIPKcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEmIEl _freeres_buf _ZNSt14numeric_limitsIxE10has_denormE _ZNKSt17basic_string_viewIDsSt11char_traitsIDsEE7compareES2_ _ZNKSt17basic_string_viewIcSt11char_traitsIcEE7compareES2_ _ZNSt14numeric_limitsIDsE13signaling_NaNEv _ZNSt14numeric_limitsItE11round_styleE bsearch _ZNSt14numeric_limitsIiE12min_exponentE _ZNSt14numeric_limitsIlE14is_specializedE _ZNSt17basic_string_viewIDiSt11char_traitsIDiEEaSERKS2_ _ZNSt14numeric_limitsIDsE8infinityEv _ZNSt14numeric_limitsIwE10denorm_minEv                                    ¨                    Ä                    ä                                        8                    è                    „                    ¨                   	 è                   
                                                                °                    À                    ä                                                               x                      =                    °=                    ¸=                    È?                     @                    X@                    €@                                                                                                                                                      ñÿ                     ð                                  !     `              7     °B             F     °=              m                    y      =              ˜    ñÿ                ¡     ±B             °     €      I       À           I       ð     \                 ñÿ                    "                   ñÿ                "                                        5    ¸=              >     °=              O      =              b     @              ÿ     ¥      Û       x    h@              º     X@                                 Ž  "                   ª                     ¾    É      J      Ã                        `@              A   ä                                   ¾    À      +       2                     w                     •   h@                                    ¡    €@            ¸    X@              J    ¸B              Å    h@              Ñ                     ö    €      ]                                                  7    à             G                     \                     {                      Š                      ¤     A            »                      crtstuff.c deregister_tm_clones __do_global_dtors_aux completed.7325 __do_global_dtors_aux_fini_array_entry frame_dummy __frame_dummy_init_array_entry hello.cc _ZStL8__ioinit _ZL8sayHelloPKc _Z41__static_initialization_and_destruction_0ii _GLOBAL__sub_I__Z11upcaseWordsPKcPc __FRAME_END__ __GNU_EH_FRAME_HDR _DYNAMIC __init_array_end __init_array_start _GLOBAL_OFFSET_TABLE_ _edata _IO_stdin_used __cxa_finalize@@GLIBC_2.2.5 strlen@@GLIBC_2.2.5 main _ZSt4endlIcSt11char_traitsIcEERSt13basic_ostreamIT_T0_ES6_@@GLIBCXX_3.4 __dso_handle __cxa_atexit@@GLIBC_2.2.5 _ZStlsISt11char_traitsIcEERSt13basic_ostreamIcT_ES5_PKc@@GLIBCXX_3.4 _ZNSolsEPFRSoS_E@@GLIBCXX_3.4 __TMC_END__ _ZSt4cout@@GLIBCXX_3.4 __data_start __bss_start _ZNSt8ios_base4InitC1Ev@@GLIBCXX_3.4 __libc_csu_init isalpha@@GLIBC_2.2.5 _ITM_deregisterTMCloneTable __libc_csu_fini toupper@@GLIBC_2.2.5 __libc_start_main@@GLIBC_2.2.5 __gmon_start__ _ITM_registerTMCloneTable _ZSt4cerr@@GLIBCXX_3.4 _ZNSt8ios_base4InitD1Ev@@GLIBCXX_3.4  .symtab .strtab .shstrtab .interp .note.ABI-tag .note.gnu.build-id .gnu.hash .dynsym .dynstr .gnu.version .gnu.version_r .rela.dyn .rela.plt .init .plt.got .text .fini .rodata .eh_frame_hdr .eh_frame .init_array .fini_array .dynamic .got.plt .data .bss .comment .debug_aranges .debug_info .debug_abbrev .debug_line .debug_str                                                                               ¨      ¨                                    #             Ä      Ä                                     1             ä      ä      $                              D   öÿÿo                   0                             N             8      8      °                          V             è      è      œ                             ^   ÿÿÿo       „      „      $                            k   þÿÿo       ¨      ¨      @                            z             è      è      8                           „      B                     À                           Ž                                                         ‰                                                        ”             °      °                                                À      À      !                             £             ä      ä      	                              ©                                                           ±                           \                              ¿             x       x       ˜                             É              =       -                                   Õ             °=      °-                                   á             ¸=      ¸-                                 ˜             È?      È/      8                             ê              @       0      X                             ó             X@      X0                                    ù             €@      h0      8                              þ      0               h0                                                        „0      0                                                   ´0      (¹                             "                     Üé      J	                             0                     &ó                                   <     0               ¥ø                                                       °û     ø      !   6                 	                      ¨     à                                                   ˆ     G                             tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ c [K[Kcat hello.cc[K[K[K[K[K[K[K[K[K Makefile 
CXXFLAGS = -g -Wall -std=c++17

hello:
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ cat hello.cc
#include <locale>
#include <iostream>
#include <cstdlib>
#include <cstring>

/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */
void
upcaseWords(const char in[], char out[])
{
  bool inWord = false;
  const int n = std::strlen(in);
  for (int i = 0; i < n; i++) {
    if (!inWord && std::isalpha(in[i])) {
      out[i] = std::toupper(in[i]);
    }
    else {
      out[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

static void
sayHello(const char *name)
{
  std::cout << "Hello " << name << std::endl;
}


int
main(int argc, const char *argv[])
{
  if (argc == 1) {
    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
    std::exit(1);
  }
  else {
    for (int i = 1; i <= argc; i++) {
      const char *name = argv[i];
      char friendlyName[strlen(name)];
      upcaseWords(name, friendlyName);
      sayHello(friendlyName);
    }
  }
}
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello h[Kbart lisa
Hello Bart
Hello Lisa
Segmentation fault
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./ [Khello 'lisa simpson' ; [K[K'bart simpson'
Hello Lisa SimpsonòU
Hello Bart SimpsonòU
Segmentation fault
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) i f
No stack.
(gdb) i functions 
All defined functions:

File hello.cc:
34:	int main(int, char const**);
11:	void upcaseWords(char const*, char*);
	static void _GLOBAL__sub_I__Z11upcaseWordsPKcPc();
	static void __static_initialization_and_destruction_0(int, int);
27:	static void sayHello(char const*);

Non-debugging symbols:
0x0000000000001000  _init
0x0000000000001030  strlen@plt
0x0000000000001040  __cxa_atexit@plt
0x0000000000001050  std::basic_ostream<char, std::char_traits<char> >& std::operator<< <std::char_traits<char> >(std::basic_ostream<char, std::char_traits<char> >&, char const*)@plt
0x0000000000001060  std::ostream::operator<<(std::ostream& (*)(std::ostream&))@plt
0x0000000000001070  exit@plt
0x0000000000001080  std::ios_base::Init::Init()@plt
0x0000000000001090  isalpha@plt
0x00000000000010a0  toupper@plt
0x00000000000010b0  __cxa_finalize@plt
0x00000000000010c0  _start
0x00000000000010f0  deregister_tm_clones
0x0000000000001120  register_tm_clones
0x0000000000001160  __do_global_dtors_aux
0x00000000000011a0  frame_dummy
0x0000000000001480  __libc_csu_init
0x00000000000014e0  __libc_csu_fini
0x00000000000014e4  _fini
(gdb) b[Kc
The program is not being run.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni[Ks[K[Ksi
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) l
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
(gdb) si
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555030 in strlen@plt ()
(gdb) 
0x0000555555555036 in strlen@plt ()
(gdb) 
0x000055555555503b in strlen@plt ()
(gdb) 
0x0000555555555020 in ?? ()
(gdb) 
0x0000555555555026 in ?? ()
(gdb) 
_dl_runtime_resolve_xsave () at ../sysdeps/x86_64/dl-trampoline.h:72
72	../sysdeps/x86_64/dl-trampoline.h: No such file or directory.
(gdb) 
75	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
77	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
87	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
93	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
94	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
95	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
96	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
97	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
98	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
99	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
103	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
104	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
107	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
108	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
110	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
111	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
112	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
113	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
114	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
115	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
117	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
124	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
125	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
126	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
_dl_fixup (l=0x7ffff7ffe190, reloc_arg=0) at ../elf/dl-runtime.c:69
69	../elf/dl-runtime.c: No such file or directory.
(gdb) 
0x00007ffff7fe3a31	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a34	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a36	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a3a	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a3e	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a42	69	in ../elf/dl-runtime.c
(gdb) 
71	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a4d	71	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a51	71	in ../elf/dl-runtime.c
(gdb) 
73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a59	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a5d	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a60	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a64	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a67	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a6b	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a6f	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a73	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a76	73	in ../elf/dl-runtime.c
(gdb) 
75	in ../elf/dl-runtime.c
(gdb) 
80	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a81	80	in ../elf/dl-runtime.c
(gdb) 
84	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a8b	84	in ../elf/dl-runtime.c
(gdb) 
88	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a98	88	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a9b	88	in ../elf/dl-runtime.c
(gdb) 
93	in ../elf/dl-runtime.c
(gdb) c
Continuing.
Hello Bart
Hello Lisa

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) start bart lisa
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Temporary breakpoint 2 at 0x5555555552e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 2, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555385	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538f	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555395	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539f	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553b2	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553b5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ba	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553bf	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c6	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553d0	43	      char friendlyName[strlen(name)];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) li[K
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) ni
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553dc	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553df	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553e2	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553eb	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ee	45	      sayHello(friendlyName);
(gdb) 
Hello Bart
0x00005555555553f3	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553fa	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555385	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538f	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555395	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539f	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name)];
(gdb) kill
Kill the program being debugged? (y or n) y
[Inferior 1 (process 198560) killed]
(gdb) start bart lisa
Temporary breakpoint 3 at 0x5555555552e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 3, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) si
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555030 in strlen@plt ()
(gdb) 
0x0000555555555036 in strlen@plt ()
(gdb) 
0x000055555555503b in strlen@plt ()
(gdb) 
0x0000555555555020 in ?? ()
(gdb) 
0x0000555555555026 in ?? ()
(gdb) 
_dl_runtime_resolve_xsave () at ../sysdeps/x86_64/dl-trampoline.h:72
72	../sysdeps/x86_64/dl-trampoline.h: No such file or directory.
(gdb) 
75	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
77	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
87	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
93	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
94	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
95	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) i
"info" must be followed by the name of an info command.
List of info subcommands:

info address -- Describe where symbol SYM is stored
info all-registers -- List of all registers and their contents
info args -- Argument variables of current stack frame
info auto-load -- Print current status of auto-loaded files
info auxv -- Display the inferior's auxiliary vector
info bookmarks -- Status of user-settable bookmarks
info breakpoints -- Status of specified breakpoints (all user-settable breakpoints if no argument)
info checkpoints -- IDs of currently known checkpoints
info classes -- All Objective-C classes
info common -- Print out the values contained in a Fortran COMMON block
info copying -- Conditions for redistributing copies of GDB
info dcache -- Print information on the dcache performance
info display -- Expressions to display when program stops
info exceptions -- List all Ada exception names
info extensions -- All filename extensions associated with a source language
info files -- Names of targets and files being debugged
info float -- Print the status of the floating point unit
info frame -- All about selected stack frame
info frame-filter -- List all registered Python frame-filters
info functions -- All function names
info guile -- Prefix command for Guile info displays
info handle -- What debugger does when program gets various signals
info inferiors -- Print a list of inferiors being managed
info line -- Core addresses of the code for a source line
info locals -- Local variables of current stack frame
info macro -- Show the definition of MACRO
info macros -- Show the definitions of all macros at LINESPEC
info mem -- Memory region attributes
info os -- Show OS data ARG
info pretty-printer -- GDB command to list all registered pretty-printers
info probes -- Show available static probes
info proc -- Show /proc process information about any running process
info program -- Execution status of the program
info record -- Info record options
info registers -- List of integer registers and their contents
info scope -- List the variables local to a scope
info selectors -- All Objective-C selectors
info set -- Show all GDB settings
info sharedlibrary -- Status of loaded shared object libraries
info signals -- What debugger does when program gets various signals
info skip -- Display the status of skips
info source -- Information about the current source file
info sources -- Source files in the program
info stack -- Backtrace of the stack
info static-tracepoint-markers -- List target static tracepoints markers
--Type <RET> for more, q to quit, c to continue without paging--q
Quit
(gdb) p info
No symbol "info" in current context.
(gdb) p [K[Kl
90	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) si
96	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
97	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
98	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
99	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
103	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
104	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
107	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
108	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
110	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
111	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
112	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
113	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
114	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
115	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
117	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
124	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
125	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
126	in ../sysdeps/x86_64/dl-trampoline.h
(gdb) 
_dl_fixup (l=0x7ffff7ffe190, reloc_arg=0) at ../elf/dl-runtime.c:69
69	../elf/dl-runtime.c: No such file or directory.
(gdb) 
0x00007ffff7fe3a31	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a34	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a36	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a3a	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a3e	69	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a42	69	in ../elf/dl-runtime.c
(gdb) 
71	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a4d	71	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a51	71	in ../elf/dl-runtime.c
(gdb) 
73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a59	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a5d	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a60	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a64	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a67	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a6b	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a6f	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a73	73	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a76	73	in ../elf/dl-runtime.c
(gdb) 
75	in ../elf/dl-runtime.c
(gdb) 
80	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a81	80	in ../elf/dl-runtime.c
(gdb) 
84	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a8b	84	in ../elf/dl-runtime.c
(gdb) 
88	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a98	88	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3a9b	88	in ../elf/dl-runtime.c
(gdb) 
93	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aa1	93	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aa5	93	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aaa	93	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aae	93	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ab5	93	in ../elf/dl-runtime.c
(gdb) 
94	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3abe	94	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ac2	94	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ac5	94	in ../elf/dl-runtime.c
(gdb) 
102	in ../elf/dl-runtime.c
(gdb) 
102	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ad6	102	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ad8	102	in ../elf/dl-runtime.c
(gdb) 
112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ae0	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3ae7	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aec	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aee	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3aef	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3af5	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3af8	112	in ../elf/dl-runtime.c
(gdb) 
0x00007ffff7fe3afb	112	in ../elf/dl-runtime.c
(gdb) 
_dl_lookup_symbol_x (undef_name=0x55555555462f "strlen", undef_map=0x7ffff7ffe190, 
    ref=ref@entry=0x7fffffffe268, symbol_scope=0x7ffff7ffe4f0, version=0x7ffff7f98570, 
    type_class=type_class@entry=1, flags=1, skip_map=0x0) at dl-lookup.c:792
792	dl-lookup.c: No such file or directory.
(gdb) 
0x00007ffff7fdf242	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf245	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf247	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf249	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf24c	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf24e	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf251	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf252	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf253	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf25a in dl_new_hash (s=0x55555555462f "strlen") at dl-lookup.c:792
792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf25d in _dl_lookup_symbol_x (undef_name=0x55555555462f "strlen", 
    undef_map=0x7ffff7ffe190, ref=ref@entry=0x7fffffffe268, symbol_scope=0x7ffff7ffe4f0, 
    version=0x7ffff7f98570, type_class=type_class@entry=1, flags=1, skip_map=0x0)
    at dl-lookup.c:792
792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf261	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf269	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf26e	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf273 in dl_new_hash (s=0x55555555462f "strlen") at dl-lookup.c:792
792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf275	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf27b	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf27e	792	in dl-lookup.c
(gdb) 
0x00007ffff7fdf283	792	in dl-lookup.c
(gdb) 
557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28b	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28f	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf293	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf296	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf299	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29c	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29e	557	in dl-lookup.c
(gdb) 
557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28b	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28f	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf293	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf296	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf299	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29c	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29e	557	in dl-lookup.c
(gdb) 
557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28b	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28f	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf293	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf296	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf299	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29c	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29e	557	in dl-lookup.c
(gdb) 
557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28b	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28f	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf293	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf296	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf299	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29c	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29e	557	in dl-lookup.c
(gdb) 
557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28b	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28f	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf293	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf296	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf299	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29c	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29e	557	in dl-lookup.c
(gdb) 
557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28b	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf28f	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf293	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf296	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf299	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29c	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf29e	557	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2a0	557	in dl-lookup.c
(gdb) 
_dl_lookup_symbol_x (undef_name=0x55555555462f "strlen", undef_map=0x7ffff7ffe190, 
    ref=ref@entry=0x7fffffffe268, symbol_scope=0x7ffff7ffe4f0, version=0x7ffff7f98570, 
    type_class=type_class@entry=1, flags=1, skip_map=0x0) at dl-lookup.c:793
793	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2a7	793	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2af	793	in dl-lookup.c
(gdb) 
794	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2bd	794	in dl-lookup.c
(gdb) 
801	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2c9	801	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2cb	801	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2d6	801	in dl-lookup.c
(gdb) 
806	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2e1	806	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2e5	806	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2e8	806	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2eb	806	in dl-lookup.c
(gdb) 
812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2f4	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf2fa	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf303	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf308	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf30d	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf312	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf31a	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf31f	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf324	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf327	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf32c	812	in dl-lookup.c
(gdb) 
0x00007ffff7fdf334	812	in dl-lookup.c
(gdb) 
814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf366	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf36a	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf36b	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf36d	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf374	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf375	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf378	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf37a	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf37b	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf380	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf385	814	in dl-lookup.c
(gdb) 
0x00007ffff7fdf38a	814	in dl-lookup.c
(gdb) 
do_lookup_x (undef_name=undef_name@entry=0x55555555462f "strlen", 
    new_hash=new_hash@entry=479443869, old_hash=old_hash@entry=0x7fffffffe1c0, 
    ref=0x555555554350, result=result@entry=0x7fffffffe1d0, scope=0x7ffff7ffe450, i=0, 
    version=0x7ffff7f98570, flags=1, skip=0x0, type_class=1, undef_map=0x7ffff7ffe190)
    at dl-lookup.c:339
339	in dl-lookup.c
(gdb) 
0x00007ffff7fde752	339	in dl-lookup.c
(gdb) 
0x00007ffff7fde754	339	in dl-lookup.c
(gdb) 
0x00007ffff7fde756	339	in dl-lookup.c
(gdb) 
0x00007ffff7fde758	339	in dl-lookup.c
(gdb) 
0x00007ffff7fde759	339	in dl-lookup.c
(gdb) 
0x00007ffff7fde75a	339	in dl-lookup.c
(gdb) 
340	in dl-lookup.c
(gdb) 
345	in dl-lookup.c
(gdb) 
0x00007ffff7fde767	345	in dl-lookup.c
(gdb) 
0x00007ffff7fde76f	345	in dl-lookup.c
(gdb) 
0x00007ffff7fde774	345	in dl-lookup.c
(gdb) 
0x00007ffff7fde77c	345	in dl-lookup.c
(gdb) 
0x00007ffff7fde77f	345	in dl-lookup.c
(gdb) 
0x00007ffff7fde784	345	in dl-lookup.c
(gdb) 
346	in dl-lookup.c
(gdb) 
0x00007ffff7fde78c	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde78f	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde794	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde797	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde79b	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde79e	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde7a3	346	in dl-lookup.c
(gdb) 
0x00007ffff7fde7a6	346	in dl-lookup.c
(gdb) 
350	in dl-lookup.c
(gdb) ni
0x00007ffff7fde881	350	in dl-lookup.c
(gdb) 
353	in dl-lookup.c
(gdb) 
0x00007ffff7fde88d	353	in dl-lookup.c
(gdb) 
357	in dl-lookup.c
(gdb) 
0x00007ffff7fde892	357	in dl-lookup.c
(gdb) 
0x00007ffff7fde895	357	in dl-lookup.c
(gdb) 
0x00007ffff7fde898	357	in dl-lookup.c
(gdb) 
361	in dl-lookup.c
(gdb) 
0x00007ffff7fde8aa	361	in dl-lookup.c
(gdb) 
365	in dl-lookup.c
(gdb) 
0x00007ffff7fde8b3	365	in dl-lookup.c
(gdb) 
371	in dl-lookup.c
(gdb) 
0x00007ffff7fde7b6	371	in dl-lookup.c
(gdb) 
0x00007ffff7fde7b8	371	in dl-lookup.c
(gdb) 
375	in dl-lookup.c
(gdb) 
0x00007ffff7fde7c2	375	in dl-lookup.c
(gdb) 
376	in dl-lookup.c
(gdb) 
379	in dl-lookup.c
(gdb) 
0x00007ffff7fde7d7	379	in dl-lookup.c
(gdb) 
380	in dl-lookup.c
(gdb) 
0x00007ffff7fde7e0	380	in dl-lookup.c
(gdb) 
0x00007ffff7fde7e4	380	in dl-lookup.c
(gdb) 
383	in dl-lookup.c
(gdb) 
384	in dl-lookup.c
(gdb) 
0x00007ffff7fde7f3	384	in dl-lookup.c
(gdb) 
386	in dl-lookup.c
(gdb) 
0x00007ffff7fde7fe	386	in dl-lookup.c
(gdb) 
0x00007ffff7fde804	386	in dl-lookup.c
(gdb) 
0x00007ffff7fde808	386	in dl-lookup.c
(gdb) 
0x00007ffff7fde80e	386	in dl-lookup.c
(gdb) 
394	in dl-lookup.c
(gdb) 
0x00007ffff7fde815	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde818	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde81b	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde81e	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde821	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde823	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde826	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde829	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde82b	394	in dl-lookup.c
(gdb) 
do_lookup_unique (result=<optimized out>, result=<optimized out>, undef_map=<optimized out>, 
    ref=<optimized out>, strtab=<optimized out>, sym=<optimized out>, 
    type_class=<optimized out>, map=<optimized out>, new_hash=<optimized out>, 
    undef_name=<optimized out>) at dl-lookup.c:445
445	in dl-lookup.c
(gdb) 
do_lookup_x (undef_name=undef_name@entry=0x55555555462f "strlen", 
    new_hash=new_hash@entry=479443869, old_hash=old_hash@entry=0x7fffffffe1c0, 
    ref=0x555555554350, result=result@entry=0x7fffffffe1d0, scope=<optimized out>, 
    i=<optimized out>, version=0x7ffff7f98570, flags=1, skip=0x0, type_class=1, 
    undef_map=0x7ffff7ffe190) at dl-lookup.c:541
541	in dl-lookup.c
(gdb) 
0x00007ffff7fde83f	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde841	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde843	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde845	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde84d	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde851	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde854	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde856	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde859	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde85e	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde860	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde866	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde870	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde874	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde877	541	in dl-lookup.c
(gdb) 
350	in dl-lookup.c
(gdb) 
0x00007ffff7fde881	350	in dl-lookup.c
(gdb) 
353	in dl-lookup.c
(gdb) 
0x00007ffff7fde88d	353	in dl-lookup.c
(gdb) 
357	in dl-lookup.c
(gdb) 
0x00007ffff7fde892	357	in dl-lookup.c
(gdb) 
0x00007ffff7fde895	357	in dl-lookup.c
(gdb) 
0x00007ffff7fde898	357	in dl-lookup.c
(gdb) 
361	in dl-lookup.c
(gdb) 
0x00007ffff7fde8aa	361	in dl-lookup.c
(gdb) 
365	in dl-lookup.c
(gdb) 
0x00007ffff7fde8b3	365	in dl-lookup.c
(gdb) 
371	in dl-lookup.c
(gdb) 
0x00007ffff7fde7b6	371	in dl-lookup.c
(gdb) 
0x00007ffff7fde7b8	371	in dl-lookup.c
(gdb) 
375	in dl-lookup.c
(gdb) 
0x00007ffff7fde7c2	375	in dl-lookup.c
(gdb) 
376	in dl-lookup.c
(gdb) 
379	in dl-lookup.c
(gdb) 
0x00007ffff7fde7d7	379	in dl-lookup.c
(gdb) 
380	in dl-lookup.c
(gdb) 
0x00007ffff7fde7e0	380	in dl-lookup.c
(gdb) 
0x00007ffff7fde7e4	380	in dl-lookup.c
(gdb) 
383	in dl-lookup.c
(gdb) 
384	in dl-lookup.c
(gdb) 
0x00007ffff7fde7f3	384	in dl-lookup.c
(gdb) 
386	in dl-lookup.c
(gdb) 
0x00007ffff7fde7fe	386	in dl-lookup.c
(gdb) 
0x00007ffff7fde804	386	in dl-lookup.c
(gdb) 
0x00007ffff7fde808	386	in dl-lookup.c
(gdb) 
0x00007ffff7fde80e	386	in dl-lookup.c
(gdb) 
394	in dl-lookup.c
(gdb) 
0x00007ffff7fde815	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde818	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde81b	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde81e	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde821	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde823	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde826	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde829	394	in dl-lookup.c
(gdb) 
0x00007ffff7fde82b	394	in dl-lookup.c
(gdb) 
do_lookup_unique (result=<optimized out>, result=<optimized out>, undef_map=<optimized out>, 
    ref=<optimized out>, strtab=<optimized out>, sym=<optimized out>, 
    type_class=<optimized out>, map=<optimized out>, new_hash=<optimized out>, 
    undef_name=<optimized out>) at dl-lookup.c:445
445	in dl-lookup.c
(gdb) 
do_lookup_x (undef_name=undef_name@entry=0x55555555462f "strlen", 
    new_hash=new_hash@entry=479443869, old_hash=old_hash@entry=0x7fffffffe1c0, 
    ref=0x555555554350, result=result@entry=0x7fffffffe1d0, scope=<optimized out>, 
    i=<optimized out>, version=0x7ffff7f98570, flags=1, skip=0x0, type_class=1, 
    undef_map=0x7ffff7ffe190) at dl-lookup.c:541
541	in dl-lookup.c
(gdb) 
0x00007ffff7fde83f	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde841	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde843	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde845	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde84d	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde851	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde854	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde856	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde859	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde85e	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde860	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde866	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde870	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde874	541	in dl-lookup.c
(gdb) 
0x00007ffff7fde877	541	in dl-lookup.c
(gdb) 
350	in dl-lookup.c
(gdb) 
0x00007ffff7fde881	350	in dl-lookup.c
(gdb) 
353	in dl-lookup.c
(gdb) 
0x00007ffff7fde88d	353	in dl-lookup.c
(gdb) 
357	in dl-lookup.c
(gdb) 
0x00007ffff7fde892	357	in dl-lookup.c
(gdb) 
0x00007ffff7fde895	357	in dl-lookup.c
(gdb) 
0x00007ffff7fde898	357	in dl-lookup.c
(gdb) 
361	in dl-lookup.c
(gdb) 
0x00007ffff7fde8aa	361	in dl-lookup.c
(gdb) 
365	in dl-lookup.c
(gdb) 
0x00007ffff7fde8b3	365	in dl-lookup.c
(gdb) kill
Kill the program being debugged? (y or n) y
[Inferior 1 (process 198636) killed]
(gdb) start bart lisa
Temporary breakpoint 4 at 0x5555555552e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 4, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) p fr
frac_digits                  free_modules_db              frexpf64
fraiseexcpt.c                free_slotinfo                frexpf64x
frame_dummy                  free_state                   frexpl
fread                        free_token                   frexpl@got.plt
fread@got.plt                free_tree                    frexpl@plt
fread@plt                    freeaddrinfo                 friendlyName
fread_chk.c                  freecache                    fromfp
fread_u_chk.c                freehook                     fromfp.h
fread_unlocked               freeifaddrs                  fromfpf
free                         freelocale                   fromfpf128
free@got.plt                 freelocale.c                 fromfpf32
free@plt                     freemem                      fromfpf32x
free_charset                 freemem_size                 fromfpf64
free_check                   freeres                      fromfpf64x
free_check.part              freeres_list                 fromfpl
free_database_entries        fremovexattr                 fromfpx
free_defconfig               freopen                      fromfpxf
free_derivation              freopen.c                    fromfpxf128
free_dfa_content             freopen.cold                 fromfpxf32
free_fail_stack_return       freopen64                    fromfpxf32x
free_fail_stack_return.part  freopen64.c                  fromfpxf64
free_key_mem                 freopen64.cold               fromfpxf64x
free_list                    frexp                        fromfpxl
free_list_lock               frexpf                       fromidx
free_mem                     frexpf128                    fromlimit
free_memory                  frexpf32                     froms
free_memory.isra             frexpf32x                    
(gdb) p friendlyName 
Display all 200 possibilities? (y or n)
(gdb) p friendlyName 
value requires 1431655536 bytes, which is more than max-value-size
(gdb) ls[K[Kup
Initial frame selected; you cannot go up.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) ni
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) l
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
(gdb) l
48	}
(gdb) ni
43	      char friendlyName[strlen(name)];
(gdb) l
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
(gdb) si
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555385	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538c	43	      char friendlyName[strlen(name)];
(gdb) ni
0x000055555555538f	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555395	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name)];
(gdb) ls[K
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
(gdb) ni
0x000055555555539c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539f	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553b2	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553b5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ba	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553bf	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c6	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553d0	43	      char friendlyName[strlen(name)];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553dc	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553df	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553e2	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553eb	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ee	45	      sayHello(friendlyName);
(gdb) 
Hello Bart
0x00005555555553f3	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553fa	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555385	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555538f	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555395	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539c	43	      char friendlyName[strlen(name)];
(gdb) 
0x000055555555539f	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553a9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553b2	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553b5	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553ba	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553bf	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c6	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553c9	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name)];
(gdb) 
0x00005555555553d0	43	      char friendlyName[strlen(name)];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553dc	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553df	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553e2	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553eb	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ee	45	      sayHello(friendlyName);
(gdb) 
Hello Lisa
0x00005555555553f3	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553fa	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name)];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name)];
(gdb) 

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) 

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) q
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ls
hello  hello.cc  Makefile  README
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ cat hello.cc 
#include <locale>
#include <iostream>
#include <cstdlib>
#include <cstring>

/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */
void
upcaseWords(const char in[], char out[])
{
  bool inWord = false;
  const int n = std::strlen(in);
  for (int i = 0; i < n; i++) {
    if (!inWord && std::isalpha(in[i])) {
      out[i] = std::toupper(in[i]);
    }
    else {
      out[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

static void
sayHello(const char *name)
{
  std::cout << "Hello " << name << std::endl;
}


int
main(int argc, const char *argv[])
{
  if (argc == 1) {
    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
    std::exit(1);
  }
  else {
    for (int i = 1; i <= argc; i++) {
      const char *name = argv[i];
      char friendlyName[strlen(name)];
      upcaseWords(name, friendlyName);
      sayHello(friendlyName);
    }
  }
}
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ emacs hello.cc
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) 
Hello Bart
0x00005555555553ef	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553f6	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) 
Hello Lisa
0x00005555555553ef	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553f6	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) 

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) ni[Knistart bart lisa
Temporary breakpoint 2 at 0x5555555552e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 2, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) p i
$1 = 1
(gdb) p *am[K[Kname
Cannot access memory at address 0x2
(gdb) 
Cannot access memory at address 0x2
(gdb) ni
42	      const char *name = argv[i];
(gdb) nip *name
Cannot access memory at address 0x2
(gdb) p *nameni[K
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) p friendlyName 
$2 = "\240\352\377\377\377"
(gdb) p * [Kfir[K[KriendlyName 
$3 = -96 '\240'
(gdb) ni
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) nip *friendlyName 
$4 = -96 '\240'
(gdb) p *friendlyName [C[C[C[C[C[Cni[Kp *friendlyName [C[C[C[C[C[C[Kp name
$5 = 0x7fffffffeaa0 "bart"
(gdb) p strlen(nm[Kame)
$6 = 4
(gdb) p strlen f[K[K(friendlyName )[K[K)
$7 = 6
(gdb) p sie[Kze
No symbol "size" in current context.
(gdb) p se[Kze[K[Kize(name)
No symbol "size" in current context.
(gdb) l
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name) + 1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
(gdb) si
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) si
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) p *0x00005555555553aa
$8 = 32015176
(gdb) p *0x00005555555553a5
$9 = 4280
(gdb) p strlen(friendlyName [K)
$10 = 6
(gdb) ni
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) 
Hello Bart
0x00005555555553ef	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553f6	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) p argc
$11 = 3
(gdb) p i
$12 = 2
(gdb) ni
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) p i
$13 = 2
(gdb) p *ane[K[K[Kname
$14 = 108 'l'
(gdb) p [K[Kni
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) p *([Kname
$15 = 108 'l'
(gdb) ni
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) p fgr[K[KriendlyName 
$16 = "Bart"
(gdb) ni
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) 
Hello Lisa
0x00005555555553ef	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x00005555555553f6	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i <= argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) 

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) p i
No symbol "i" in current context.
(gdb) q
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ emacs hello.cc
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i < argc; i++) {
(gdb) 
46	    }
(gdb) p i
$1 = 1
(gdb) p argc
$2 = 3
(gdb) ni
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) p na[K[K*name
Cannot access memory at address 0x2
(gdb) p argv[i]
$3 = 0x7fffffffeaa0 "bart"
(gdb) p argv[1]
$4 = 0x7fffffffeaa0 "bart"
(gdb) p argv[2]
$5 = 0x7fffffffeaa5 "lisa"
(gdb) ni
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) p *name
$6 = 98 'b'
(gdb) p friendlyName 
value requires 1431655532 bytes, which is more than max-value-size
(gdb) p friendlyName [K[strlen[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kstrlen(r[KfriendlyName [K)
$7 = 6
(gdb) ni
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) p *0x0000555555555375
$8 = -389576376
(gdb) p *0x0000555555555375[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K0x0000555555555378
$9 = -216088
(gdb) ni
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) kill
Kill the program being debugged? (y or n) y
[Inferior 1 (process 199680) killed]
(gdb) start bart lisa
Temporary breakpoint 2 at 0x5555555552e1: file hello.cc, line 36.
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/2-hello/hello bart lisa

Temporary breakpoint 2, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) ni
0x00005555555552e5	36	  if (argc == 1) {
(gdb) 
41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i < argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) 
Hello Bart
0x00005555555553ef	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x00005555555553f6	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i < argc; i++) {
(gdb) 
46	    }
(gdb) 
0x0000555555555353	46	    }
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x0000555555555359	42	      const char *name = argv[i];
(gdb) 
0x000055555555535b	42	      const char *name = argv[i];
(gdb) 
0x0000555555555363	42	      const char *name = argv[i];
(gdb) 
0x0000555555555367	42	      const char *name = argv[i];
(gdb) 
42	      const char *name = argv[i];
(gdb) 
0x000055555555536d	42	      const char *name = argv[i];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555375	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555378	43	      char friendlyName[strlen(name) + 1];
(gdb) 
43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555381	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555384	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555388	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555538b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555391	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555394	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x0000555555555398	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x000055555555539b	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553a5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553aa	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553ae	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b1	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553b6	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553bb	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553be	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c2	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c5	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553c8	43	      char friendlyName[strlen(name) + 1];
(gdb) 
0x00005555555553cc	43	      char friendlyName[strlen(name) + 1];
(gdb) 
44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d4	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553d8	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553db	44	      upcaseWords(name, friendlyName);
(gdb) 
0x00005555555553de	44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) 
0x00005555555553e7	45	      sayHello(friendlyName);
(gdb) 
0x00005555555553ea	45	      sayHello(friendlyName);
(gdb) 
Hello Lisa
0x00005555555553ef	45	      sayHello(friendlyName);
(gdb) 
41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x00005555555553f6	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555344	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x0000555555555347	41	    for (int i = 1; i < argc; i++) {
(gdb) 
0x000055555555534a	41	    for (int i = 1; i < argc; i++) {
(gdb) 
48	}
(gdb) 
0x0000555555555400	48	}
(gdb) 
0x0000555555555404	48	}
(gdb) 
0x0000555555555405	48	}
(gdb) 
0x0000555555555407	48	}
(gdb) 
0x0000555555555409	48	}
(gdb) 
0x000055555555540b	48	}
(gdb) 
0x000055555555540d	48	}
(gdb) 
0x000055555555540e	48	}
(gdb) 
__libc_start_main (main=0x5555555552c9 <main(int, char const**)>, argc=3, 
    argv=0x7fffffffe768, init=<optimized out>, fini=<optimized out>, 
    rtld_fini=<optimized out>, stack_end=0x7fffffffe758) at ../csu/libc-start.c:342
342	../csu/libc-start.c: No such file or directory.
(gdb) 
0x00007ffff7ad909d	342	in ../csu/libc-start.c
(gdb) 
[Inferior 1 (process 199908) exited normally]
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) q
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello bart lias
Hello Bart
Hello Lias
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'bart simpson' 'lisa sa'
Hello Bart Simpson)V
Hello Lisa Sam}£*µ)V
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ e[Kvim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;49r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[49;1H"hello.cc" 48L, 1014C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in);
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[42;7H[32mconst[m [32mchar[m *name = argv[i];[43;7H[32mchar[m friendlyName[strlen(name) + [31m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H1,1[11CAll]2;hello.cc (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in);
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[43;7H[38;5;121mchar[m friendlyName[strlen(name) + [95m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H1,1[11CAll"hello.cc" 48L, 1014C[1;1H[?25h[?25l[49;67H~@k[1;1H[49;67H   [2;1H[49;77H2[2;1H[?25h[?25l[49;67H~@k[2;1H[49;67H   [3;1H[49;77H3[3;1H[?25h[?25l[49;67H~@k[3;1H[49;67H   [4;1H[49;77H4[4;1H[?25h[?25l[49;67H~@k[4;1H[49;67H   [5;1H[49;77H5,0-1[5;1H[?25h[?25l[49;67H~@k[5;1H[49;67H   [6;1H[49;77H6,1  [6;1H[?25h[?25l[49;67H~@k[6;1H[49;67H   [7;1H[49;77H7[7;1H[?25h[?25l[49;67H~@k[7;1H[49;67H   [8;1H[49;77H8[8;1H[?25h[?25l[49;67H~@k[8;1H[49;67H   [9;1H[49;77H9[9;1H[?25h[?25l[49;67H~@k[9;1H[49;67H   [10;1H[49;77H10,1[10;1H[?25h[?25l[49;67H~@k[10;1H[49;67H   [11;1H[49;78H1[11;1H[?25h[?25l[49;67H~@k[11;1H[49;67H   [12;1H[46m{[24;1H}[m[49;78H2[12;1H[?25h[?25l[49;67H~@k[12;1H[49;67H   [13;1H[12;1H{[24;1H}[49;78H3[13;1H[?25h[?25l[49;67H~@k[13;1H[49;67H   [14;1H[49;78H4[14;1H[?25h[?25l[49;67H~@k[14;1H[49;67H   [15;1H[49;78H5[15;1H[?25h[?25l[49;67H~@k[15;1H[49;67H   [16;1H[49;78H6[16;1H[?25h[?25l[49;67H~@k[16;1H[49;67H   [17;1H[49;78H7[17;1H[?25h[?25l[49;67H~@k[17;1H[49;67H   [18;1H[49;78H8[18;1H[?25h[?25l[49;67H~@k[18;1H[49;67H   [19;1H[49;78H9[19;1H[?25h[?25l[49;67H~@k[19;1H[49;67H   [20;1H[49;77H20[20;1H[?25h[?25l[49;67H~@k[20;1H[49;67H   [21;1H[49;78H1[21;1H[?25h[?25l[49;67H~@k[21;1H[49;67H   [22;1H[49;78H2[22;1H[?25h[?25l[49;67H~@k[22;1H[49;67H   [23;1H[49;78H3[23;1H[?25h[?25l[49;67H~@k[23;1H[49;67H   [24;1H[12;1H[46m{[24;1H}[m[49;78H4[24;1H[?25h[?25l[49;67H~@k[24;1H[49;67H   [25;1H[12;1H{[24;1H}[49;78H5,0-1[25;1H[?25h[?25l[49;67H~@k[25;1H[49;67H   [26;1H[49;78H6,1  [26;1H[?25h[?25l[49;67H~@k[26;1H[49;67H   [27;1H[49;78H7[27;1H[?25h[?25l[49;67H~@k[27;1H[49;67H   [28;1H[46m{

}[m[49;78H8[28;1H[?25h[?25l[49;67H~@k[28;1H[49;67H   [29;1H[28;1H{

}[49;78H9[29;1H[?25h[?25l[49;67H~@k[29;1H[49;67H   [30;1H[28;1H[46m{

}[m[49;77H30[30;1H[?25h[?25l[49;67H~@k[30;1H[49;67H   [31;1H[28;1H{

}[49;78H1,0-1[31;1H[?25h[?25l[49;67H~@k[31;1H[49;67H   [32;1H[49;78H2[32;1H[?25h[?25l[49;67H~@k[32;1H[49;67H   [33;1H[49;78H3,1  [33;1H[?25h[?25l[49;67H~@k[33;1H[49;67H   [34;1H[49;78H4[34;1H[?25h[?25l[49;67H~@k[34;1H[49;67H   [35;1H[46m{[48;1H}[m[49;78H5[35;1H[?25h[?25l[49;67H~@k[35;1H[49;67H   [36;1H[35;1H{[48;1H}[49;78H6[36;1H[?25h[?25l[49;67H~@k[36;1H[49;67H   [37;1H[49;78H7[37;1H[?25h[?25l[49;67H~@k[37;1H[49;67H   [38;1H[49;78H8[38;1H[?25h[?25l[49;67H~@k[38;1H[49;67H   [39;1H[49;78H9[39;1H[?25h[?25l[49;67H~@k[39;1H[49;67H   [40;1H[49;77H40[40;1H[?25h[?25l[49;67H~@k[40;1H[49;67H   [41;1H[49;78H1[41;1H[?25h[?25l[49;67H~@k[41;1H[49;67H   [42;1H[49;78H2[42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [43;1H[49;78H3[43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [44;1H[49;78H4[44;1H[?25h[?25l[49;67H~@k[44;1H[49;67H   [45;1H[49;78H5[45;1H[?25h[?25l[49;67H~@k[45;1H[49;67H   [46;1H[49;78H6[46;1H[?25h[?25l[49;67H~@k[46;1H[49;67H   [47;1H[49;78H7[47;1H[?25h[?25l[49;67H~@k[47;1H[49;67H   [48;1H[35;1H[46m{[48;1H}[m[49;78H8[48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [47;1H[35;1H{[48;1H}[49;78H7[47;1H[?25h[?25l[49;67H~@k[47;1H[49;67H   [46;1H[49;78H6[46;1H[?25h[?25l[49;67H~@k[46;1H[49;67H   [45;1H[49;78H5[45;1H[?25h[?25l[49;67H~@k[45;1H[49;67H   [44;1H[49;78H4[44;1H[?25h[?25l[49;67H~@k[44;1H[49;67H   [43;1H[49;78H3[43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [42;1H[49;78H2[42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [41;1H[49;78H1[41;1H[?25h[?25l[49;67H~@k[41;1H[49;67H   [40;1H[49;78H0[40;1H[?25h[?25l[49;67H~@k[40;1H[49;67H   [39;1H[49;77H39[39;1H[?25h[?25l[49;67H~@k[39;1H[49;67H   [38;1H[49;78H8[38;1H[?25h[?25l[49;67H~@k[38;1H[49;67H   [39;1H[49;78H9[39;1H[?25h[?25l[49;67H~@k[39;1H[49;67H   [40;1H[49;77H40[40;1H[?25h[?25l[49;67H~@k[40;1H[49;67H   [41;1H[49;78H1[41;1H[?25h[?25l[49;67H~@k[41;1H[49;67H   [42;1H[49;78H2[42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;2H[49;80H2[42;2H[?25h[?25l[49;67H~@k[42;2H[49;67H   [42;3H[49;80H3[42;3H[?25h[?25l[49;67H~@k[42;3H[49;67H   [42;4H[49;80H4[42;4H[?25h[?25l[49;67H~@k[42;4H[49;67H   [42;5H[49;80H5[42;5H[?25h[?25l[49;67H~@k[42;5H[49;67H   [42;6H[49;80H6[42;6H[?25h[?25l[49;67H~@k[42;6H[49;67H   [42;7H[49;80H7[42;7H[?25h[?25l[49;67H~@k[42;7H[49;67H   [42;8H[49;80H8[42;8H[?25h[?25l[49;67H~@k[42;8H[49;67H   [42;9H[49;80H9[42;9H[?25h[?25l[49;67H~@k[42;9H[49;67H   [42;10H[49;80H10[42;10H[?25h[?25l[49;67H~@k[42;10H[49;67H   [42;11H[49;81H1[42;11H[?25h[?25l[49;67H~@k[42;11H[49;67H   [42;12H[49;81H2[42;12H[?25h[?25l[49;67H~@k[42;12H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;19H[49;81H9[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;20H[49;80H20[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;29H[49;81H9[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;30H[46m[[mi[46m][m[49;80H30[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;30H[46m[[mi[46m][m[49;81H0[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;29Hv[i][49;80H29[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;20H[49;81H0[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;19H[49;80H19[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;12H[49;81H2[42;12H[?25h[?25l[49;67H~@k[42;12H[49;67H   [42;11H[49;81H1[42;11H[?25h[?25l[49;67H~@k[42;11H[49;67H   [42;10H[49;81H0[42;10H[?25h[?25l[49;67H~@k[42;10H[49;67H   [42;9H[49;80H9 [42;9H[?25h[?25l[49;67H~@k[42;9H[49;67H   [42;8H[49;80H8[42;8H[?25h[?25l[49;67H~@k[42;8H[49;67H   [42;7H[49;80H7[42;7H[?25h[?25l[49;67H~@k[42;7H[49;67H   [42;6H[49;80H6[42;6H[?25h[?25l[49;67H~@k[42;6H[49;67H   [42;5H[49;80H5[42;5H[?25h[?25l[49;67H~@k[42;5H[49;67H   [42;4H[49;80H4[42;4H[?25h[?25l[49;67H~@k[42;4H[49;67H   [42;3H[49;80H3[42;3H[?25h[?25l[49;67H~@k[42;3H[49;67H   [42;2H[49;80H2[42;2H[?25h[?25l[49;67H~@k[42;2H[49;67H   [42;1H[49;80H1[42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [43;1H[49;78H3[43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [44;1H[49;78H4[44;1H[?25h[?25l[49;67H~@k[44;1H[49;67H   [43;1H[49;78H3[43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;2H[49;80H2[43;2H[?25h[?25l[49;67H~@k[43;2H[49;67H   [43;3H[49;80H3[43;3H[?25h[?25l[49;67H~@k[43;3H[49;67H   [43;4H[49;80H4[43;4H[?25h[?25l[49;67H~@k[43;4H[49;67H   [43;5H[49;80H5[43;5H[?25h[?25l[49;67H~@k[43;5H[49;67H   [43;6H[49;80H6[43;6H[?25h[?25l[49;67H~@k[43;6H[49;67H   [43;5H[49;80H5[43;5H[?25h[?25l[49;67H~@k[43;5H[49;67H   [43;4H[49;80H4[43;4H[?25h[?25l[49;67H~@k[43;4H[49;67H   [43;3H[49;80H3[43;3H[?25h[?25l[49;67H~@k[43;3H[49;67H   [43;2H[49;80H2[43;2H[?25h[?25l[49;67H~@k[43;2H[49;67H   [43;1H[49;80H1[43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [43;1H[?25h[?25l[49;67H~@k[43;1H[49;67H   [42;1H[49;78H2[42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;2H[49;80H2[42;2H[?25h[?25l[49;67H~@k[42;2H[49;67H   [42;3H[49;80H3[42;3H[?25h[?25l[49;67H~@k[42;3H[49;67H   [42;4H[49;80H4[42;4H[?25h[?25l[49;67H~@k[42;4H[49;67H   [42;5H[49;80H5[42;5H[?25h[?25l[49;67H~@k[42;5H[49;67H   [42;6H[49;80H6[42;6H[?25h[?25l[49;67H~@k[42;6H[49;67H   [42;7H[49;80H7[42;7H[?25h[?25l[49;67H~@k[42;7H[49;67H   [42;8H[49;80H8[42;8H[?25h[?25l[49;67H~@k[42;8H[49;67H   [42;9H[49;80H9[42;9H[?25h[?25l[49;67H~@k[42;9H[49;67H   [42;10H[49;80H10[42;10H[?25h[?25l[49;67H~@k[42;10H[49;67H   [42;11H[49;81H1[42;11H[?25h[?25l[49;67H~@k[42;11H[49;67H   [42;12H[49;81H2[42;12H[?25h[?25l[49;67H~@k[42;12H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;19H[49;81H9[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;20H[49;80H20[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;29H[49;81H9[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;30H[46m[[mi[46m][m[49;80H30[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;30H[46m[[mi[46m][m[49;81H0[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;29Hv[i][49;80H29[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;20H[49;81H0[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;19H[49;80H19[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;12H[49;81H2[42;12H[?25h[?25l[49;67H~@k[42;12H[49;67H   [42;11H[49;81H1[42;11H[?25h[?25l[49;67H~@k[42;11H[49;67H   [42;10H[49;81H0[42;10H[?25h[?25l[49;67H~@k[42;10H[49;67H   [42;9H[49;80H9 [42;9H[?25h[?25l[49;67H~@k[42;9H[49;67H   [42;8H[49;80H8[42;8H[?25h[?25l[49;67H~@k[42;8H[49;67H   [42;7H[49;80H7[42;7H[?25h[?25l[49;67H~@k[42;7H[49;67H   [42;6H[49;80H6[42;6H[?25h[?25l[49;67H~@k[42;6H[49;67H   [42;5H[49;80H5[42;5H[?25h[?25l[49;67H~@k[42;5H[49;67H   [42;4H[49;80H4[42;4H[?25h[?25l[49;67H~@k[42;4H[49;67H   [42;3H[49;80H3[42;3H[?25h[?25l[49;67H~@k[42;3H[49;67H   [42;2H[49;80H2[42;2H[?25h[?25l[49;67H~@k[42;2H[49;67H   [42;1H[49;80H1[42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;1H[?25h[?25l[49;67H~@k[42;1H[49;67H   [42;2H[49;80H2[42;2H[?25h[?25l[49;67H~@k[42;2H[49;67H   [42;3H[49;80H3[42;3H[?25h[?25l[49;67H~@k[42;3H[49;67H   [42;4H[49;80H4[42;4H[?25h[?25l[49;67H~@k[42;4H[49;67H   [42;5H[49;80H5[42;5H[?25h[?25l[49;67H~@k[42;5H[49;67H   [42;6H[49;80H6[42;6H[?25h[?25l[49;67H~@k[42;6H[49;67H   [42;7H[49;80H7[42;7H[?25h[?25l[49;67H~@k[42;7H[49;67H   [42;8H[49;80H8[42;8H[?25h[?25l[49;67H~@k[42;8H[49;67H   [42;9H[49;80H9[42;9H[?25h[?25l[49;67H~@k[42;9H[49;67H   [42;10H[49;80H10[42;10H[?25h[?25l[49;67H~@k[42;10H[49;67H   [42;11H[49;81H1[42;11H[?25h[?25l[49;67H~@k[42;11H[49;67H   [42;12H[49;81H2[42;12H[?25h[?25l[49;67H~@k[42;12H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;19H[49;81H9[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;20H[49;80H20[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;29H[49;81H9[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;30H[46m[[mi[46m][m[49;80H30[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;30H[46m[[mi[46m][m[49;81H0[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;29Hv[i][49;80H29[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;20H[49;81H0[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;19H[49;80H19[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;12H[49;81H2[42;12H[?25h[?25l[49;67H~@k[42;12H[49;67H   [42;13H[49;81H3[42;13H[?25h[?25l[49;67H~@k[42;13H[49;67H   [42;14H[49;81H4[42;14H[?25h[?25l[49;67H~@k[42;14H[49;67H   [42;15H[49;81H5[42;15H[?25h[?25l[49;67H~@k[42;15H[49;67H   [42;16H[49;81H6[42;16H[?25h[?25l[49;67H~@k[42;16H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;19H[49;81H9[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;20H[49;80H20[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [43;21H[49;78H3[43;21H[?25h[?25l[49;67H~@k[43;21H[49;67H   [44;21H[49;78H4[44;21H[?25h[?25l[49;67H~@k[44;21H[49;67H   [45;21H[49;78H5[45;21H[?25h[?25l[49;67H~@k[45;21H[49;67H   [46;5H[41;36H[46m{[46;5H}[m[49;78H6,5 [46;5H[?25h[?25l[49;67H~@k[46;5H[49;67H   [47;3H[40;8H[46m{[m[41;36H{[46;5H}
  [46m}[m[49;78H7,3[47;3H[?25h[?25l[49;67H~@k[47;3H[49;67H   [48;1H[35;1H[46m{[m[40;8H{[47;3H}
[46m}[m[49;78H8,1[48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [48;1H[?25h[?25l[49;67H~@k[48;1H[49;67H   [47;3H[35;1H{[40;8H[46m{[47;3H}[m
}[49;78H7,3[47;3H[?25h[?25l[49;67H~@k[47;3H[49;67H   [46;5H[40;8H{[41;36H[46m{[46;5H}[m
  }[49;78H6,5[46;5H[?25h[?25l[49;67H~@k[46;5H[49;67H   [45;21H[41;36H{[46;5H}[49;78H5,21[45;21H[?25h[?25l[49;67H~@k[45;21H[49;67H   [44;21H[49;78H4[44;21H[?25h[?25l[49;67H~@k[44;21H[49;67H   [43;21H[49;78H3[43;21H[?25h[?25l[49;67H~@k[43;21H[49;67H   [42;21H[49;78H2[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [41;21H[49;78H1[41;21H[?25h[?25l[49;67H~@k[41;21H[49;67H   [40;8H[46m{[47;3H}[m[49;78H0,8 [40;8H[?25h[?25l[49;67H~@k[40;8H[49;67H   [39;3H[36;18H[46m{[39;3H}[m[40;8H{[47;3H}[49;77H39,3[39;3H[?25h[?25l[49;67H~@k[39;3H[49;67H   [38;17H[36;18H{[39;3H}[49;78H8,17[38;17H[?25h[?25l[49;67H~@k[38;17H[49;67H   [37;21H[49;78H7,21[37;21H[?25h[?25l[49;67H~@k[37;21H[49;67H   [36;18H[46m{[39;3H}[m[49;78H6,18[36;18H[?25h[?25l[49;67H~@k[36;18H[49;67H   [35;1H[46m{[m[36;18H{[39;3H}[48;1H[46m}[m[49;78H5,1 [35;1H[?25h[?25l[49;67H~@k[35;1H[49;67H   [34;21H
{[48;1H}[49;78H4,21[34;21H[?25h[?25l[49;67H~@k[34;21H[49;67H   [33;3H[49;78H3,3 [33;3H[?25h[?25l[49;67H~@k[33;3H[49;67H   [32;1H[49;78H2,0-1[32;1H[?25h[?25l[49;67H~@k[32;1H[49;67H   [31;1H[49;78H1[31;1H[?25h[?25l[49;67H~@k[31;1H[49;67H   [30;1H[28;1H[46m{

}[m[49;78H0,1  [30;1H[?25h[?25l[49;67H~@k[30;1H[49;67H   [29;21H[28;1H{

}[49;77H29,21[29;21H[?25h[?25l[49;67H~@k[29;21H[49;67H   [28;1H[46m{

}[m[49;78H8,1 [28;1H[?25h[?25l[49;67H~@k[28;1H[49;67H   [27;21H
{

}[49;78H7,21[27;21H[?25h[?25l[49;67H~@k[27;21H[49;67H   [26;11H[49;78H6,1[26;11H[?25h[?25l[49;67H~@k[26;11H[49;67H   [25;1H[49;78H5,0-1[25;1H[?25h[?25l[49;67H~@k[25;1H[49;67H   [24;1H[12;1H[46m{[24;1H}[m[49;78H4,1  [24;1H[?25h[?25l[49;67H~@k[24;1H[49;67H   [23;3H[12;1H{[15;31H[46m{[23;3H}[m
}[49;78H3,3[23;3H[?25h[?25l[49;67H~@k[23;3H[49;67H   [22;21H[15;31H{[23;3H}[49;78H2,21[22;21H[?25h[?25l[49;67H~@k[22;21H[49;67H   [21;5H[19;10H[46m{[21;5H}[m[49;78H1,5 [21;5H[?25h[?25l[49;67H~@k[21;5H[49;67H   [20;21H[19;10H{[21;5H}[49;78H0,21[20;21H[?25h[?25l[49;67H~@k[20;21H[49;67H   [19;10H[46m{[21;5H}[m[49;77H19,10[19;10H[?25h[?25l[49;67H~@k[19;10H[49;67H   [18;5H[16;41H[46m{[18;5H}[m[19;10H{[21;5H}[49;78H8,5 [18;5H[?25h[?25l[49;67H~@k[18;5H[49;67H   [19;10H[16;41H{[18;5H}[19;10H[46m{[21;5H}[m[49;78H9,10[19;10H[?25h[?25l[49;67H~@k[19;10H[49;67H   [20;21H[19;10H{[21;5H}[49;77H20,21[20;21H[?25h[?25l[49;67H~@k[20;21H[49;67H   [21;5H[19;10H[46m{[21;5H}[m[49;78H1,5 [21;5H[?25h[?25l[49;67H~@k[21;5H[49;67H   [22;21H[19;10H{[21;5H}[49;78H2,21[22;21H[?25h[?25l[49;67H~@k[22;21H[49;67H   [23;3H[15;31H[46m{[23;3H}[m[49;78H3,3 [23;3H[?25h[?25l[49;67H~@k[23;3H[49;67H   [24;1H[12;1H[46m{[m[15;31H{[23;3H}
[46m}[m[49;78H4,1[24;1H[?25h[?25l[49;67H~@k[24;1H[49;67H   [25;1H[12;1H{[24;1H}[49;78H5,0-1[25;1H[?25h[?25l[49;67H~@k[25;1H[49;67H   [26;11H[49;78H6,11 [26;11H[?25h[?25l[49;67H~@k[26;11H[49;67H   [27;21H[49;78H7,2[27;21H[?25h[?25l[49;67H~@k[27;21H[49;67H   [28;1H[46m{

}[m[49;78H8,1 [28;1H[?25h[?25l[49;67H~@k[28;1H[49;67H   [29;21H[28;1H{

}[49;78H9,21[29;21H[?25h[?25l[49;67H~@k[29;21H[49;67H   [30;1H[28;1H[46m{

}[m[49;77H30,1 [30;1H[?25h[?25l[49;67H~@k[30;1H[49;67H   [31;1H[28;1H{

}[49;78H1,0-1[31;1H[?25h[?25l[49;67H~@k[31;1H[49;67H   [32;1H[49;78H2[32;1H[?25h[?25l[49;67H~@k[32;1H[49;67H   [33;3H[49;78H3,3  [33;3H[?25h[?25l[49;67H~@k[33;3H[49;67H   [34;21H[49;78H4,21[34;21H[?25h[?25l[49;67H~@k[34;21H[49;67H   [35;1H[46m{[48;1H}[m[49;78H5,1 [35;1H[?25h[?25l[49;67H~@k[35;1H[49;67H   [36;18H[35;1H{[36;18H[46m{[39;3H}[m[48;1H}[49;78H6,18[36;18H[?25h[?25l[49;67H~@k[36;18H[49;67H   [37;21H[36;18H{[39;3H}[49;78H7,21[37;21H[?25h[?25l[49;67H~@k[37;21H[49;67H   [38;17H[49;78H8,17[38;17H[?25h[?25l[49;67H~@k[38;17H[49;67H   [39;3H[36;18H[46m{[39;3H}[m[49;78H9,3 [39;3H[?25h[?25l[49;67H~@k[39;3H[49;67H   [40;8H[36;18H{[39;3H}[40;8H[46m{[47;3H}[m[49;77H40,8[40;8H[?25h[?25l[49;67H~@k[40;8H[49;67H   [41;21H[40;8H{[47;3H}[49;78H1,21[41;21H[?25h[?25l[49;67H~@k[41;21H[49;67H   [42;21H[49;78H2[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [43;21H[49;78H3[43;21H[?25h[?25l[49;67H~@k[43;21H[49;67H   [42;21H[49;78H2[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [43;21H[49;78H3[43;21H[?25h[?25l[49;67H~@k[43;21H[49;67H   [42;21H[49;78H2[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;29H[49;81H9[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;30H[46m[[mi[46m][m[49;80H30[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;33H[?25h[?25l[49;67Hi[42;33H[49;67H [42;33H[49;1H[1m-- INSERT --[m[49;13H[K[49;77H42,33[9CAll[42;33H[?25h[?25l[49;81H4[42;34H[?25h[?25l[46m[[mi[46m][m[49;81H3[42;33H[?25h[?25l ;[i][49;81H4]2;hello.cc + (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[42;34H[?25h[?25l+;[49;81H5[42;35H[?25h[?25l ;[49;81H6[42;36H[?25h[?25l';[49;81H7[42;37H[?25h[?25l[97m[101m][m;[49;81H8[42;38H[?25h[?25l;[42;38H[K[49;81H7[42;37H[?25h[?25l\;[49;81H8[42;38H[?25h[?25l[95m0[m;[49;81H9[42;39H[?25h[?25l[38;5;224m'\0'[m;[49;80H40[42;40H[?25h[49;1H[K[42;39H[?25l[49;67H^[[42;39H[49;67H  [42;40H[49;77H42,39[9CAll[42;39H[?25h[?25l[49;67HZ[42;39H[?25h[?25l[49;68HZ[42;39H[?1006l[?1002l[?2004l[49;1H"hello.cc"[49;67H[K[49;12H48L, 1021C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0ttman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello bart lisa
Hello Bart
Hello Lisa
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'bart sf' 'asf asfd'
Hello Bart Sf
Hello Asf Asfd}cÎÐÌU
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'bart sf' 'asf asfd'[11Pbart lisamake[Kvim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;49r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[49;1H"hello.cc" 48L, 1021C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in);
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[42;7H[32mconst[m [32mchar[m *name = argv[i] + [35m'\0'[m;[43;7H[32mchar[m friendlyName[strlen(name) + [31m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H42,39[9CAll]2;hello.cc (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[42;39H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in);
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i] + [38;5;224m'\0'[m;[43;7H[38;5;121mchar[m friendlyName[strlen(name) + [95m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H42,39[9CAll"hello.cc" 48L, 1021C[42;39H[?25h[?25l[49;67H~@k[42;39H[49;67H   [43;39H[49;78H3[43;39H[?25h[?25l[49;67H~@k[43;39H[49;67H   [44;38H[49;78H4,38[44;38H[?25h[?25l[49;67H~@k[44;38H[49;67H   [43;39H[49;78H3,39[43;39H[?25h[?25l[49;67H~@k[43;39H[49;67H   [42;39H[49;78H2[42;39H[?25h[?25l[49;67H~@k[42;39H[49;67H   [41;36H[46m{[46;5H}[m[49;78H1,36[41;36H[?25h[?25l[49;67H~@k[41;36H[49;67H   [42;39H[41;36H{[46;5H}[49;78H2,39[42;39H[?25h[?25l[49;67H~@k[42;39H[49;67H   [42;38H[49;81H8[42;38H[?25h[?25l[49;67H~@k[42;38H[49;67H   [42;37H[49;81H7[42;37H[?25h[?25l[49;67H~@k[42;37H[49;67H   [42;36H[49;81H6[42;36H[?25h[?25l[49;67H~@k[42;36H[49;67H   [42;35H[49;81H5[42;35H[?25h[?25l[49;67H~@k[42;35H[49;67H   [42;34H[49;81H4[42;34H[?25h[?25l[49;67H~@k[42;34H[49;67H   [42;33H[49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;30H[46m[[mi[46m][m[49;81H0[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;29Hv[i][49;80H29[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;20H[49;81H0[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;19H[49;80H19[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;17H[49;81H7[42;17H[?25h[?25l[49;67H~@k[42;17H[49;67H   [42;18H[49;81H8[42;18H[?25h[?25l[49;67H~@k[42;18H[49;67H   [42;19H[49;81H9[42;19H[?25h[?25l[49;67H~@k[42;19H[49;67H   [42;20H[49;80H20[42;20H[?25h[?25l[49;67H~@k[42;20H[49;67H   [42;21H[49;81H1[42;21H[?25h[?25l[49;67H~@k[42;21H[49;67H   [42;22H[49;81H2[42;22H[?25h[?25l[49;67H~@k[42;22H[49;67H   [42;23H[49;81H3[42;23H[?25h[?25l[49;67H~@k[42;23H[49;67H   [42;24H[49;81H4[42;24H[?25h[?25l[49;67H~@k[42;24H[49;67H   [42;25H[49;81H5[42;25H[?25h[?25l[49;67H~@k[42;25H[49;67H   [42;26H[49;81H6[42;26H[?25h[?25l[49;67H~@k[42;26H[49;67H   [42;27H[49;81H7[42;27H[?25h[?25l[49;67H~@k[42;27H[49;67H   [42;28H[49;81H8[42;28H[?25h[?25l[49;67H~@k[42;28H[49;67H   [42;29H[49;81H9[42;29H[?25h[?25l[49;67H~@k[42;29H[49;67H   [42;30H[46m[[mi[46m][m[49;80H30[42;30H[?25h[?25l[49;67H~@k[42;30H[49;67H   [42;31H[i][49;81H1[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;34H[49;81H4[42;34H[?25h[?25l[49;67H~@k[42;34H[49;67H   [42;35H[49;81H5[42;35H[?25h[?25l[49;67H~@k[42;35H[49;67H   [42;36H[49;81H6[42;36H[?25h[?25l[49;67H~@k[42;36H[49;67H   [42;37H[49;81H7[42;37H[?25h[?25l[49;67H~@k[42;37H[49;67H   [42;38H[49;81H8[42;38H[?25h[?25l[49;67H~@k[42;38H[49;67H   [42;39H[49;81H9[42;39H[?25h[?25l[49;67H~@k[42;39H[49;67H   [42;40H[49;80H40[42;40H[?25h[?25l[49;67H~@k[42;40H[49;67H   [42;40H[?25h[?25l[49;67H~@k[42;40H[49;67H   [42;40H[?25h[?25l[49;67H~@k[42;40H[49;67H   [42;40H[?25h[?25l[49;67H~@k[42;40H[49;67H   [42;40H[?25h[?25l[49;67H~@k[42;40H[49;67H   [41;36H[46m{[46;5H}[m[49;78H1,36[41;36H[?25h[?25l[49;67H~@k[41;36H[49;67H   [40;8H[46m{[m[41;36H{[46;5H}
  [46m}[m[49;78H0,8 [40;8H[?25h[?25l[49;67H~@k[40;8H[49;67H   [39;3H[36;18H[46m{[39;3H}[m[40;8H{[47;3H}[49;77H39,3[39;3H[?25h[?25l[49;67H~@k[39;3H[49;67H   [38;17H[36;18H{[39;3H}[49;78H8,17[38;17H[?25h[?25l[49;67H~@k[38;17H[49;67H   [37;40H[49;78H7,40[37;40H[?25h[?25l[49;67H~@k[37;40H[49;67H   [36;18H[46m{[39;3H}[m[49;78H6,18[36;18H[?25h[?25l[49;67H~@k[36;18H[49;67H   [35;1H[46m{[m[36;18H{[39;3H}[48;1H[46m}[m[49;78H5,1 [35;1H[?25h[?25l[49;67H~@k[35;1H[49;67H   [34;34Hmain[46m([28C)[m
{[48;1H}[49;78H4,34[34;34H[?25h[?25l[49;67H~@k[34;34H[49;67H   [33;3H
main([28C)[49;78H3,3 [33;3H[?25h[?25l[49;67H~@k[33;3H[49;67H   [32;1H[49;78H2,0-1[32;1H[?25h[?25l[49;67H~@k[32;1H[49;67H   [31;1H[49;78H1[31;1H[?25h[?25l[49;67H~@k[31;1H[49;67H   [30;1H[28;1H[46m{

}[m[49;78H0,1  [30;1H[?25h[?25l[49;67H~@k[30;1H[49;67H   [29;40H[28;1H{

}[49;77H29,40[29;40H[?25h[?25l[49;67H~@k[29;40H[49;67H   [28;1H[46m{

}[m[49;78H8,1 [28;1H[?25h[?25l[49;67H~@k[28;1H[49;67H   [27;26H[27;9H[46m([16C)[m
{

}[49;78H7,26[27;26H[?25h[?25l[49;67H~@k[27;26H[49;67H   [26;11H[27;9H([16C)[49;78H6,11[26;11H[?25h[?25l[49;67H~@k[26;11H[49;67H   [25;1H[49;78H5,0-1[25;1H[?25h[?25l[49;67H~@k[25;1H[49;67H   [24;1H[12;1H[46m{[24;1H}[m[49;78H4,1  [24;1H[?25h[?25l[49;67H~@k[24;1H[49;67H   [23;3H[12;1H{[15;31H[46m{[23;3H}[m
}[49;78H3,3[23;3H[?25h[?25l[49;67H~@k[23;3H[49;67H   [22;33H[15;31H{[23;3H}[49;78H2,33[22;33H[?25h[?25l[49;67H~@k[22;33H[49;67H   [21;5H[19;10H[46m{[21;5H}[m[49;78H1,5 [21;5H[?25h[?25l[49;67H~@k[21;5H[49;67H   [20;21H[19;10H{[21;5H}[49;78H0,21[20;21H[?25h[?25l[49;67H~@k[20;21H[49;67H   [19;10H[46m{[21;5H}[m[49;77H19,10[19;10H[?25h[?25l[49;67H~@k[19;10H[49;67H   [18;5H[16;41H[46m{[18;5H}[m[19;10H{[21;5H}[49;78H8,5 [18;5H[?25h[?25l[49;67H~@k[18;5H[49;67H   [17;35H[16;41H{[18;5H}[49;78H7,35[17;35H[?25h[?25l[49;67H~@k[17;35H[49;67H   [16;40H[49;78H6,40[16;40H[?25h[?25l[49;67H~@k[16;40H[49;67H   [15;31H[46m{[23;3H}[m[49;78H5,31[15;31H[?25h[?25l[49;67H~@k[15;31H[49;67H   [14;32H[15;31H{[23;3H}[49;78H4,32[14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [13;22H[49;78H3,2[13;22H[?25h[?25l[49;67H~@k[13;22H[49;67H   [14;32H[49;78H4,3[14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [15;31H[46m{[23;3H}[m[49;78H5,31[15;31H[?25h[?25l[49;67H~@k[15;31H[49;67H   [14;32H[15;31H{[23;3H}[49;78H4,32[14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [15;31H[46m{[23;3H}[m[49;78H5,31[15;31H[?25h[?25l[49;67H~@k[15;31H[49;67H   [15;30H {[23;3H}[49;81H0[15;30H[?25h[?25l[49;67H~@k[15;30H[49;67H   [15;29H[15;7H[46m([21C)[m[49;80H29[15;29H[?25h[?25l[49;67H~@k[15;29H[49;67H   [15;28H[15;7H([21C)[49;81H8[15;28H[?25h[?25l[49;67H~@k[15;28H[49;67H   [15;27H[49;81H7[15;27H[?25h[?25l[49;67H~@k[15;27H[49;67H   [15;26H[49;81H6[15;26H[?25h[?25l[49;67H~@k[15;26H[49;67H   [15;25H[49;81H5[15;25H[?25h[?25l[49;67H~@k[15;25H[49;67H   [15;24H[49;81H4[15;24H[?25h[?25l[49;67H~@k[15;24H[49;67H   [15;23H[49;81H3[15;23H[?25h[?25l[49;67H~@k[15;23H[49;67H   [15;22H[49;81H2[15;22H[?25h[?25l[49;67H~@k[15;22H[49;67H   [15;23H[49;81H3[15;23H[?25h[?25l[49;67H~@k[15;23H[49;67H   [14;23H[49;78H4[14;23H[?25h[?25l[49;67H~@k[14;23H[49;67H   [14;24H[49;81H4[14;24H[?25h[?25l[49;67H~@k[14;24H[49;67H   [14;25H[49;81H5[14;25H[?25h[?25l[49;67H~@k[14;25H[49;67H   [14;26H[49;81H6[14;26H[?25h[?25l[49;67H~@k[14;26H[49;67H   [14;27H[49;81H7[14;27H[?25h[?25l[49;67H~@k[14;27H[49;67H   [14;28H[46m([min[46m)[m[49;81H8[14;28H[?25h[?25l[49;67H~@k[14;28H[49;67H   [14;29H(in)[49;81H9[14;29H[?25h[?25l[49;67H~@k[14;29H[49;67H   [14;30H[49;80H30[14;30H[?25h[?25l[49;67H~@k[14;30H[49;67H   [14;31H[46m([min[46m)[m[49;81H1[14;31H[?25h[?25l[49;67H~@k[14;31H[49;67H   [14;32H(in)[49;81H2[14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [14;32H[?25h[?25l[49;67H~@k[14;32H[49;67H   [14;31H[46m([min[46m)[m[49;81H1[14;31H[?25h[?25l[49;67H~@k[14;31H[49;67H   [14;32H(in)[49;81H2[14;32H[?25h[?25l[49;67Hi[14;32H[49;67H [14;32H[49;1H[1m-- INSERT --[m[49;13H[K[49;77H14,32[9CAll[14;32H[?25h[?25l ;[49;81H3]2;hello.cc + (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[14;33H[?25h[?25l+;[49;81H4[14;34H[?25h[?25l ;[49;81H5[14;35H[?25h[?25l[95m1[m;[49;81H6[14;36H[?25h[49;1H[K[14;35H[?25l[49;67H^[[14;35H[49;67H  [14;36H[49;77H14,35[9CAll[14;35H[?25h[?25l[49;67HZ[14;35H[?25h[?25l[49;68HZ[14;35H[?1006l[?1002l[?2004l[49;1H"hello.cc"[49;67H[K[49;12H48L, 1025C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0ttman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'asdfs asf ' asdf [K[K[K[K[K'asfd 'asfd [K[K[K[K[K[Kasf'
Hello Asdfs Asf 
Hello Asfd Asf
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'asdfs asf ' 'asfd asf'make[Kvim hello.cc[8Pmake./hello 'asdfs asf ' 'asfd asf'[K./hello saf
Hello Saf
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ vim m[Khello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;49r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[49;1H"hello.cc" 48L, 1025C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in) + [31m1[m;
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[42;7H[32mconst[m [32mchar[m *name = argv[i] + [35m'\0'[m;[43;7H[32mchar[m friendlyName[strlen(name) + [31m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H14,35[9CAll]2;hello.cc (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[14;35H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in) + [95m1[m;
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i] + [38;5;224m'\0'[m;[43;7H[38;5;121mchar[m friendlyName[strlen(name) + [95m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H14,35[9CAll"hello.cc" 48L, 1025C[14;35H[?25h[?25l[49;67H~@k[14;35H[49;67H   [15;31H[46m{[23;3H}[m[49;78H5,31[15;31H[?25h[?25l[49;67H~@k[15;31H[49;67H   [16;31H[15;31H{[23;3H}[49;78H6[16;31H[?25h[?25l[49;67H~@k[16;31H[49;67H   [17;31H[46m[[mi[46m][m[49;78H7[17;31H[?25h[?25l[49;67H~@k[17;31H[49;67H   [18;5H[16;41H[46m{[m[17;31H[i]
    [46m}[m[49;78H8,5 [18;5H[?25h[?25l[49;67H~@k[18;5H[49;67H   [19;10H[16;41H{[18;5H}[19;10H[46m{[21;5H}[m[49;78H9,10[19;10H[?25h[?25l[49;67H~@k[19;10H[49;67H   [20;21H[19;10H{[21;5H}[49;77H20,21[20;21H[?25h[?25l[49;67H~@k[20;21H[49;67H   [21;5H[19;10H[46m{[21;5H}[m[49;78H1,5 [21;5H[?25h[?25l[49;67H~@k[21;5H[49;67H   [22;31H[19;10H{[21;5H}[22;29H[46m[[mi[46m][m[49;78H2,31[22;31H[?25h[?25l[49;67H~@k[22;31H[49;67H   [23;3H[15;31H[46m{[m[22;29H[i]
  [46m}[m[49;78H3,3 [23;3H[?25h[?25l[49;67H~@k[23;3H[49;67H   [24;1H[12;1H[46m{[m[15;31H{[23;3H}
[46m}[m[49;78H4,1[24;1H[?25h[?25l[49;67H~@k[24;1H[49;67H   [25;1H[12;1H{[24;1H}[49;78H5,0-1[25;1H[?25h[?25l[49;67H~@k[25;1H[49;67H   [26;11H[49;78H6,11 [26;11H[?25h[?25l[49;67H~@k[26;11H[49;67H   [27;26H[27;9H[46m([16C)[m[49;78H7,26[27;26H[?25h[?25l[49;67H~@k[27;26H[49;67H   [28;1H[27;9H([16C)
[46m{

}[m[49;78H8,1 [28;1H[?25h[?25l[49;67H~@k[28;1H[49;67H   [29;31H[28;1H{

}[49;78H9,31[29;31H[?25h[?25l[49;67H~@k[29;31H[49;67H   [30;1H[28;1H[46m{

}[m[49;77H30,1 [30;1H[?25h[?25l[49;67H~@k[30;1H[49;67H   [31;1H[28;1H{

}[49;78H1,0-1[31;1H[?25h[?25l[49;67H~@k[31;1H[49;67H   [32;1H[49;78H2[32;1H[?25h[?25l[49;67H~@k[32;1H[49;67H   [33;3H[49;78H3,3  [33;3H[?25h[?25l[49;67H~@k[33;3H[49;67H   [34;31H[49;78H4,31[34;31H[?25h[?25l[49;67H~@k[34;31H[49;67H   [35;1H[46m{[48;1H}[m[49;78H5,1 [35;1H[?25h[?25l[49;67H~@k[35;1H[49;67H   [36;18H[35;1H{[36;18H[46m{[39;3H}[m[48;1H}[49;78H6,18[36;18H[?25h[?25l[49;67H~@k[36;18H[49;67H   [37;31H[36;18H{[39;3H}[49;78H7,31[37;31H[?25h[?25l[49;67H~@k[37;31H[49;67H   [38;17H[49;78H8,17[38;17H[?25h[?25l[49;67H~@k[38;17H[49;67H   [39;3H[36;18H[46m{[39;3H}[m[49;78H9,3 [39;3H[?25h[?25l[49;67H~@k[39;3H[49;67H   [40;8H[36;18H{[39;3H}[40;8H[46m{[47;3H}[m[49;77H40,8[40;8H[?25h[?25l[49;67H~@k[40;8H[49;67H   [41;31H[40;8H{[47;3H}[49;78H1,31[41;31H[?25h[?25l[49;67H~@k[41;31H[49;67H   [42;31H[49;78H2[42;31H[?25h[?25l[49;67H~@k[42;31H[49;67H   [42;32H[46m[[mi[46m][m[49;81H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [42;33H[i][49;81H3[42;33H[?25h[?25l[49;67H~@k[42;33H[49;67H   [42;34H[49;81H4[42;34H[?25h[?25l[49;67H~@k[42;34H[49;67H   [42;35H[49;81H5[42;35H[?25h[?25l[49;67H~@k[42;35H[49;67H   [42;36H[49;81H6[42;36H[?25h[?25l[49;67H~@k[42;36H[49;67H   [42;37H[49;81H7[42;37H[?25h[?25l[49;67H~@k[42;37H[49;67H   [42;38H[49;81H8[42;38H[?25h[?25l[49;67H~@k[42;38H[49;67H   [42;39H[49;81H9[42;39H[?25h[?25l[49;67H~@k[42;39H[49;67H   [42;40H[49;80H40[42;40H[?25h[?25l[49;67Hi[42;40H[49;67H [42;40H[49;1H[1m-- INSERT --[m[49;13H[K[49;77H42,40[9CAll[42;40H[?25h[?25l'\[95m0[m;[42;40H[K[49;80H39]2;hello.cc + (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[42;39H[?25h[?25l;[42;39H[K[49;81H8[42;38H[?25h[?25l;[42;38H[K[49;81H7[42;37H[?25h[?25l;[42;37H[K[49;81H6[42;36H[?25h[?25l;[42;36H[K[49;81H5[42;35H[?25h[?25l;[42;35H[K[49;81H4[42;34H[?25h[?25l;[42;34H[K[42;30H[46m[[mi[46m][m[49;81H3[42;33H[?25h[49;1H[K[42;32H[?25l[49;67H^[[42;32H[49;67H  [42;33H[49;77H42,32[9CAll[42;32H[?25h[?25l[49;67HZ[42;32H[?25h[?25l[49;68HZ[42;32H[?1006l[?1002l[?2004l[49;1H"hello.cc"[49;67H[K[49;12H48L, 1018C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0ttman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ makevim hello.cc[1P./hello saf'asdfs asf ' 'asfd asf'
Hello Asdfs Asf 
Hello Asfd Asf
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'asdfs asf ' 'asfd asf'make[K./hello 'asdfs asf ' 'asfd asf'[K./hello 'asdfs asf ' 'asfd asf'make[Kvim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;49r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[49;1H"hello.cc" 48L, 1018C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in) + [31m1[m;
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[42;7H[32mconst[m [32mchar[m *name = argv[106m[[mi[106m][m;[43;7H[32mchar[m friendlyName[strlen(name) + [31m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H42,32[9CAll]2;hello.cc (~/projects/i240b/submit/lab2/exercises/2-hello) - VIM]1;hello.cc[42;32H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in) + [95m1[m;
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[46m[[mi[46m][m;[43;7H[38;5;121mchar[m friendlyName[strlen(name) + [95m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;77H42,32[9CAll"hello.cc" 48L, 1018C[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [43;32H[42;30H[i][49;78H3[43;32H[?25h[?25l[49;67H~@k[43;32H[49;67H   [42;32H[46m[[mi[46m][m[49;78H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [41;32H[42;30H[i][49;78H1[41;32H[?25h[?25l[49;67H~@k[41;32H[49;67H   [40;8H[46m{[47;3H}[m[49;78H0,8 [40;8H[?25h[?25l[49;67H~@k[40;8H[49;67H   [41;32H[40;8H{[47;3H}[49;78H1,32[41;32H[?25h[?25l[49;67H~@k[41;32H[49;67H   [42;32H[46m[[mi[46m][m[49;78H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [43;32H[42;30H[i][49;78H3[43;32H[?25h[?25l[49;67H~@k[43;32H[49;67H   [44;32H[49;78H4[44;32H[?25h[?25l[49;67H~@k[44;32H[49;67H   [45;29H[49;78H5,29[45;29H[?25h[?25l[49;67H~@k[45;29H[49;67H   [46;5H[41;36H[46m{[46;5H}[m[49;78H6,5 [46;5H[?25h[?25l[49;67H~@k[46;5H[49;67H   [47;3H[40;8H[46m{[m[41;36H{[46;5H}
  [46m}[m[49;78H7,3[47;3H[?25h[?25l[49;67H~@k[47;3H[49;67H   [46;5H[40;8H{[41;36H[46m{[46;5H}[m
  }[49;78H6,5[46;5H[?25h[?25l[49;67H~@k[46;5H[49;67H   [45;29H[41;36H{[46;5H}[49;78H5,29[45;29H[?25h[?25l[49;67H~@k[45;29H[49;67H   [44;32H[49;78H4,32[44;32H[?25h[?25l[49;67H~@k[44;32H[49;67H   [43;32H[49;78H3[43;32H[?25h[?25l[49;67H~@k[43;32H[49;67H   [42;32H[46m[[mi[46m][m[49;78H2[42;32H[?25h[?25l[49;67H~@k[42;32H[49;67H   [41;32H[42;30H[i][49;78H1[41;32H[?25h[?25l[49;67H~@k[41;32H[49;67H   [40;8H[46m{[47;3H}[m[49;78H0,8 [40;8H[?25h[?25l[49;67H~@k[40;8H[49;67H   [39;3H[36;18H[46m{[39;3H}[m[40;8H{[47;3H}[49;77H39,3[39;3H[?25h[?25l[49;67H~@k[39;3H[49;67H   [38;17H[36;18H{[39;3H}[49;78H8,17[38;17H[?25h[?25l[49;67H~@k[38;17H[49;67H   [37;32H[49;78H7,32[37;32H[?25h[?25l[49;67H~@k[37;32H[49;67H   [36;18H[46m{[39;3H}[m[49;78H6,18[36;18H[?25h[?25l[49;67H~@k[36;18H[49;67H   [35;1H[46m{[m[36;18H{[39;3H}[48;1H[46m}[m[49;78H5,1 [35;1H[?25h[?25l[49;67H~@k[35;1H[49;67H   [34;32H[46m[][m
{[48;1H}[49;78H4,32[34;32H[?25h[?25l[49;67H~@k[34;32H[49;67H   [33;3H[34;32H[][49;78H3,3 [33;3H[?25h[?25l[49;67H~@k[33;3H[49;67H   [32;1H[49;78H2,0-1[32;1H[?25h[?25l[49;67H~@k[32;1H[49;67H   [31;1H[49;78H1[31;1H[?25h[?25l[49;67H~@k[31;1H[49;67H   [30;1H[28;1H[46m{

}[m[49;78H0,1  [30;1H[?25h[?25l[49;67H~@k[30;1H[49;67H   [29;32H[28;1H{

}[49;77H29,32[29;32H[?25h[?25l[49;67H~@k[29;32H[49;67H   [28;1H[46m{

}[m[49;78H8,1 [28;1H[?25h[?25l[49;67H~@k[28;1H[49;67H   [27;26H[27;9H[46m([16C)[m
{

}[49;78H7,26[27;26H[?25h[?25l[49;67H~@k[27;26H[49;67H   [26;11H[27;9H([16C)[49;78H6,11[26;11H[?25h[?25l[49;67H~@k[26;11H[49;67H   [25;1H[49;78H5,0-1[25;1H[?25h[?25l[49;67H~@k[25;1H[49;67H   [24;1H[12;1H[46m{[24;1H}[m[49;78H4,1  [24;1H[?25h[?25l[49;67H~@k[24;1H[49;67H   [23;3H[12;1H{[15;31H[46m{[23;3H}[m
}[49;78H3,3[23;3H[?25h[?25l[49;67H~@k[23;3H[49;67H   [22;32H[15;31H{[22;26H[46m([min[i][46m)[m
  }[49;78H2,32[22;32H[?25h[?25l[49;67HZ[22;32H[?25h[?25l[49;68HZ[22;32H[49;1H[?1006l[?1002l[?2004l]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[49;1H[K[49;1H[?2004l[?1l>[?25h[?1049l[23;0;0ttman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ make
make: 'hello' is up to date.
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ makevim hello.cc./hello 'asdfs asf ' 'asfd asf'make[K./hello 'asdfs asf ' 'asfd asf'
Hello Asdfs Asf 
Hello Asfd Asf
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ ./hello 'asdfs asf ' 'asfd asf'make[Kvim hello.cc./hello 'asdfs asf ' 'asfd asf'make[Kvim hello.cc[1P./hello saf'asdfs asf ' 'asfd asf'make[Kvim hello.cc./hello 'bart sf' 'asf asfd'[11Pbart lisa
Hello Bart
Hello Lisa
tman1@g7-16:~/i240b/submit/lab2/exercises/2-hello$ cd ..
tman1@g7-16:~/i240b/submit/lab2/exercises$ ls
1-hello  2-hello  3-overload  Makefile
tman1@g7-16:~/i240b/submit/lab2/exercises$ cd 3[K[K[K[Kcat Makefile 
all:
                echo "hello $$USER"
tman1@g7-16:~/i240b/submit/lab2/exercises$ cd 3-overload/
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ ls
Makefile  overload.cc
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ cat overload.cc 
#include <iostream>

int f(int *a) { return *a * 2; }
int f(int a) { return a + 1;}
int f(int a, int b) { return a - b; }

int
main() {
  int a = 2;
  int b = 3;
  std::cout 
    << "f(a) = " << f(a)
    << "; f(&a) = " << f(&a)
    << "; f(a, b) = " << f(a, b)
    << std::endl;
}
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ make
g++ -g -Wall -std=c++17    overload.cc   -o overload
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ .//[K[K/overload 
f(a) = 3; f(&a) = 4; f(a, b) = -1
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ gd b[K[Kb overload
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from overload...done.
(gdb) b f
f(int)       f(int*)      f(int, int)  frame_dummy  
(gdb) b f(int*) 
Breakpoint 1 at 0x117d: file overload.cc, line 3.
(gdb) r
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe668) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p a
$1 = (int *) 0x7fffffffe668
(gdb) p *a
$2 = 2
(gdb) p *a=5
$3 = 5
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe668) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p a
$4 = (int *) 0x7fffffffe668
(gdb) p *a
$5 = 2
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe668) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) c
Continuing.
f(a) = 3; f(&a) = 4; f(a, b) = -1
[Inferior 1 (process 200946) exited normally]
(gdb) start [K[K[K[K[K[Kb[Ksta[K[K[Kr
Starting program: /import/linux/home1/tman1/projects/i240b/submit/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe668) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) *p[K[Kp *a=5
$6 = 5
(gdb) r[Kc
Continuing.
f(a) = 3; f(&a) = 10; f(a, b) = 2
[Inferior 1 (process 200976) exited normally]
(gdb) l
1	#include <iostream>
2	
3	int f(int *a) { return *a * 2; }
4	int f(int a) { return a + 1;}
5	int f(int a, int b) { return a - b; }
6	
7	int
8	main() {
9	  int a = 2;
10	  int b = 3;
(gdb) l
11	  std::cout 
12	    << "f(a) = " << f(a)
13	    << "; f(&a) = " << f(&a)
14	    << "; f(a, b) = " << f(a, b)
15	    << std::endl;
16	}
(gdb) 
Line number 17 out of range; overload.cc has 16 lines.
(gdb) q
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ ls
Makefile  overload  overload.cc
tman1@g7-16:~/i240b/submit/lab2/exercises/3-overload$ cd ..
tman1@g7-16:~/i240b/submit/lab2/exercises$ ls
1-hello  2-hello  3-overload  Makefile
tman1@g7-16:~/i240b/submit/lab2/exercises$ git status
On branch master
Your branch is up to date with 'origin/master'.

Changes not staged for commit:
  (use "git add/rm <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	[31mdeleted:    ../../../man_p1.txt[m
	[31mdeleted:    ../../../sample_1.txt[m

Untracked files:
  (use "git add <file>..." to include in what will be committed)

	[31m../[m

no changes added to commit (use "git add" and/or "git commit -a")
tman1@g7-16:~/i240b/submit/lab2/exercises$ cd ..
tman1@g7-16:~/i240b/submit/lab2$ ls
exercises  lab2  lab2.html  lab2.log  lab2.pdf	lab2.umt
tman1@g7-16:~/i240b/submit/lab2$ git status
On branch master
Your branch is up to date with 'origin/master'.

Changes not staged for commit:
  (use "git add/rm <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	[31mdeleted:    ../../man_p1.txt[m
	[31mdeleted:    ../../sample_1.txt[m

Untracked files:
  (use "git add <file>..." to include in what will be committed)

	[31m./[m

no changes added to commit (use "git add" and/or "git commit -a")
tman1@g7-16:~/i240b/submit/lab2$ cd ..
tman1@g7-16:~/i240b/submit$ ls
lab0  lab1  lab2
tman1@g7-16:~/i240b/submit$ git status -s
 [31mD[m ../man_p1.txt
 [31mD[m ../sample_1.txt
[31m??[m lab2/
tman1@g7-16:~/i240b/submit$ cd ..
tman1@g7-16:~/i240b$ ls
README.md  submit
tman1@g7-16:~/i240b$ git status -s
 [31mD[m man_p1.txt
 [31mD[m sample_1.txt
[31m??[m submit/lab2/
tman1@g7-16:~/i240b$ git add [K [K
Nothing specified, nothing added.
Maybe you wanted to say 'git add .'?
tman1@g7-16:~/i240b$ git add .[K-a
error: unknown switch `a'
usage: git add [<options>] [--] <pathspec>...

    -n, --dry-run         dry run
    -v, --verbose         be verbose

    -i, --interactive     interactive picking
    -p, --patch           select hunks interactively
    -e, --edit            edit current diff and apply
    -f, --force           allow adding otherwise ignored files
    -u, --update          update tracked files
    --renormalize         renormalize EOL of tracked files (implies -u)
    -N, --intent-to-add   record only the fact that the path will be added later
    -A, --all             add changes from all tracked and untracked files
    --ignore-removal      ignore paths removed in the working tree (same as --no-all)
    --refresh             don't add, only refresh the index
    --ignore-errors       just skip files which cannot be added because of errors
    --ignore-missing      check if - even missing - files are ignored in dry run
    --chmod (+|-)x        override the executable bit of the listed files

tman1@g7-16:~/i240b$ git add -all
error: did you mean `--all` (with two dashes ?)
tman1@g7-16:~/i240b$ git add -all-all
tman1@g7-16:~/i240b$ git status -s
[32mD[m  man_p1.txt
[32mD[m  sample_1.txt
[32mA[m  submit/lab2/exercises/.gitignore
[32mA[m  submit/lab2/exercises/1-hello/.gitignore
[32mA[m  submit/lab2/exercises/1-hello/Makefile
[32mA[m  submit/lab2/exercises/1-hello/README
[32mA[m  submit/lab2/exercises/1-hello/hello.cc
[32mA[m  submit/lab2/exercises/2-hello/.gitignore
[32mA[m  submit/lab2/exercises/2-hello/Makefile
[32mA[m  submit/lab2/exercises/2-hello/README
[32mA[m  submit/lab2/exercises/2-hello/hello.cc
[32mA[m  submit/lab2/exercises/2-hello/hello.cc~
[32mA[m  submit/lab2/exercises/3-overload/.gitignore
[32mA[m  submit/lab2/exercises/3-overload/Makefile
[32mA[m  submit/lab2/exercises/3-overload/overload.cc
[32mA[m  submit/lab2/exercises/Makefile
[32mA[m  submit/lab2/lab2.html
[32mA[m  submit/lab2/lab2.log
[32mA[m  submit/lab2/lab2.pdf
[32mA[m  submit/lab2/lab2.umt
[32mA[m  submit/lab2/lab2/hl-fine_blue.css
[32mA[m  submit/lab2/lab2/hl-fine_blue.sty
tman1@g7-16:~/i240b$ git commit -m[K[K[K[K[K[K[K[K[K[K[K[K[Kexit
exit

Script done on 2020-02-06 15:39:17-05:00 [COMMAND_EXIT_CODE="0"]
